99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
#include "esp32_mquickjs_wifi_radio.h"
#include "esp32_mquickjs_memory.h"
#include "esp32_mquickjs_wifi_promiscuous_driver.h"
#include "esp32_mquickjs_wifi_wait.h"

/* The shared Radio also builds for ESP-NOW without the Wi-Fi JS module. */
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
#include "esp32_mquickjs_wifi_roaming.h"
#include "esp32_mquickjs_wifi_rrm_radio.h"
#include "esp32_mquickjs_wifi_eap_radio.h"
#include "esp32_mquickjs_wifi_smartconfig_radio.h"
#include "esp32_mquickjs_wifi_wps_radio.h"
#include "esp32_mquickjs_wifi_wps_ap_radio.h"
#include "esp32_mquickjs_wifi_dpp_radio.h"
#include "esp32_mquickjs_wifi_nan_radio.h"
#include "esp32_mquickjs_wifi_mesh_radio.h"
#include "esp32_mquickjs_wifi_ap_prestart.h"
#include "esp32_mquickjs_wifi_antenna.h"
#include "esp32_mquickjs_wifi_raw_tx_ap.h"
#include "esp32_mquickjs_wifi_raw_tx_recovery.h"
#include "esp32_mquickjs_wifi_ftm_recovery.h"
#include "esp32_mquickjs_wifi_action_radio.h"
#include "esp32_mquickjs_wifi_action_sdk.h"
#include "esp32_mquickjs_wifi_vendor_ie_watch.h"
#include "esp32_mquickjs_wifi_vendor_ie.h"
#include "esp32_mquickjs_wifi_wapi_radio.h"
#include "esp32_mquickjs_wifi_twt_probe_result.h"
#include "esp32_mquickjs_wifi_twt_setup_result.h"
#include "esp32_mquickjs_wifi_twt_broadcast_timer.h"
#include "esp32_mquickjs_wifi_twt_radio.h"
#include "esp32_mquickjs_wifi_twt_agreement_radio.h"
#endif

#if CONFIG_ESP32_MQUICKJS_WIFI_RADIO

#include "esp32_mquickjs_nvs_flash_boot.h"
#include "esp32_mquickjs_wireless_core.h"
#include "esp32_mquickjs_core.h"

#include <stdatomic.h>
#include <stdlib.h>
#include <string.h>

#include "esp_check.h"
#include "esp_event.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"

#define WIFI_RADIO_MAX_LEASES 16U
#define WIFI_RADIO_START_EVENT_TIMEOUT_MS 5000U
#define WIFI_RADIO_STOP_EVENT_TIMEOUT_MS 1000U
ESP_EVENT_DEFINE_BASE(ESP32QJS_WIFI_RADIO_CONTROL_EVENT);
enum { RADIO_EVENTS_IDLE, RADIO_EVENTS_START, RADIO_EVENTS_STOP, RADIO_EVENTS_AP_STOP, RADIO_EVENTS_AP_START, RADIO_EVENTS_RESTART, RADIO_EVENTS_STA_START };
enum { AP_STOP_IDLE, AP_STOP_READY, AP_STOP_ATTEMPTED, AP_STOP_SUBMITTED, AP_STOP_EVENTS_DONE, AP_STOP_QUIESCED };

typedef struct {
    uint32_t identity;
    uint32_t promiscuous_identity;
    esp32_mquickjs_wifi_promiscuous_token_t rx_token;
    bool promiscuous_closing;
    esp32_mquickjs_wifi_radio_client_t client;
    wifi_mode_t required_mode;
    uint8_t primary_channel;
    uint8_t secondary_channel;
    bool fixed_channel;
    bool channel_conflict;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    uint32_t raw_tx_identity;
    bool raw_tx_channel_pinned;
#endif
} wifi_radio_live_lease_t;

typedef struct {
    portMUX_TYPE lock;
    wifi_radio_live_lease_t leases[WIFI_RADIO_MAX_LEASES];
    esp32_mquickjs_wifi_radio_driver_state_t driver_state;
    bool driver_owned;
    bool storage_configured;
    wifi_storage_t storage;
    esp32_mquickjs_wifi_radio_config_result_t configuration;
    esp32_mquickjs_wifi_radio_config_result_t activation;
    bool started;
    bool stop_required;
    bool stop_submitted;
    uint8_t ap_stop_phase;
    bool ap_reopen_pending, ap_reopen_attempted, ap_reopen_config_pending;
    bool ap_reopen_quiesced, ap_reopen_restore_complete;
    uint32_t ap_transition_application, ap_transition_station, ap_transition_access_point;
    esp_err_t ap_stop_error;
    uint8_t event_phase, event_expected, event_seen, event_live;
    bool event_fence_posted, event_fence_seen;
    uint32_t event_identity, event_revision;
    bool restart_required;
    wifi_mode_t effective_mode;
    const char *cleanup_stage;
    esp_err_t cleanup_error;
    const char *fault_stage;
    esp_err_t fault_error;
    uint32_t generation;
    uint32_t next_lease_identity;
    uint32_t next_promiscuous_identity;
    uint32_t next_operation_identity;
    uint32_t next_lifecycle_identity;
    uint32_t wake_locks;
    esp_err_t wake_lock_error;
    esp32_mquickjs_wifi_radio_lifecycle_t lifecycle;
    esp32_mquickjs_wifi_radio_operation_t operation;
    uint32_t clients[ESP32_MQUICKJS_WIFI_RADIO_CLIENT_COUNT];
    uint8_t primary_channel;
    wifi_second_chan_t secondary_channel;
    uint32_t channel_generation;
    uint64_t channel_observation_revision;
    esp_err_t channel_observation_error;
    bool promiscuous_claimed;
    esp32_mquickjs_wifi_radio_client_t promiscuous_client;
    uint32_t promiscuous_lease_identity;
} wifi_radio_state_t;

static const char *TAG = "esp32qjs_wifi_radio";
#if ESP32_MQUICKJS_WIFI_MESH_AVAILABLE
typedef struct wifi_radio_mesh wifi_radio_mesh_t;
static wifi_radio_mesh_t *s_mesh_radio;
static bool wifi_radio_mesh_worker_locked(void);
static bool wifi_radio_mesh_stop_owner_locked(const esp32_mquickjs_wifi_radio_lease_t *lease);
static bool wifi_radio_mesh_release_owner_locked(const esp32_mquickjs_wifi_radio_lease_t *lease);
#define WIFI_RADIO_MESH_PENDING (s_mesh_radio != NULL)
#else
#define WIFI_RADIO_MESH_PENDING false
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && (CONFIG_ESP_WIFI_NAN_SYNC_ENABLE || CONFIG_ESP_WIFI_NAN_USD_ENABLE)
typedef struct wifi_radio_nan wifi_radio_nan_t;
static wifi_radio_nan_t *s_nan_radio;
#define WIFI_RADIO_NAN_PENDING (s_nan_radio != NULL)
#else
#define WIFI_RADIO_NAN_PENDING false
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_DPP_SUPPORT
typedef struct {
    esp32_mquickjs_wifi_dpp_worker_t *worker;
    wifi_config_t saved, scratch;
    wifi_storage_t storage;
    uint32_t owners[3];
    wifi_second_chan_t home_secondary;
    uint8_t home_primary;
    bool listen_attempted, channel_restored;
    bool selection_attempted, storage_attempted, station_mutated;
    bool config_restored, storage_restored, connection_borrowed, connection_used, connection_ready;
    bool restore_requires_restart, restore_stopped, restore_started, restore_native_retired;
    bool restore_start_attempted, restore_start_accepted, restore_policies_done, config_restore_written;
    bool restore_recovery_pending, restore_recovery_reset;
    uint32_t restore_recovery_attempts;
    bool allow_ap_restart;
    wifi_mode_t restore_mode;
    wifi_ps_type_t restore_power_save;
    uint16_t restore_inactive[2];
    int8_t restore_tx_power;
    esp_err_t restore_start_error;
    esp_err_t error;
    const char *stage;
} wifi_radio_dpp_t;
static wifi_radio_dpp_t *s_dpp_radio;
static bool wifi_radio_dpp_stop_owner_locked(uint32_t identity);
#define WIFI_RADIO_DPP_PENDING (s_dpp_radio != NULL)
#else
#define WIFI_RADIO_DPP_PENDING false
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
/* Operation mutex only. Single lazy binding; decoder owns all native secrets. */
typedef struct {
    esp32_mquickjs_wifi_smartconfig_decoder_t *decoder;
    uint32_t owners[3];
    wifi_second_chan_t home_secondary;
    uint8_t home_primary;
    bool channel_restored, connection_borrowed, connection_used;
} wifi_radio_smartconfig_t;
static wifi_radio_smartconfig_t *s_sc_radio;
/* Numeric boot-scoped marker; callbacks never dereference the lazy binding. */
static uint32_t s_sc_fence_posted, s_sc_fence_seen;
#define WIFI_RADIO_SMARTCONFIG_FENCE_EVENT 7
#define WIFI_RADIO_SMARTCONFIG_PENDING (s_sc_radio != NULL)
/* Lazy WPS binding owns the saved Station secret and scratch readback. Only
 * the operation mutex accesses it; boot event callbacks use numeric tokens. */
typedef struct {
    esp32_mquickjs_wifi_wps_worker_t *worker;
    wifi_config_t saved, scratch;
    uint32_t owners[3];
    wifi_storage_t storage;
    wifi_second_chan_t home_secondary;
    uint8_t home_primary;
    bool storage_attempted, start_attempted;
    bool config_restored, channel_restored, storage_restored;
    esp_err_t error;
    const char *stage;
} wifi_radio_wps_t;
