99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
static wifi_radio_wps_t *s_wps_radio;
static uint32_t s_wps_fence_posted, s_wps_fence_seen;
#define WIFI_RADIO_WPS_FENCE_EVENT 8
#if CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR
typedef struct {
    esp32_mquickjs_wifi_wps_ap_worker_t *worker;
    uint32_t owners[3];
    esp_err_t error;
    const char *stage;
} wifi_radio_wps_ap_t;
static wifi_radio_wps_ap_t *s_wps_ap_radio;
#define WIFI_RADIO_WPS_PENDING (s_wps_radio != NULL || s_wps_ap_radio != NULL)
#else
#define WIFI_RADIO_WPS_PENDING (s_wps_radio != NULL)
#endif
#else
#define WIFI_RADIO_SMARTCONFIG_PENDING false
#define WIFI_RADIO_WPS_PENDING false
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
/* Operation mutex only. Credentials remain in the installer's native owner. */
static struct {
    uint64_t identity;
    uint32_t generation, owners[3];
    bool ready;
} s_eap_radio;
#define WIFI_RADIO_EAP_PENDING (s_eap_radio.identity != 0)
#else
#define WIFI_RADIO_EAP_PENDING false
#endif
static const char s_wifi_radio_channel_lane_key;
static wifi_radio_state_t s_radio = {
    .lock = portMUX_INITIALIZER_UNLOCKED,
    .generation = 1,
    .next_lease_identity = 1,
    .next_promiscuous_identity = 1,
    .next_operation_identity = 1,
    .next_lifecycle_identity = 1,
};
/* Driver-owned default-loop listener. Shutdown unregisters it and waits for
 * entered callbacks before deinit; the statically allocated mutex is boot-lived. */
static esp_event_handler_instance_t s_channel_event_instance;
/* Boot-owned marker handler contains no driver/runtime/JS pointer. */
static esp_event_handler_instance_t s_lifecycle_event_instance;
typedef struct { uint32_t identity, revision; } wifi_radio_event_fence_t;
static atomic_uint s_channel_callbacks;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
/* Radio mutation mutex serializes SDK/owner changes; snapshot critical section
 * serializes the bounded ledger with the default event-loop callback. */
static struct {
    esp32_mquickjs_wifi_action_lane_t lane;
    esp32_mquickjs_wifi_radio_lease_t lease;
    wifi_second_chan_t secondary;
    uint32_t posted_revision;
    bool fence_posted;
    /* Last admitted recovery identity; authority also requires the current
     * lifecycle. Boot-nonreused identities make the retired record inert. */
    esp32_mquickjs_wifi_radio_lifecycle_t recovery;
} s_action = {.lane = {.next_identity = 1}};
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
/* Shared TWT identity domain, including future Agreement owners. Never reset
 * on runtime or driver restart. Marker storage is boot-owned and never moves. */
static esp32_mquickjs_wifi_twt_identity_t s_twt_identity = {.next_identity = 1};
static struct {
    struct {
        esp32_mquickjs_wifi_twt_token_t token;
        uint32_t native_identity;
        esp_err_t submit_error, cleanup_error;
        const char *cleanup_stage;
        bool dispatching, cleanup_pending;
    } state;
    esp32_mquickjs_wifi_radio_lease_t lease;
    esp32_mquickjs_wifi_twt_probe_retire_t retirement;
    uint32_t operation_identity;
} s_twt_probe;
#endif
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
/* Lazy boot-retained storage: native fence callbacks must never reference a
 * Future or movable JS object. Mutation mutex serializes owner changes. */
typedef struct {
    esp32_mquickjs_wifi_twt_token_t token;
    wifi_itwt_setup_config_t requested;
    esp32_mquickjs_wifi_twt_setup_dispatch_t dispatch;
    esp32_mquickjs_wifi_radio_lease_t lease;
    esp32_mquickjs_wifi_twt_setup_retire_t retirement;
    esp_err_t submit_error, cleanup_error;
    const char *cleanup_stage;
    bool dispatching, closing, result_released, native_retired;
} wifi_radio_twt_individual_t;
static wifi_radio_twt_individual_t *s_twt_individual;
typedef struct {
    esp32_mquickjs_wifi_twt_token_t token;
    wifi_btwt_setup_config_t requested;
    esp32_mquickjs_wifi_btwt_dispatch_t dispatch;
    esp32_mquickjs_wifi_radio_lease_t lease;
    esp32_mquickjs_wifi_btwt_retire_t retirement;
    esp_err_t submit_error, teardown_error, cleanup_error;
    const char *cleanup_stage;
    bool dispatching, closing, working, native_retired, teardown_attempted;
} wifi_radio_twt_broadcast_t;
static wifi_radio_twt_broadcast_t **s_twt_broadcast;
static struct {
    esp32_mquickjs_wifi_radio_lifecycle_t lifecycle;
    bool prepared, stopped;
} s_twt_recovery;
static bool wifi_radio_twt_recovery_exact_locked(const esp32_mquickjs_wifi_radio_lifecycle_t *token);
static bool wifi_radio_twt_managed_lease_locked(uint32_t identity);
static bool wifi_radio_twt_recovery_owners_locked(void);
static bool wifi_radio_twt_recovery_active(const esp32_mquickjs_wifi_radio_lifecycle_t *token);
static esp_err_t wifi_radio_twt_recovery_begin(const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station, const esp32_mquickjs_wifi_radio_lease_t *access_point,
    const esp32_mquickjs_wifi_recovery_request_t *operation,
    esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t *mode);
static esp_err_t wifi_radio_twt_recovery_checkpoint(const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode);
static esp_err_t wifi_radio_twt_recovery_prepare(const esp32_mquickjs_wifi_radio_lifecycle_t *token);
static esp_err_t wifi_radio_twt_recovery_phase(const esp32_mquickjs_wifi_radio_lifecycle_t *token, bool shutdown);
static esp_err_t wifi_radio_twt_recovery_stopped(const esp32_mquickjs_wifi_radio_lifecycle_t *token);
static esp_err_t wifi_radio_twt_recovery_finish(const esp32_mquickjs_wifi_radio_lifecycle_t *token);

static bool wifi_radio_twt_broadcast_lease_retained(const esp32_mquickjs_wifi_radio_lease_t *lease)
{
    if (lease->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_TWT || s_twt_broadcast == NULL) return false;
    for (unsigned i = 1; i < 32; ++i) {
        const wifi_radio_twt_broadcast_t *owner = s_twt_broadcast[i];
        if (owner != NULL && owner->lease.identity == lease->identity &&
            owner->lease.generation == lease->generation && !owner->native_retired) return true;
    }
    return false;
}

static bool wifi_radio_twt_individual_lease_retained(const esp32_mquickjs_wifi_radio_lease_t *lease)
{
    if (lease->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_TWT || s_twt_individual == NULL) return false;
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_TWT_MAX_INDIVIDUAL; ++i) {
        const wifi_radio_twt_individual_t *owner = &s_twt_individual[i];
        if (owner->token.identity != 0U && owner->lease.identity == lease->identity &&
            owner->lease.generation == lease->generation && !owner->native_retired) return true;
    }
    return false;
}
#endif
typedef struct {
    esp32_mquickjs_wifi_action_token_t token;
    uint32_t revision;
} wifi_radio_action_fence_t;
