99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
static struct {
    esp32_mquickjs_wifi_ftm_state_t state;
    esp32_mquickjs_wifi_radio_lease_t lease;
    wifi_ftm_initiator_cfg_t config;
    uint32_t posted_revision;
    bool fence_posted;
    esp32_mquickjs_wifi_radio_lifecycle_t recovery;
    bool recovery_stopped, recovery_timer_started, recovery_timer_ready, recovery_sdk_ready;
} s_ftm;
static bool wifi_radio_ftm_exact_locked(const esp32_mquickjs_wifi_ftm_token_t *token);
static bool wifi_radio_ftm_recovery_exact_locked(const esp32_mquickjs_wifi_radio_lifecycle_t *token);
static uint32_t wifi_radio_ftm_recovery_capture_owner_locked(const esp32_mquickjs_wifi_radio_lifecycle_t *token);
static esp_err_t wifi_radio_ftm_recovery_timer_locked(void);
/* One lazy boot-owned TASK timer; never stores a runtime/session pointer. A
 * single pending marker is consumed before another can be armed. */
static struct {
    esp_timer_handle_t handle;
    esp32_mquickjs_wifi_ftm_token_t token;
    uint32_t revision;
    atomic_bool completed;
    bool pending;
} s_ftm_timer_fence;
typedef struct {
    esp32_mquickjs_wifi_ftm_token_t token;
    uint32_t revision;
} wifi_radio_ftm_fence_t;
static void wifi_radio_ftm_event(int32_t id, const void *data);
#endif
static struct {
    esp32_mquickjs_wifi_radio_lifecycle_t lifecycle;
    esp32_mquickjs_wifi_raw_tx_token_t operation;
    bool stopped, sdk_fenced;
} s_raw_tx_recovery;
static bool wifi_radio_raw_tx_recovery_exact_locked(const esp32_mquickjs_wifi_radio_lifecycle_t *token);
static bool wifi_radio_raw_tx_recovery_owner_locked(const esp32_mquickjs_wifi_radio_lease_t *lease);
static uint32_t wifi_radio_raw_tx_recovery_capture_owner_locked(const esp32_mquickjs_wifi_radio_lifecycle_t *token);
static void wifi_radio_action_event(int32_t id, const void *data);
static bool wifi_radio_action_exact_locked(const esp32_mquickjs_wifi_action_token_t *token);
static bool wifi_radio_action_recovery_exact_locked(const esp32_mquickjs_wifi_radio_lifecycle_t *token);
static uint32_t wifi_radio_action_recovery_capture_owner_locked(const esp32_mquickjs_wifi_radio_lifecycle_t *token);
static esp32_mquickjs_wifi_wake_token_t s_wake_tokens[ESP32_MQUICKJS_WIFI_MAX_WAKE_LOCKS];
static uint32_t s_next_wake_identity = 1U;
/* Mutation-mutex owned; kept out of the interrupt-readable Radio snapshot. */
static esp32_mquickjs_wifi_tx_rate_state_t s_tx_rates = {.next_identity = 1U};
static esp32_mquickjs_wifi_policy_state_t s_policies;
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_RESPONDER_SUPPORT && CONFIG_ESP_WIFI_SOFTAP_SUPPORT
static esp32_mquickjs_wifi_ftm_offset_state_t s_ftm_offset;
#endif
static esp32_mquickjs_wifi_rssi_request_t s_rssi_request;
/* Last observed values, not a getter for a disabled interface. All accesses
 * hold the Radio mutation mutex; physical deinit ends this generation. */
static struct {
    uint32_t generation;
    uint16_t values[2], pending_values[2];
    uint8_t known, failed, pending, attempted, persistent;
    esp_err_t error;
} s_inactive_history;
#include "esp32_mquickjs_wifi_scan_parameters.h"
/* Mutex-owned RAM observation/intent. Hidden Station values are restored at
 * activation, never reported as a live SDK read. Physical deinit resets it. */
static struct {
    wifi_scan_default_params_t value;
    uint32_t generation;
    esp_err_t error;
    bool known, pending, attempted;
} s_scan_parameters;
#if ESP32_MQUICKJS_WIFI_HE_STATISTICS_AVAILABLE
/* Current allocation ownership and a separate STOP replay intent. The latter
 * is never exposed as an actual read. Every SDK command holds the Radio mutex. */
static struct {
    esp32_mquickjs_wifi_he_statistics_t saved;
    uint8_t completed;
    bool managed, pending;
} s_he_statistics;
#endif
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
static struct {
    wifi_twt_config_t value;
    bool known, pending;
} s_twt_policy;
#endif
static esp_err_t wifi_radio_scan_parameters_observe_locked(wifi_scan_default_params_t *actual)
{
    wifi_scan_default_params_t value = {0};
    esp_err_t error = esp_wifi_get_scan_parameters(&value);
    if (error == ESP_OK && !wifi_scan_parameters_observed_valid(&value)) error = ESP_ERR_INVALID_RESPONSE;
    s_scan_parameters.generation = s_radio.generation;
    s_scan_parameters.error = error;
    s_scan_parameters.known = error == ESP_OK;
    if (error == ESP_OK) {
        s_scan_parameters.value = value;
        if (actual != NULL) *actual = value;
    }
    return error;
}
static void wifi_radio_inactive_history_record(unsigned index, uint16_t value, esp_err_t error)
{
    if (s_inactive_history.generation != s_radio.generation) {
        memset(&s_inactive_history, 0, sizeof(s_inactive_history));
        s_inactive_history.generation = s_radio.generation;
    }
    uint8_t bit = (uint8_t)(1U << index);
    if (error == ESP_OK && value < (index == 0 ? 3 : 10)) error = ESP_ERR_INVALID_RESPONSE;
    if (error == ESP_OK) {
        s_inactive_history.values[index] = value;
        s_inactive_history.known |= bit;
        s_inactive_history.failed &= (uint8_t)~bit;
        if (s_inactive_history.failed == 0U) s_inactive_history.error = ESP_OK;
    } else {
        s_inactive_history.values[index] = 0;
        s_inactive_history.known &= (uint8_t)~bit;
        s_inactive_history.failed |= bit;
        s_inactive_history.error = error;
    }
}
/* One boot-owned historical observation, no secrets or dynamic allocation.
 * Held under the mutation mutex, separate from the interrupt-readable state. */
static struct {
    esp32_mquickjs_wifi_radio_lease_t leases[2];
    esp32_mquickjs_wifi_radio_lifecycle_t start_owner;
    wifi_mode_t start_mode;
    wifi_storage_t start_storage;
    esp32_mquickjs_wifi_vendor_ie_slot_t slots[ESP32_MQUICKJS_WIFI_VENDOR_IE_SLOTS];
} s_vendor_ie;
static bool wifi_radio_vendor_ie_start_matches(const esp32_mquickjs_wifi_radio_lifecycle_t *token);
static esp_err_t wifi_radio_vendor_ie_begin_start_locked(
    const esp32_mquickjs_wifi_radio_lease_t *application, const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    const esp32_mquickjs_wifi_radio_configuration_selection_t *selection,
    esp32_mquickjs_wifi_radio_lifecycle_t *token);
static unsigned wifi_radio_vendor_ie_start_count(void);
static esp_err_t wifi_radio_vendor_ie_start_attach(const esp32_mquickjs_wifi_radio_lifecycle_t *token);
static void wifi_radio_vendor_ie_start_park(const esp32_mquickjs_wifi_radio_lifecycle_t *token);
static void wifi_radio_vendor_ie_start_commit(const esp32_mquickjs_wifi_radio_lifecycle_t *token);
static esp32_mquickjs_wifi_radio_stop_snapshot_t s_stop_snapshot;
static void wifi_radio_invalidate_stop_snapshot_locked(void)
{
    s_stop_snapshot.unchanged = false;
}
/* Local SDK call boundary, after SDK declarations. This does not change SDK
 * symbols or calls made by other translation units. */
#include "esp32_mquickjs_wifi_radio_mutation.h"
typedef struct {
    wifi_config_t saved[2], scratch;
    wifi_country_t country;
    wifi_protocols_t protocols[2];
    wifi_bandwidths_t bandwidths[2];
    uint8_t mac[2][6];
    uint16_t inactive_time[2];
    wifi_scan_default_params_t scan_parameters;
    bool scan_parameters_known, restore_off;
#if ESP32_MQUICKJS_WIFI_HE_STATISTICS_AVAILABLE
    esp32_mquickjs_wifi_he_statistics_t he_statistics;
#endif
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    wifi_twt_config_t twt_policy;
#endif
    wifi_ps_type_t power_save;
    uint32_t event_mask;
    wifi_storage_t storage;
    uint8_t mask;
    int8_t tx_power;
    esp32_mquickjs_wifi_interval_snapshot_t interval;
    esp32_mquickjs_wifi_tx_rate_snapshot_t rates;
    wifi_band_mode_t band_mode;
    wifi_band_t band;
    wifi_second_chan_t secondary;
    uint8_t primary, visible_bands, capture_phase, inactive_mask, inactive_saved_mask;
    const char *capture_stage;
    esp_err_t capture_error;
} wifi_radio_restart_configs_t;
