99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
static struct {
    esp32_mquickjs_wifi_radio_lifecycle_t owner;
    wifi_radio_restart_configs_t *snapshot;
    uint32_t source_generation, replay_generation, interval_revision, rate_identity[2];
    wifi_mode_t mode;
    uint8_t phase, start_phase, rate_completed;
#if ESP32_MQUICKJS_WIFI_HE_STATISTICS_AVAILABLE
    uint8_t he_completed;
#endif
    bool captured;
} s_config_restart;
static esp_err_t wifi_radio_validate_protocol(uint16_t value, bool ghz5);
static esp_err_t wifi_radio_read_phy(wifi_interface_t iface, wifi_protocols_t *protocols, wifi_bandwidths_t *bandwidths);
static esp_err_t wifi_radio_write_phy(wifi_interface_t iface, const wifi_protocols_t *protocols, const wifi_bandwidths_t *bandwidths);
static bool wifi_radio_phy_equal(uint8_t bands, const wifi_protocols_t *a, const wifi_bandwidths_t *ab,
    const wifi_protocols_t *b, const wifi_bandwidths_t *bb);
static bool wifi_radio_country_valid(const wifi_country_t *country);
static esp_err_t wifi_radio_band_snapshot(wifi_band_mode_t *mode, wifi_band_t *band);
static bool wifi_radio_country_equal(const wifi_country_t *a, const wifi_country_t *b, bool include_power);
static esp_err_t wifi_radio_restart_configs_capture_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode);
static esp_err_t wifi_radio_restart_configs_replay_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token);
static esp_err_t wifi_radio_restart_configs_pre_start_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode);
static esp_err_t wifi_radio_restart_configs_post_start_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token);
static esp_err_t wifi_radio_restart_configs_verify_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode);
static esp_err_t wifi_radio_restart_configs_commit_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode);
static esp_err_t wifi_radio_restart_configs_commit_storage_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token);
static esp_err_t wifi_radio_restart_configs_start_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode,
    esp32_mquickjs_wifi_radio_lease_t *lease);
static bool wifi_radio_restart_configs_ready_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode);
static void wifi_radio_restart_configs_discard_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token);

/* Frozen non-secret intent belongs to one exact lifecycle reservation. */
static struct {
    esp32_mquickjs_wifi_radio_lifecycle_t owner;
    esp32_mquickjs_wifi_policy_snapshot_t snapshot;
    uint32_t replay_generation;
    wifi_mode_t mode;
    uint8_t completed;
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_RESPONDER_SUPPORT && CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    esp32_mquickjs_wifi_ftm_offset_snapshot_t ftm_offset;
    bool ftm_offset_completed;
#endif
} s_policy_restart;
static esp_err_t wifi_radio_policy_restart_prepare_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode);
static esp_err_t wifi_radio_policy_restart_replay_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, bool after_start);

static const char s_tx_rate_fault[] = "tx-rate-uncertain";
static const char s_tx_rate_restore_fault[] = "tx-rate-restore";
static esp32_mquickjs_wifi_tx_rate_lease_t s_tx_rate_lease;

static esp_err_t wifi_radio_write_tx_rate(void *opaque, wifi_interface_t interface,
    const wifi_tx_rate_config_t *config);
static esp_err_t wifi_radio_restore_tx_rate_locked(const esp32_mquickjs_wifi_radio_lease_t *lease);
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI || CONFIG_ESP32_MQUICKJS_FEATURE_ESPNOW
/* Only the mutation mutex accesses interval knowledge; no IRQ reader. */
static esp32_mquickjs_wifi_interval_state_t s_interval;
static esp_err_t wifi_radio_interval_writer(void *opaque, uint16_t milliseconds)
{
    (void)opaque;
    return esp_wifi_connectionless_module_set_wake_interval(milliseconds);
}
#endif
static esp_err_t wifi_radio_refresh_channel(uint8_t *primary, wifi_second_chan_t *secondary,
                                           uint32_t *generation);
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
static void wifi_radio_smartconfig_observe_fence(const esp32_mquickjs_wifi_radio_operation_t *token)
{
    taskENTER_CRITICAL(&s_radio.lock);
    if (token->identity && token->identity == s_sc_fence_posted &&
        token->identity == s_radio.operation.identity && token->generation == s_radio.operation.generation &&
        token->lease_identity == s_radio.operation.lease_identity &&
        token->kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_SMARTCONFIG && token->kind == s_radio.operation.kind)
        s_sc_fence_seen = token->identity;
    taskEXIT_CRITICAL(&s_radio.lock);
}
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
static void wifi_radio_wps_observe_fence(const esp32_mquickjs_wifi_radio_operation_t *token)
{
    taskENTER_CRITICAL(&s_radio.lock);
    if (token->identity && token->identity == s_wps_fence_posted &&
        token->identity == s_radio.operation.identity && token->generation == s_radio.operation.generation &&
        token->lease_identity == s_radio.operation.lease_identity &&
        token->kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_WPS && token->kind == s_radio.operation.kind)
        s_wps_fence_seen = token->identity;
    taskEXIT_CRITICAL(&s_radio.lock);
}
#endif
static void wifi_radio_lifecycle_fence(void *arg, esp_event_base_t base, int32_t id, void *data)
{
    (void)arg;
    if (base != ESP32QJS_WIFI_RADIO_CONTROL_EVENT || data == NULL) return;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
#if CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
    if (id == WIFI_RADIO_WPS_FENCE_EVENT) {
        wifi_radio_wps_observe_fence(data);
        return;
    }
    if (id == WIFI_RADIO_SMARTCONFIG_FENCE_EVENT) {
        wifi_radio_smartconfig_observe_fence(data);
        return;
    }
#endif
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    if (id == ESP32_MQUICKJS_WIFI_BTWT_FENCE_EVENT) {
        esp32_mquickjs_wifi_btwt_setup_observe_fence(data);
        return;
    }
    if (id == ESP32_MQUICKJS_WIFI_TWT_SETUP_FENCE_EVENT) {
        esp32_mquickjs_wifi_twt_setup_result_observe_fence(data);
        return;
    }
    if (id == ESP32_MQUICKJS_WIFI_TWT_PROBE_FENCE_EVENT) {
        esp32_mquickjs_wifi_twt_probe_result_observe_fence(data);
        return;
    }
#endif
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    if (id == 3) {
        const wifi_radio_ftm_fence_t *fence = data;
        taskENTER_CRITICAL(&s_radio.lock);
        esp32_mquickjs_wifi_ftm_state_t *state = &s_ftm.state;
        if (s_ftm.fence_posted && s_ftm.posted_revision == fence->revision &&
            state->token.identity != 0U && state->token.identity == fence->token.identity &&
            state->token.generation == fence->token.generation && state->revision == fence->revision &&
            state->sdk_fenced && state->report_consumed && !state->ambiguous) {
            state->event_fenced = true;
            s_ftm.fence_posted = false;
        }
        taskEXIT_CRITICAL(&s_radio.lock);
        return;
    }
#endif
    if (id == 2) {
        const wifi_radio_action_fence_t *action = data;
        taskENTER_CRITICAL(&s_radio.lock);
        if (s_action.fence_posted && s_action.posted_revision == action->revision &&
            esp32_mquickjs_wifi_action_event_fenced(&s_action.lane, &action->token, action->revision))
            s_action.fence_posted = false;
        taskEXIT_CRITICAL(&s_radio.lock);
        return;
    }
#endif
    if (id != 1) return;
    const wifi_radio_event_fence_t *fence = data;
    taskENTER_CRITICAL(&s_radio.lock);
    if (s_radio.event_phase != RADIO_EVENTS_IDLE && s_radio.event_fence_posted &&
        fence->identity == s_radio.event_identity && fence->revision == s_radio.event_revision)
        s_radio.event_fence_seen = true;
    taskEXIT_CRITICAL(&s_radio.lock);
}

static void wifi_radio_observe_lifecycle_event(int32_t id)
{
    uint8_t mode = 0;
    bool start = false;
    if (id == WIFI_EVENT_STA_START) { mode = WIFI_MODE_STA; start = true; }
    else if (id == WIFI_EVENT_STA_STOP) mode = WIFI_MODE_STA;
    else if (id == WIFI_EVENT_AP_START) { mode = WIFI_MODE_AP; start = true; }
    else if (id == WIFI_EVENT_AP_STOP) mode = WIFI_MODE_AP;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && (CONFIG_ESP_WIFI_NAN_SYNC_ENABLE || CONFIG_ESP_WIFI_NAN_USD_ENABLE)
    else if (id == WIFI_EVENT_NAN_SYNC_STARTED) { mode = WIFI_MODE_NAN; start = true; }
    else if (id == WIFI_EVENT_NAN_SYNC_STOPPED) mode = WIFI_MODE_NAN;
#endif
    if (mode == 0) return;
    taskENTER_CRITICAL(&s_radio.lock);
    if (start) s_radio.event_live |= mode;
    else s_radio.event_live &= (uint8_t)~mode;
    if (s_radio.event_phase != RADIO_EVENTS_IDLE) {
        if (s_radio.event_revision != UINT32_MAX) s_radio.event_revision++;
        /* A new native event invalidates an earlier queued marker. Matching
         * revision is required, so that marker cannot acknowledge its suffix. */
        s_radio.event_fence_posted = false;
        s_radio.event_fence_seen = false;
        if (s_radio.event_phase == RADIO_EVENTS_RESTART) {
            /* High bits remember STOP; START counts only after that STOP. A
             * second STOP invalidates the earlier START for this interface. */
            if (!start) {
                s_radio.event_seen |= (uint8_t)(mode << 4);
                s_radio.event_seen &= (uint8_t)~mode;
            } else if (s_radio.event_seen & (mode << 4)) s_radio.event_seen |= mode;
        } else if ((start && (s_radio.event_phase == RADIO_EVENTS_START || s_radio.event_phase == RADIO_EVENTS_AP_START ||
            s_radio.event_phase == RADIO_EVENTS_STA_START)) ||
            (!start && (s_radio.event_phase == RADIO_EVENTS_STOP || s_radio.event_phase == RADIO_EVENTS_AP_STOP))) s_radio.event_seen |= mode;
    }
    taskEXIT_CRITICAL(&s_radio.lock);
}

