99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
/* Mutation mutex held, no SDK call in the snapshot critical section. */
static esp_err_t wifi_radio_begin_events(unsigned phase, wifi_mode_t expected)
{
    taskENTER_CRITICAL(&s_radio.lock);
    if (s_radio.event_identity == UINT32_MAX) {
        s_radio.restart_required = true;
        taskEXIT_CRITICAL(&s_radio.lock);
        return ESP_ERR_NO_MEM;
    }
    s_radio.event_identity++;
    s_radio.event_phase = phase;
    s_radio.event_expected = expected;
    s_radio.event_seen = 0;
    s_radio.event_revision = 0;
    s_radio.event_fence_posted = false;
    s_radio.event_fence_seen = false;
    taskEXIT_CRITICAL(&s_radio.lock);
    return ESP_OK;
}

static esp_err_t wifi_radio_wait_events_inner(esp32_mquickjs_runtime_t *runtime)
{
    TickType_t started = xTaskGetTickCount();
    TickType_t timeout = esp32_mquickjs_wifi_wait_remaining(pdMS_TO_TICKS((s_radio.event_phase == RADIO_EVENTS_STOP || s_radio.event_phase == RADIO_EVENTS_AP_STOP)
        ? WIFI_RADIO_STOP_EVENT_TIMEOUT_MS : WIFI_RADIO_START_EVENT_TIMEOUT_MS));
    for (;;) {
        if (!esp32_mquickjs_cooperate(runtime)) return ESP_ERR_INVALID_STATE;
        wifi_radio_event_fence_t fence = {0};
        bool post = false;
        taskENTER_CRITICAL(&s_radio.lock);
        if (s_radio.event_phase == RADIO_EVENTS_IDLE || s_radio.event_revision == UINT32_MAX) {
            taskEXIT_CRITICAL(&s_radio.lock);
            return ESP_ERR_INVALID_STATE;
        }
        bool ready = (s_radio.event_seen & s_radio.event_expected) == s_radio.event_expected;
        if (s_radio.event_phase == RADIO_EVENTS_RESTART)
            ready = ready && ((s_radio.event_seen >> 4) & s_radio.event_expected) == s_radio.event_expected &&
                s_radio.event_live == s_radio.event_expected;
        else if (s_radio.event_phase == RADIO_EVENTS_START)
            ready = ready && (s_radio.event_live & s_radio.event_expected) == s_radio.event_expected;
        else if (s_radio.event_phase == RADIO_EVENTS_AP_START || s_radio.event_phase == RADIO_EVENTS_STA_START)
            ready = ready && s_radio.event_live == WIFI_MODE_APSTA;
        else if (s_radio.event_phase == RADIO_EVENTS_AP_STOP)
            ready = ready && s_radio.event_live == WIFI_MODE_STA;
        else ready = ready && s_radio.event_live == 0;
        if (ready && s_radio.event_fence_seen) {
            s_radio.event_phase = RADIO_EVENTS_IDLE;
            taskEXIT_CRITICAL(&s_radio.lock);
            return ESP_OK;
        }
        if (ready && !s_radio.event_fence_posted) {
            fence = (wifi_radio_event_fence_t){s_radio.event_identity, s_radio.event_revision};
            s_radio.event_fence_posted = true;
            post = true;
        }
        taskEXIT_CRITICAL(&s_radio.lock);
        if (post) {
            esp_err_t err = esp_event_post(ESP32QJS_WIFI_RADIO_CONTROL_EVENT, 1,
                &fence, sizeof(fence), 0);
            if (err != ESP_OK) {
                taskENTER_CRITICAL(&s_radio.lock);
                if (fence.identity == s_radio.event_identity && fence.revision == s_radio.event_revision)
                    s_radio.event_fence_posted = false;
                taskEXIT_CRITICAL(&s_radio.lock);
                return err;
            }
        }
        if ((TickType_t)(xTaskGetTickCount() - started) >= timeout)
            return ESP_ERR_TIMEOUT;
        vTaskDelay(1);
    }
}

static esp_err_t wifi_radio_wait_events(void)
{
#if ESP32_MQUICKJS_WIFI_MESH_AVAILABLE
    if (wifi_radio_mesh_worker_locked()) return wifi_radio_wait_events_inner(NULL);
#endif
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    esp32_mquickjs_native_wait_t wait;
    esp32_mquickjs_native_wait_begin(runtime, &wait);
    esp_err_t err = wifi_radio_wait_events_inner(runtime);
    esp32_mquickjs_native_wait_end(runtime, &wait);
    return err;
}

static void wifi_radio_channel_event(void *arg, esp_event_base_t base, int32_t id, void *data)
{
    (void)arg; (void)data;
    if (base != WIFI_EVENT) return;
    atomic_fetch_add_explicit(&s_channel_callbacks, 1, memory_order_acq_rel);
    wifi_radio_observe_lifecycle_event(id);
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    wifi_radio_action_event(id, data);
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    wifi_radio_ftm_event(id, data);
#endif
#endif
    if (id != WIFI_EVENT_HOME_CHANNEL_CHANGE && id != WIFI_EVENT_STA_CONNECTED &&
        id != WIFI_EVENT_AP_START) goto done;
    taskENTER_CRITICAL(&s_radio.lock);
    bool owned = s_radio.driver_owned;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (!owned) goto done;
    uint8_t primary;
    wifi_second_chan_t secondary;
    uint32_t generation;
    /* Read current SDK state rather than replaying a delayed event payload.
     * Never wait for the Radio mutation mutex from the event-loop task. */
    (void)wifi_radio_refresh_channel(&primary, &secondary, &generation);
done:
    atomic_fetch_sub_explicit(&s_channel_callbacks, 1, memory_order_release);
}

/* Boot-lived task mutex covers validation, driver effects and release.
 * SDK calls never run under the short snapshot critical section. */
static StaticSemaphore_t s_operation_mutex_storage;
static SemaphoreHandle_t s_operation_mutex;
static _Atomic int s_operation_mutex_state;

static void wifi_radio_operation_lock(void)
{
    int expected = 0;
    if (atomic_compare_exchange_strong(&s_operation_mutex_state, &expected, 1)) {
        s_operation_mutex = xSemaphoreCreateMutexStatic(&s_operation_mutex_storage);
        atomic_store_explicit(&s_operation_mutex_state, 2, memory_order_release);
    } else {
        while (atomic_load_explicit(&s_operation_mutex_state,
                                    memory_order_acquire) != 2) vTaskDelay(1);
    }
    (void)xSemaphoreTake(s_operation_mutex, portMAX_DELAY);
}

static void wifi_radio_operation_unlock(void)
{
    (void)xSemaphoreGive(s_operation_mutex);
}

const char *esp32_mquickjs_wifi_radio_driver_state_name(
    esp32_mquickjs_wifi_radio_driver_state_t state)
{
    switch (state) {
    case ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED: return "uninitialized";
    case ESP32_MQUICKJS_WIFI_RADIO_INITIALIZING: return "initializing";
    case ESP32_MQUICKJS_WIFI_RADIO_STOPPED: return "stopped";
    case ESP32_MQUICKJS_WIFI_RADIO_STARTING: return "starting";
    case ESP32_MQUICKJS_WIFI_RADIO_STARTED: return "started";
    case ESP32_MQUICKJS_WIFI_RADIO_STOPPING: return "stopping";
    case ESP32_MQUICKJS_WIFI_RADIO_CLEANUP_PENDING: return "cleanup-pending";
    case ESP32_MQUICKJS_WIFI_RADIO_FAULTED:
    default: return "faulted";
    }
}

static void wifi_radio_set_state(esp32_mquickjs_wifi_radio_driver_state_t state)
{
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.driver_state = state;
    taskEXIT_CRITICAL(&s_radio.lock);
}

static esp_err_t wifi_radio_record_fault(const char *stage, esp_err_t err)
{
    if (err != ESP_OK) {
        taskENTER_CRITICAL(&s_radio.lock);
        if (s_radio.fault_stage == NULL) {
            s_radio.fault_stage = stage;
            s_radio.fault_error = err;
        }
        s_radio.driver_state = ESP32_MQUICKJS_WIFI_RADIO_FAULTED;
        taskEXIT_CRITICAL(&s_radio.lock);
    }
    return err;
}

static esp_err_t wifi_radio_cleanup_fault(const char *stage, esp_err_t err)
{
    if (err == ESP_OK) return ESP_OK;
    wifi_radio_record_fault(stage, err);
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.cleanup_stage = stage;
    s_radio.cleanup_error = err;
    s_radio.driver_state = ESP32_MQUICKJS_WIFI_RADIO_CLEANUP_PENDING;
    taskEXIT_CRITICAL(&s_radio.lock);
    return err;
}

/* Called with the mutation mutex. Successful deinit is the only reset of
 * driver ownership; a failed public init cannot prove SDK cleanup completed. */
static esp_err_t wifi_radio_initialize(void)
{
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    esp_err_t antenna_error = esp32_mquickjs_wifi_antenna_fault();
    if (antenna_error != ESP_OK) {
        taskENTER_CRITICAL(&s_radio.lock);
        s_radio.restart_required = true;
        taskEXIT_CRITICAL(&s_radio.lock);
        return wifi_radio_record_fault("antenna-device-restart-required", antenna_error);
    }
#endif
    if (s_radio.storage_configured) return ESP_OK;
    wifi_radio_set_state(ESP32_MQUICKJS_WIFI_RADIO_INITIALIZING);
    wifi_init_config_t config = WIFI_INIT_CONFIG_DEFAULT();
    if (s_channel_event_instance == NULL) {
        esp_err_t loop_err = esp_event_loop_create_default();
        if (loop_err != ESP_OK && loop_err != ESP_ERR_INVALID_STATE)
            return wifi_radio_record_fault("event-loop", loop_err);
        loop_err = esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID,
            wifi_radio_channel_event, NULL, &s_channel_event_instance);
        if (loop_err != ESP_OK) return wifi_radio_record_fault("channel-handler", loop_err);
    }
    if (s_lifecycle_event_instance == NULL) {
        esp_err_t event_err = esp_event_handler_instance_register(
            ESP32QJS_WIFI_RADIO_CONTROL_EVENT, ESP_EVENT_ANY_ID, wifi_radio_lifecycle_fence,
            NULL, &s_lifecycle_event_instance);
        if (event_err != ESP_OK) return wifi_radio_record_fault("lifecycle-handler", event_err);
    }
    esp_err_t err = wifi_radio_record_fault(
        "nvs", esp32_mquickjs_nvs_flash_ensure_initialized());
    if (err == ESP_OK) {
        err = wifi_radio_record_fault("init", esp_wifi_init(&config));
        if (err == ESP_OK) {
            taskENTER_CRITICAL(&s_radio.lock);
            s_radio.driver_owned = true;
            taskEXIT_CRITICAL(&s_radio.lock);
        }
    }
    if (err != ESP_OK) {
        taskENTER_CRITICAL(&s_radio.lock);
        s_radio.restart_required = true;
        taskEXIT_CRITICAL(&s_radio.lock);
        return err;
    }
    err = wifi_radio_record_fault("storage", esp_wifi_set_storage(WIFI_STORAGE_RAM));
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI || CONFIG_ESP32_MQUICKJS_FEATURE_ESPNOW
    if (err == ESP_OK) {
        esp32_mquickjs_wifi_interval_result_t result;
        /* Establish framework policy with an actual accepted write. The default
         * constant alone is not knowledge of the driver's previous state. */
        err = wifi_radio_record_fault("interval-baseline", esp32_mquickjs_wifi_interval_write(
            &s_interval, s_radio.generation, ESP_WIFI_CONNECTIONLESS_INTERVAL_DEFAULT_MODE,
            wifi_radio_interval_writer, NULL, &result));
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    if (err == ESP_OK) err = wifi_radio_record_fault("vendor-ie-register",
        esp32_mquickjs_wifi_vendor_ie_broker_register(s_radio.generation));
#endif
    if (err == ESP_OK) {
        taskENTER_CRITICAL(&s_radio.lock);
        s_radio.storage_configured = true;
        s_radio.storage = WIFI_STORAGE_RAM;
        s_radio.driver_state = ESP32_MQUICKJS_WIFI_RADIO_STOPPED;
        taskEXIT_CRITICAL(&s_radio.lock);
    }
    return err;
}

static wifi_mode_t wifi_radio_requested_mode(void)
{
    wifi_mode_t mode = WIFI_MODE_NULL;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        if (s_radio.leases[i].identity != 0U)
            mode = (wifi_mode_t)(mode | s_radio.leases[i].required_mode);
    }
    return mode;
}

static bool wifi_radio_lease_valid(
    const esp32_mquickjs_wifi_radio_lease_t *lease)
{
    bool valid = false;

    if (lease == NULL || !lease->acquired || lease->identity == 0U ||
        (unsigned)lease->client >= ESP32_MQUICKJS_WIFI_RADIO_CLIENT_COUNT) {
        return false;
    }
    taskENTER_CRITICAL(&s_radio.lock);
    if (lease->generation == s_radio.generation) {
        for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
            if (s_radio.leases[i].identity == lease->identity &&
                s_radio.leases[i].client == lease->client) {
                valid = true;
                break;
            }
        }
    }
    taskEXIT_CRITICAL(&s_radio.lock);
    return valid;
}

#if CONFIG_SOC_WIFI_SUPPORT_5G || CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
uint32_t esp32_mquickjs_wifi_radio_5ghz_channel_bit(uint8_t channel)
{
    static const uint8_t channels[] = {
        36U, 40U, 44U, 48U, 52U, 56U, 60U, 64U,
        100U, 104U, 108U, 112U, 116U, 120U, 124U, 128U,
        132U, 136U, 140U, 144U, 149U, 153U, 157U, 161U,
        165U, 169U, 173U, 177U,
    };
    uint32_t index;

    for (index = 0U; index < sizeof(channels); ++index) {
        if (channels[index] == channel) return 1UL << (index + 1U);
    }
    return 0U;
}
#endif

static esp_err_t wifi_radio_validate_regulatory_channel(uint8_t channel)
{
    wifi_country_t country = {0};
    esp_err_t err = esp_wifi_get_country(&country);

    if (err != ESP_OK) return err;
    if (channel <= 14U) {
        uint16_t end = (uint16_t)country.schan + country.nchan;

        return country.nchan > 0U && channel >= country.schan && channel < end
            ? ESP_OK : ESP_ERR_NOT_ALLOWED;
    }
#if CONFIG_SOC_WIFI_SUPPORT_5G
    {
        uint32_t bit = esp32_mquickjs_wifi_radio_5ghz_channel_bit(channel);

        if (bit == 0U) return ESP_ERR_INVALID_ARG;
        if (country.policy == WIFI_COUNTRY_POLICY_MANUAL &&
            country.wifi_5g_channel_mask != 0U &&
            (country.wifi_5g_channel_mask & bit) == 0U) {
            return ESP_ERR_NOT_ALLOWED;
        }
        return ESP_OK;
    }
#else
    return ESP_ERR_INVALID_ARG;
#endif
}

