99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI || CONFIG_ESP32_MQUICKJS_FEATURE_ESPNOW
static bool wifi_radio_interval_owner(const esp32_mquickjs_wifi_radio_lease_t *lease)
{
    return lease != NULL && lease->client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_ESPNOW &&
        wifi_radio_lease_valid(lease) && s_radio.driver_owned && s_radio.storage_configured &&
        s_radio.lifecycle.identity == 0U && s_radio.operation.identity == 0U;
}

esp_err_t esp32_mquickjs_wifi_radio_interval_configure(
    const esp32_mquickjs_wifi_radio_lease_t *lease, uint16_t milliseconds,
    esp32_mquickjs_wifi_interval_token_t *token)
{
    if (token == NULL) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_interval_owner(lease) || !s_radio.started ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED || s_radio.fault_stage != NULL ||
        s_radio.cleanup_stage != NULL || s_radio.restart_required || s_radio.wake_locks != 0U ||
        s_radio.promiscuous_claimed) goto done;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    if (s_tx_rate_lease.identity != 0U) goto done;
#endif
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        const wifi_radio_live_lease_t *owner = &s_radio.leases[i];
        if (owner->identity == 0U || owner->identity == lease->identity) continue;
        if (owner->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION &&
            owner->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA &&
            owner->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP) goto done;
        if (owner->fixed_channel || owner->channel_conflict) goto done;
    }
    esp32_mquickjs_wifi_interval_result_t result;
    if (token->identity == 0U)
        err = esp32_mquickjs_wifi_interval_acquire(&s_interval, lease->generation, lease->identity,
            milliseconds, wifi_radio_interval_writer, NULL, token, &result);
    else if (token->generation == lease->generation && token->owner_identity == lease->identity)
        err = esp32_mquickjs_wifi_interval_update(&s_interval, token, milliseconds,
            wifi_radio_interval_writer, NULL, &result);
done:
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_interval_release(
    const esp32_mquickjs_wifi_radio_lease_t *lease, esp32_mquickjs_wifi_interval_token_t *token)
{
    if (token == NULL) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (token->identity == 0U && token->owner_identity == 0U && token->generation == 0U) {
        err = ESP_OK;
        goto done;
    }
    if (!wifi_radio_interval_owner(lease) || token->generation != lease->generation ||
        token->owner_identity != lease->identity) goto done;
    esp32_mquickjs_wifi_interval_result_t result;
    /* Restore the captured value under the same Radio exclusion. SDK failure
     * retains the token; unrelated Radio faults are not cleared by this step. */
    err = esp32_mquickjs_wifi_interval_release(&s_interval, token, wifi_radio_interval_writer, NULL, &result);
done:
    wifi_radio_operation_unlock();
    return err;
}

void esp32_mquickjs_wifi_radio_interval_status(esp32_mquickjs_wifi_interval_state_t *status)
{
    if (status == NULL) return;
    wifi_radio_operation_lock();
    *status = s_interval;
    wifi_radio_operation_unlock();
}
#endif

static esp_err_t wifi_radio_acquire_locked(
    esp32_mquickjs_wifi_radio_client_t client,
    wifi_mode_t required_mode,
    esp32_mquickjs_wifi_radio_lease_t *out_lease)
{
    if (out_lease == NULL ||
        (unsigned)client >= ESP32_MQUICKJS_WIFI_RADIO_CLIENT_COUNT ||
        (required_mode != WIFI_MODE_STA && required_mode != WIFI_MODE_AP &&
         required_mode != WIFI_MODE_APSTA)) {
        return ESP_ERR_INVALID_ARG;
    }
    memset(out_lease, 0, sizeof(*out_lease));
    if (WIFI_RADIO_NAN_PENDING || WIFI_RADIO_MESH_PENDING) return ESP_ERR_INVALID_STATE;
#if ESP32_MQUICKJS_WIFI_MESH_AVAILABLE
    if (client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_MESH) return ESP_ERR_INVALID_ARG;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && (CONFIG_ESP_WIFI_NAN_SYNC_ENABLE || CONFIG_ESP_WIFI_NAN_USD_ENABLE)
    /* NAN has a separate exclusive admission; a generic caller cannot create
     * a NAN owner with STA/AP requirements. */
    if (client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_NAN) return ESP_ERR_INVALID_ARG;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
    if (WIFI_RADIO_SMARTCONFIG_PENDING || WIFI_RADIO_WPS_PENDING) return ESP_ERR_INVALID_STATE;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_DPP_SUPPORT
    if (WIFI_RADIO_DPP_PENDING) return ESP_ERR_INVALID_STATE;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    if (WIFI_RADIO_EAP_PENDING) return ESP_ERR_INVALID_STATE;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI || CONFIG_ESP32_MQUICKJS_FEATURE_ESPNOW
    if (s_interval.owner.identity != 0U || s_interval.uncertain) return ESP_ERR_INVALID_STATE;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    if (s_tx_rate_lease.identity != 0U) return ESP_ERR_INVALID_STATE;
#endif
    /* Raw TX and Vendor IE may join an already enabled interface without AP
     * reconfiguration. Other AP-sharing paths use their lifecycle handoff. */
    if (s_radio.clients[ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP] != 0U
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
        &&
        !(((client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_RAW_TX && s_radio.started) ||
            client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_VENDOR_IE ||
            (client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_ACTION && s_radio.started)
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
            || (client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_TWT && s_radio.started)
#endif
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
            || (client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_FTM && s_radio.started)
#endif
            ) &&
          (s_radio.effective_mode & required_mode) == required_mode)
#endif
        ) return ESP_ERR_INVALID_STATE;
    if (s_radio.fault_stage != NULL) return s_radio.fault_error;
    taskENTER_CRITICAL(&s_radio.lock);
    size_t slot;
    for (slot = 0; slot < WIFI_RADIO_MAX_LEASES; ++slot) {
        if (s_radio.leases[slot].identity == 0U) break;
    }
    if (slot == WIFI_RADIO_MAX_LEASES || s_radio.next_lease_identity == 0U) {
        taskEXIT_CRITICAL(&s_radio.lock);
        return ESP_ERR_NO_MEM;
    }
    s_radio.clients[client]++;
    out_lease->generation = s_radio.generation;
    out_lease->identity = s_radio.next_lease_identity++;
    s_radio.leases[slot] = (wifi_radio_live_lease_t){
        .identity = out_lease->identity,
        .client = client,
        .required_mode = required_mode,
    };
    out_lease->client = client;
    out_lease->acquired = true;
    taskEXIT_CRITICAL(&s_radio.lock);
    return ESP_OK;
}

/* Caller owns Radio mutation and has admitted either a valid lease or the
 * exclusive restart preparation. Both use the same native event/fence path. */
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
/* A disabled interface has no legal inactive-time setter. A committed restart
 * transfers its desired value here; apply it at the next real activation before
 * owner publication. Observations cannot overwrite this separate intent. */
#if ESP32_MQUICKJS_WIFI_HE_STATISTICS_AVAILABLE
static esp_err_t wifi_radio_retire_he_statistics_locked(void)
{
    if (!s_he_statistics.managed) return ESP_OK;
    esp32_mquickjs_wifi_he_statistics_t actual;
    esp_err_t error = esp32_mquickjs_wifi_he_statistics_snapshot(&actual, true);
    if (error != ESP_OK) return wifi_radio_cleanup_fault("he-statistics-retire", error);
    /* A previous failed restore owns the original complete intent, not this
     * partially restored prefix. STOP retry must not replace that intent. */
    if (!s_he_statistics.pending) s_he_statistics.saved = actual;
    s_he_statistics.pending = true;
    s_he_statistics.managed = false;
    s_he_statistics.completed = 0;
    return ESP_OK;
}

