99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
static esp_err_t wifi_radio_restore_he_statistics_locked(void)
{
    if (!s_he_statistics.pending) return ESP_OK;
    if (!s_radio.started || s_radio.fault_stage || s_radio.cleanup_stage || s_radio.restart_required)
        return ESP_ERR_INVALID_STATE;
    s_he_statistics.managed = true; /* Retain cleanup even on partial failure. */
    esp_err_t error = esp32_mquickjs_wifi_he_statistics_restore(&s_he_statistics.saved, &s_he_statistics.completed);
    if (error != ESP_OK) return wifi_radio_record_fault("he-statistics-restore", error);
    s_he_statistics.pending = false;
    return ESP_OK;
}
#endif

static esp_err_t wifi_radio_restore_scan_parameters_locked(wifi_mode_t mode)
{
    if (!s_scan_parameters.pending || !(mode & WIFI_MODE_STA) || s_scan_parameters.generation != s_radio.generation ||
        (!s_scan_parameters.known && s_scan_parameters.error == ESP_OK)) return ESP_OK;
    if (s_radio.fault_stage || s_radio.cleanup_stage || s_radio.restart_required) return ESP_ERR_INVALID_STATE;
    esp32_mquickjs_wifi_radio_config_result_t result = {.stage = "scan-parameters-restore-readback"};
    wifi_scan_default_params_t wanted = s_scan_parameters.value, actual = {0};
    esp_err_t error = s_scan_parameters.error;
    if (error != ESP_OK) { result.stage = "scan-parameters-restore-source"; goto failed; }
    error = esp_wifi_get_scan_parameters(&actual);
    if (error == ESP_OK && !wifi_scan_parameters_equal(&wanted, &actual) && !s_scan_parameters.attempted) {
        result.stage = "scan-parameters-restore-write";
        result.mutation_attempted = s_scan_parameters.attempted = true;
        error = wifi_scan_parameters_set_native(&wanted);
        if (error == ESP_OK) {
            result.stage = "scan-parameters-restore-readback";
            error = esp_wifi_get_scan_parameters(&actual);
        }
    }
    if (error == ESP_OK && !wifi_scan_parameters_equal(&wanted, &actual)) error = ESP_ERR_INVALID_RESPONSE;
    if (error == ESP_OK) { s_scan_parameters.pending = s_scan_parameters.attempted = false; return ESP_OK; }
failed:
    result.mutation_attempted |= s_scan_parameters.attempted;
    result.error = error;
    taskENTER_CRITICAL(&s_radio.lock); s_radio.configuration = result; taskEXIT_CRITICAL(&s_radio.lock);
    return wifi_radio_record_fault(result.stage, error);
}

static esp_err_t wifi_radio_restore_inactive_locked(wifi_mode_t mode)
{
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    if (s_twt_policy.pending) {
        if (!s_radio.started || s_radio.fault_stage || s_radio.cleanup_stage || s_radio.restart_required)
            return ESP_ERR_INVALID_STATE;
        esp32_mquickjs_wifi_twt_control_t value = {.config = s_twt_policy.value};
        esp_err_t error = esp32_mquickjs_wifi_twt_sdk_control(ESP32_MQUICKJS_WIFI_TWT_WRITE_CONFIG, &value);
        if (error != ESP_OK) return wifi_radio_record_fault("twt-policy-restore", error);
        s_twt_policy.pending = false;
    }
#endif
#if ESP32_MQUICKJS_WIFI_HE_STATISTICS_AVAILABLE
    esp_err_t he_error = wifi_radio_restore_he_statistics_locked();
    if (he_error != ESP_OK) return he_error;
#endif
    esp_err_t scan_error = wifi_radio_restore_scan_parameters_locked(mode);
    if (scan_error != ESP_OK) return scan_error;
    if (s_inactive_history.pending == 0U) return ESP_OK;
    /* Preserve the original operation's diagnostics while faulted. */
    if (s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required)
        return ESP_ERR_INVALID_STATE;
    esp32_mquickjs_wifi_radio_config_result_t result = {.stage = "inactive-restore-admission"};
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (s_inactive_history.generation != s_radio.generation || !s_radio.driver_owned ||
        !s_radio.storage_configured || !s_radio.started || s_radio.fault_stage != NULL ||
        (s_radio.storage != WIFI_STORAGE_RAM && s_radio.storage != WIFI_STORAGE_FLASH) ||
        s_radio.cleanup_stage != NULL || s_radio.restart_required) goto done;
    uint8_t mask = s_inactive_history.pending & (uint8_t)mode;
    if (mask == 0U) return ESP_OK;
    result.mutation_attempted = (s_inactive_history.attempted & mask) != 0U;
    result.persistent_mutation_possible = (s_inactive_history.persistent & mask) != 0U;
    wifi_mode_t actual_mode;
    result.stage = "inactive-restore-mode";
    err = esp_wifi_get_mode(&actual_mode);
    if (err == ESP_OK && actual_mode != mode) err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) goto done;
    for (unsigned i = 0; i < 2; ++i) {
        uint8_t bit = (uint8_t)(1U << i);
        if (!(mask & bit)) continue;
        wifi_interface_t interface = i == 0 ? WIFI_IF_STA : WIFI_IF_AP;
        uint16_t wanted = s_inactive_history.pending_values[i], actual = 0;
        if (wanted < (i == 0 ? 3 : 10)) { err = ESP_ERR_INVALID_STATE; goto done; }
        bool attempted = (s_inactive_history.attempted & bit) != 0U;
        result.mutation_attempted |= attempted;
        result.persistent_mutation_possible |= (s_inactive_history.persistent & bit) != 0U;
        result.stage = i == 0 ? "station-inactive-restore-readback" : "ap-inactive-restore-readback";
        err = esp_wifi_get_inactive_time(interface, &actual);
        if (err == ESP_OK && actual != wanted && !attempted) {
            result.stage = i == 0 ? "station-inactive-restore-write" : "ap-inactive-restore-write";
            s_inactive_history.attempted |= bit;
            if (s_radio.storage == WIFI_STORAGE_FLASH) s_inactive_history.persistent |= bit;
            result.mutation_attempted = true;
            result.persistent_mutation_possible |= s_radio.storage == WIFI_STORAGE_FLASH;
            err = esp_wifi_set_inactive_time(interface, wanted);
            if (err == ESP_OK) {
                result.stage = i == 0 ? "station-inactive-restore-readback" : "ap-inactive-restore-readback";
                err = esp_wifi_get_inactive_time(interface, &actual);
            }
        }
        if (err == ESP_OK && actual != wanted) err = ESP_ERR_INVALID_RESPONSE;
        wifi_radio_inactive_history_record(i, actual, err);
        if (err != ESP_OK) goto done;
        s_inactive_history.pending &= (uint8_t)~bit;
        s_inactive_history.attempted &= (uint8_t)~bit;
        s_inactive_history.persistent &= (uint8_t)~bit;
        s_inactive_history.pending_values[i] = 0;
    }
    result.stage = "inactive-restore-complete";
done:
    result.error = err;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.configuration = result;
    taskEXIT_CRITICAL(&s_radio.lock);
    return wifi_radio_record_fault(result.stage, err);
}
#endif

