99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
static esp_err_t wifi_radio_start_stopped_locked(wifi_mode_t mode, bool restore_settings)
{
    esp_err_t err;
    err = wifi_radio_begin_events(RADIO_EVENTS_START, mode);
    if (err != ESP_OK) return wifi_radio_record_fault("start-events", err);
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.stop_required = true;
    s_radio.driver_state = ESP32_MQUICKJS_WIFI_RADIO_STARTING;
    taskEXIT_CRITICAL(&s_radio.lock);
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    s_twt_policy.pending = s_twt_policy.known;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    if ((mode & WIFI_MODE_STA) && s_scan_parameters.generation == s_radio.generation &&
        (s_scan_parameters.known || s_scan_parameters.error != ESP_OK)) s_scan_parameters.pending = true;
#endif
    err = wifi_radio_record_fault("start", esp_wifi_start());
    if (err == ESP_OK) {
        taskENTER_CRITICAL(&s_radio.lock);
        s_radio.started = true;
        taskEXIT_CRITICAL(&s_radio.lock);
        err = wifi_radio_record_fault("start-events", wifi_radio_wait_events());
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
        if (err == ESP_OK && restore_settings) err = wifi_radio_restore_inactive_locked(mode);
#else
        (void)restore_settings;
#endif
        if (err == ESP_OK) wifi_radio_set_state(ESP32_MQUICKJS_WIFI_RADIO_STARTED);
    }
    return err;
}

static esp_err_t wifi_radio_ensure_started_locked(
    esp32_mquickjs_wifi_radio_lease_t *lease)
{
    wifi_mode_t current_mode;
    esp_err_t err;
    if (!wifi_radio_lease_valid(lease)) return ESP_ERR_INVALID_STATE;
    if (s_radio.fault_stage != NULL) return s_radio.fault_error;
    ESP_RETURN_ON_ERROR(wifi_radio_initialize(), TAG, "Wi-Fi radio initialization failed");
    wifi_mode_t required_mode = wifi_radio_requested_mode();
    ESP_RETURN_ON_ERROR(
        wifi_radio_record_fault("get-mode", esp_wifi_get_mode(&current_mode)),
        TAG, "read Wi-Fi mode failed");
    if (current_mode != WIFI_MODE_NULL && current_mode != WIFI_MODE_STA &&
        current_mode != WIFI_MODE_AP && current_mode != WIFI_MODE_APSTA)
        return ESP_ERR_INVALID_STATE;
    /* Keep an effective superset while running: dropping an AP lease must not
     * tear down the surviving STA. Reconcile exactly at the next stopped start. */
    wifi_mode_t merged_mode = s_radio.started
        ? (wifi_mode_t)(current_mode | required_mode) : required_mode;
    if (merged_mode != current_mode) {
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
        for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
            if (s_radio.leases[i].raw_tx_identity != 0U) return ESP_ERR_INVALID_STATE;
#endif
        if (s_radio.operation.identity != 0U) return ESP_ERR_INVALID_STATE;
        if (s_radio.started) {
            err = wifi_radio_begin_events(RADIO_EVENTS_START,
                (wifi_mode_t)(merged_mode & ~current_mode));
            if (err != ESP_OK) return wifi_radio_record_fault("start-events", err);
            wifi_radio_set_state(ESP32_MQUICKJS_WIFI_RADIO_STARTING);
        }
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
        if (s_radio.started && !(current_mode & WIFI_MODE_STA) && (merged_mode & WIFI_MODE_STA) &&
            s_scan_parameters.generation == s_radio.generation &&
            (s_scan_parameters.known || s_scan_parameters.error != ESP_OK)) s_scan_parameters.pending = true;
#endif
        ESP_RETURN_ON_ERROR(
            wifi_radio_record_fault("mode", esp_wifi_set_mode(merged_mode)),
            TAG, "set Wi-Fi mode failed");
    }
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.effective_mode = merged_mode;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (s_radio.started) {
        if (merged_mode != current_mode) {
            err = wifi_radio_record_fault("start-events", wifi_radio_wait_events());
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
            if (err == ESP_OK) err = wifi_radio_restore_inactive_locked(merged_mode);
#endif
            if (err == ESP_OK) wifi_radio_set_state(ESP32_MQUICKJS_WIFI_RADIO_STARTED);
            return err;
        }
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
        return wifi_radio_restore_inactive_locked(merged_mode);
#else
        return ESP_OK;
#endif
    }
    return wifi_radio_start_stopped_locked(merged_mode, true);
}

static esp_err_t wifi_radio_refresh_channel(
    uint8_t *primary, wifi_second_chan_t *secondary, uint32_t *channel_generation)
{
    if (primary == NULL || secondary == NULL || channel_generation == NULL)
        return ESP_ERR_INVALID_ARG;
    taskENTER_CRITICAL(&s_radio.lock);
    uint32_t driver_generation = s_radio.generation;
    uint64_t revision = s_radio.channel_observation_revision;
    taskEXIT_CRITICAL(&s_radio.lock);
    uint8_t actual_primary = 0;
    wifi_second_chan_t actual_secondary = WIFI_SECOND_CHAN_NONE;
    esp_err_t err = esp_wifi_get_channel(&actual_primary, &actual_secondary);
    if (err == ESP_OK && actual_primary == 0U) err = ESP_ERR_INVALID_STATE;
    taskENTER_CRITICAL(&s_radio.lock);
    if (driver_generation != s_radio.generation) {
        taskEXIT_CRITICAL(&s_radio.lock);
        return ESP_ERR_INVALID_STATE;
    }
    if (revision == s_radio.channel_observation_revision) {
        s_radio.channel_observation_revision++;
        s_radio.channel_observation_error = err;
        if (err == ESP_OK) {
            if (s_radio.channel_generation == 0 || s_radio.primary_channel != actual_primary ||
                s_radio.secondary_channel != actual_secondary) {
                s_radio.primary_channel = actual_primary;
                s_radio.secondary_channel = actual_secondary;
                if (++s_radio.channel_generation == 0U) s_radio.channel_generation = 1U;
            }
            for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
                wifi_radio_live_lease_t *live = &s_radio.leases[i];
                if (live->identity != 0U && live->fixed_channel &&
                    (live->primary_channel != actual_primary ||
                     live->secondary_channel != (uint8_t)actual_secondary))
                    live->channel_conflict = true;
            }
        }
    }
    *primary = s_radio.primary_channel;
    *secondary = s_radio.secondary_channel;
    *channel_generation = s_radio.channel_generation;
    err = s_radio.channel_observation_error;
    taskEXIT_CRITICAL(&s_radio.lock);
    return err;
}

static esp_err_t wifi_radio_get_channel_locked(
    uint8_t *primary, wifi_second_chan_t *secondary, uint32_t *generation)
{
    return wifi_radio_refresh_channel(primary, secondary, generation);
}

esp_err_t esp32_mquickjs_wifi_radio_lease_channel_status(
    const esp32_mquickjs_wifi_radio_lease_t *lease,
    esp32_mquickjs_wifi_radio_channel_status_t *status)
{
    if (lease == NULL || status == NULL) return ESP_ERR_INVALID_ARG;
    memset(status, 0, sizeof(*status));
    esp_err_t err = ESP_ERR_INVALID_STATE;
    taskENTER_CRITICAL(&s_radio.lock);
    if (lease->acquired && lease->generation == s_radio.generation && s_radio.started) {
        for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
            wifi_radio_live_lease_t *live = &s_radio.leases[i];
            if (live->identity != 0U && live->identity == lease->identity && live->client == lease->client) {
                status->primary = s_radio.primary_channel;
                status->secondary = s_radio.secondary_channel;
                status->generation = s_radio.channel_generation;
                status->fixed = live->fixed_channel;
                status->conflicted = live->channel_conflict;
                err = s_radio.fault_stage != NULL ? s_radio.fault_error : s_radio.channel_observation_error;
                if (status->primary == 0U && err == ESP_OK) err = ESP_ERR_INVALID_STATE;
                break;
            }
        }
    }
    taskEXIT_CRITICAL(&s_radio.lock);
    return err;
}

static void wifi_radio_snapshot(esp32_mquickjs_wifi_radio_status_t *out_status)
{
    taskENTER_CRITICAL(&s_radio.lock);
    out_status->driver_state = s_radio.driver_state;
    out_status->initialized = s_radio.storage_configured;
    out_status->driver_owned = s_radio.driver_owned;
    out_status->started = s_radio.started;
    out_status->starting = s_radio.driver_state == ESP32_MQUICKJS_WIFI_RADIO_STARTING;
    out_status->restart_required = s_radio.restart_required;
    out_status->fault_stage = s_radio.fault_stage;
    out_status->fault_error = s_radio.fault_error;
    out_status->cleanup_stage = s_radio.cleanup_stage;
    out_status->cleanup_error = s_radio.cleanup_error;
    out_status->generation = s_radio.generation;
    out_status->mode = s_radio.effective_mode;
    out_status->storage = s_radio.storage;
    out_status->requested_mode = wifi_radio_requested_mode();
    out_status->configuration = s_radio.configuration;
    out_status->activation = s_radio.activation;
    out_status->event_phase = s_radio.event_phase;
    out_status->event_identity = s_radio.event_identity;
    out_status->event_expected = s_radio.event_expected;
    out_status->event_seen = s_radio.event_seen & 7U;
    out_status->event_stopped = s_radio.event_phase == RADIO_EVENTS_RESTART ? (s_radio.event_seen >> 4) & 7U :
        (s_radio.event_phase == RADIO_EVENTS_STOP || s_radio.event_phase == RADIO_EVENTS_AP_STOP) ? s_radio.event_seen : 0U;
    out_status->event_live = s_radio.event_live;
    out_status->event_fence_pending = s_radio.event_phase != RADIO_EVENTS_IDLE &&
        !s_radio.event_fence_seen;
    memcpy(out_status->clients, s_radio.clients, sizeof(out_status->clients));
    out_status->primary_channel = s_radio.primary_channel;
    out_status->secondary_channel = s_radio.secondary_channel;
    out_status->channel_generation = s_radio.channel_generation;
    out_status->channel_observation_error = s_radio.channel_observation_error;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        if (s_radio.leases[i].identity != 0U && s_radio.leases[i].fixed_channel) {
            out_status->fixed_channel_owners++;
            if (s_radio.leases[i].channel_conflict) out_status->conflicted_channel_owners++;
        }
    }
    out_status->lifecycle_active = s_radio.lifecycle.identity != 0U;
    out_status->active_operations = s_radio.operation.identity != 0U ? 1U : 0U;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].raw_tx_identity != 0U) ++out_status->active_operations;
#endif
    out_status->wake_locks = s_radio.wake_locks;
    out_status->wake_lock_error = s_radio.wake_lock_error;
    out_status->fixed_channel_claimed = out_status->fixed_channel_owners > 0U;
    out_status->promiscuous_claimed = s_radio.promiscuous_claimed;
    for (unsigned i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].promiscuous_identity != 0) ++out_status->promiscuous_owners;
    out_status->promiscuous_identity_exhausted = s_radio.next_promiscuous_identity == 0;
    out_status->promiscuous_client = s_radio.promiscuous_client;
    taskEXIT_CRITICAL(&s_radio.lock);
}

static esp_err_t wifi_radio_get_status_locked(
    esp32_mquickjs_wifi_radio_status_t *out_status)
{
    if (out_status == NULL) return ESP_ERR_INVALID_ARG;
    memset(out_status, 0, sizeof(*out_status));
    if (s_radio.started && s_radio.fault_stage == NULL) {
        uint8_t primary;
        wifi_second_chan_t secondary;
        uint32_t generation;
        (void)wifi_radio_get_channel_locked(&primary, &secondary, &generation);
        if (esp_wifi_get_max_tx_power(&out_status->max_tx_power_quarter_dbm) == ESP_OK)
            out_status->max_tx_power_available = true;
        if (esp_wifi_get_ps(&out_status->power_save) == ESP_OK)
            out_status->power_save_available = true;
    }
    wifi_radio_snapshot(out_status);
    return ESP_OK;
}

static esp_err_t wifi_radio_set_channel_locked(
    esp32_mquickjs_wifi_radio_lease_t *lease,
    uint8_t primary,
    wifi_second_chan_t secondary)
{
    if (s_radio.lifecycle.identity != 0U) return ESP_ERR_INVALID_STATE;
    wifi_ap_record_t ap = {0};
    wifi_config_t ap_config = {0};
    wifi_mode_t mode = WIFI_MODE_NULL;
    wifi_radio_live_lease_t *owner = NULL;
    uint8_t actual_primary;
    wifi_second_chan_t actual_secondary;
    uint32_t actual_generation;
    esp_err_t err;

