99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
    if (!wifi_radio_lease_valid(lease) || primary == 0 ||
        (secondary != WIFI_SECOND_CHAN_NONE &&
         secondary != WIFI_SECOND_CHAN_ABOVE &&
         secondary != WIFI_SECOND_CHAN_BELOW)) {
        return ESP_ERR_INVALID_ARG;
    }
    if (s_radio.fault_stage != NULL) return s_radio.fault_error;
    if (s_radio.operation.identity != 0U) return ESP_ERR_INVALID_STATE;
    err = wifi_radio_validate_regulatory_channel(primary);
    if (err != ESP_OK) return err;
    if (!s_radio.started) return ESP_ERR_INVALID_STATE;
    bool conflict = false;
    taskENTER_CRITICAL(&s_radio.lock);
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        wifi_radio_live_lease_t *live = &s_radio.leases[i];
        if (live->identity == lease->identity) owner = live;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
        if (live->raw_tx_identity != 0U) conflict = true;
#endif
        if (live->identity != 0U && live->identity != lease->identity &&
            live->fixed_channel && (live->primary_channel != primary ||
                live->secondary_channel != (uint8_t)secondary || live->channel_conflict))
            conflict = true;
    }
    conflict = conflict || owner == NULL || owner->channel_conflict;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (conflict) return ESP_ERR_INVALID_STATE;
    err = wifi_radio_get_channel_locked(&actual_primary, &actual_secondary, &actual_generation);
    if (err != ESP_OK) return err;
    taskENTER_CRITICAL(&s_radio.lock);
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U && s_radio.leases[i].channel_conflict)
            conflict = true;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (conflict) return ESP_ERR_INVALID_STATE;
    err = esp_wifi_sta_get_ap_info(&ap);
    if (err == ESP_OK && (ap.primary != primary || actual_secondary != secondary)) {
        err = ESP_ERR_INVALID_STATE;
        return err;
    }
    if (err != ESP_OK && err != ESP_ERR_WIFI_NOT_CONNECT) {
        return err;
    }
    err = esp_wifi_get_mode(&mode);
    if (err != ESP_OK) return err;
    if (mode == WIFI_MODE_AP || mode == WIFI_MODE_APSTA) {
        err = esp_wifi_get_config(WIFI_IF_AP, &ap_config);
        if (err != ESP_OK) return err;
        if ((ap_config.ap.channel != 0U && ap_config.ap.channel != primary) ||
            actual_primary != primary || actual_secondary != secondary) {
            err = ESP_ERR_INVALID_STATE;
            return err;
        }
    }
    taskENTER_CRITICAL(&s_radio.lock);
    uint64_t revision = s_radio.channel_observation_revision;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (actual_primary != primary || actual_secondary != secondary) {
        err = esp_wifi_set_channel(primary, secondary);
        if (err != ESP_OK) return err;
    }
    taskENTER_CRITICAL(&s_radio.lock);
    if (revision != s_radio.channel_observation_revision &&
        (s_radio.primary_channel != primary || s_radio.secondary_channel != secondary ||
         s_radio.channel_observation_error != ESP_OK)) {
        taskEXIT_CRITICAL(&s_radio.lock);
        return ESP_ERR_INVALID_STATE;
    }
    if (owner->channel_conflict) {
        taskEXIT_CRITICAL(&s_radio.lock);
        return ESP_ERR_INVALID_STATE;
    }
    s_radio.channel_observation_revision++;
    s_radio.channel_observation_error = ESP_OK;
    owner->fixed_channel = true;
    owner->primary_channel = primary;
    owner->secondary_channel = (uint8_t)secondary;
    if (s_radio.primary_channel != primary || s_radio.secondary_channel != secondary) {
        s_radio.primary_channel = primary;
        s_radio.secondary_channel = secondary;
        if (++s_radio.channel_generation == 0U) s_radio.channel_generation = 1U;
    }
    taskEXIT_CRITICAL(&s_radio.lock);
    return ESP_OK;
}

static void wifi_radio_release_channel_locked(
    esp32_mquickjs_wifi_radio_lease_t *lease)
{
    if (!wifi_radio_lease_valid(lease)) return;
    taskENTER_CRITICAL(&s_radio.lock);
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        if (s_radio.leases[i].identity == lease->identity) {
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
            if (s_radio.leases[i].raw_tx_identity != 0U) break;
#endif
            s_radio.leases[i].fixed_channel = false;
            s_radio.leases[i].channel_conflict = false;
            break;
        }
    }
    taskEXIT_CRITICAL(&s_radio.lock);
}

static wifi_radio_live_lease_t *wifi_radio_promiscuous_owner(uint32_t radio_identity)
{
    for (unsigned i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity == radio_identity && radio_identity != 0) return &s_radio.leases[i];
    return NULL;
}

static void wifi_radio_promiscuous_summary(void)
{
    s_radio.promiscuous_claimed = false;
    s_radio.promiscuous_lease_identity = 0;
    for (unsigned i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        if (s_radio.leases[i].promiscuous_identity == 0) continue;
        s_radio.promiscuous_claimed = true;
        s_radio.promiscuous_client = s_radio.leases[i].client;
        s_radio.promiscuous_lease_identity = s_radio.leases[i].identity;
        break;
    }
}

static void wifi_radio_promiscuous_clear_fault(void)
{
    taskENTER_CRITICAL(&s_radio.lock);
    if (s_radio.cleanup_stage != NULL && strncmp(s_radio.cleanup_stage, "promiscuous-", 12) == 0) {
        s_radio.cleanup_stage = NULL;
        s_radio.cleanup_error = ESP_OK;
        if (s_radio.fault_stage != NULL && strncmp(s_radio.fault_stage, "promiscuous-", 12) == 0) {
            s_radio.fault_stage = NULL;
            s_radio.fault_error = ESP_OK;
            s_radio.driver_state = s_radio.started ? ESP32_MQUICKJS_WIFI_RADIO_STARTED : ESP32_MQUICKJS_WIFI_RADIO_STOPPED;
        }
    }
    taskEXIT_CRITICAL(&s_radio.lock);
}

static esp_err_t wifi_radio_promiscuous_demand(esp32_mquickjs_wifi_promiscuous_demand_t *demand)
{
    bool enabled = false, preserve_baseline = false;
    unsigned receivers = 0;
    esp32_mquickjs_wifi_promiscuous_token_t tokens[ESP32_MQUICKJS_WIFI_PROMISCUOUS_MAX_SUBSCRIBERS];
    for (unsigned i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        const wifi_radio_live_lease_t *owner = &s_radio.leases[i];
        if (owner->promiscuous_identity == 0 || owner->promiscuous_closing) continue;
        enabled = true;
        if (owner->rx_token.identity != 0) {
            if (receivers == ESP32_MQUICKJS_WIFI_PROMISCUOUS_MAX_SUBSCRIBERS) return ESP_ERR_INVALID_STATE;
            tokens[receivers++] = owner->rx_token;
        }
        else preserve_baseline = true;
    }
    esp32_mquickjs_wifi_promiscuous_snapshot_t requirements;
    /* No unowned registry reservation may obtain SDK mutation rights. Control
     * transactions and the registry's lifecycle are serialized by this mutex. */
    if (!esp32_mquickjs_wifi_promiscuous_owned_requirements(tokens, receivers, &requirements))
        return ESP_ERR_INVALID_STATE;
    return esp32_mquickjs_wifi_promiscuous_driver_demand(&requirements, enabled, preserve_baseline, demand);
}

static esp_err_t wifi_radio_promiscuous_registry_error(esp32_mquickjs_wifi_promiscuous_result_t result)
{
    if (result == ESP32_MQUICKJS_WIFI_PROMISCUOUS_OK) return ESP_OK;
    if (result == ESP32_MQUICKJS_WIFI_PROMISCUOUS_CAPACITY) return ESP_ERR_NO_MEM;
    if (result == ESP32_MQUICKJS_WIFI_PROMISCUOUS_INVALID_ARGUMENT) return ESP_ERR_INVALID_ARG;
    return ESP_ERR_INVALID_STATE;
}

