99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
static void wifi_radio_release_promiscuous_locked(esp32_mquickjs_wifi_radio_promiscuous_lease_t *lease);

static esp_err_t wifi_radio_acquire_promiscuous_locked(
    esp32_mquickjs_wifi_radio_lease_t *radio_lease,
    esp32_mquickjs_wifi_radio_promiscuous_lease_t *out_lease,
    esp32_mquickjs_wifi_promiscuous_subscriber_t *subscriber,
    const esp32_mquickjs_wifi_rx_filter_t *filter,
    esp32_mquickjs_wifi_promiscuous_sink_t sink, void *context)
{
    if (!wifi_radio_lease_valid(radio_lease) || out_lease == NULL) return ESP_ERR_INVALID_ARG;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
    if (WIFI_RADIO_SMARTCONFIG_PENDING || WIFI_RADIO_WPS_PENDING) return ESP_ERR_INVALID_STATE;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_DPP_SUPPORT
    if (WIFI_RADIO_DPP_PENDING) return ESP_ERR_INVALID_STATE;
#endif
    memset(out_lease, 0, sizeof(*out_lease));
    if ((subscriber == NULL && (filter != NULL || sink != NULL || context != NULL)) ||
        (subscriber != NULL && (!esp32_mquickjs_wifi_rx_filter_valid(filter) || sink == NULL)))
        return ESP_ERR_INVALID_ARG;
    if (s_radio.lifecycle.identity != 0U || !s_radio.started) return ESP_ERR_INVALID_STATE;
    if (s_radio.fault_stage != NULL) return s_radio.fault_error;
    wifi_radio_live_lease_t *owner = wifi_radio_promiscuous_owner(radio_lease->identity);
    if (owner == NULL || owner->promiscuous_identity != 0) return ESP_ERR_INVALID_STATE;
    if (s_radio.next_promiscuous_identity == 0) return ESP_ERR_INVALID_STATE;
    esp32_mquickjs_wifi_promiscuous_token_t rx_token = {0};
    if (subscriber != NULL) {
        esp_err_t err = wifi_radio_promiscuous_registry_error(esp32_mquickjs_wifi_promiscuous_reserve(
            subscriber, filter, sink, context, &rx_token));
        if (err != ESP_OK) return err;
    }
    taskENTER_CRITICAL(&s_radio.lock);
    owner->rx_token = rx_token;
    owner->promiscuous_closing = false;
    owner->promiscuous_identity = s_radio.next_promiscuous_identity;
    s_radio.next_promiscuous_identity = s_radio.next_promiscuous_identity == UINT32_MAX ? 0 : s_radio.next_promiscuous_identity + 1U;
    wifi_radio_promiscuous_summary();
    taskEXIT_CRITICAL(&s_radio.lock);
    *out_lease = (esp32_mquickjs_wifi_radio_promiscuous_lease_t){
        .generation = radio_lease->generation, .radio_lease_identity = radio_lease->identity,
        .identity = owner->promiscuous_identity, .client = radio_lease->client,
        .acquired = true, .framework_enabled = true,
    };
    esp32_mquickjs_wifi_promiscuous_demand_t demand;
    esp_err_t err = wifi_radio_promiscuous_demand(&demand);
    esp32_mquickjs_wifi_promiscuous_driver_status_t status = {0};
    if (err == ESP_OK) {
        err = esp32_mquickjs_wifi_promiscuous_driver_apply(&demand);
        esp32_mquickjs_wifi_promiscuous_driver_status(&status);
    }
    if (err == ESP_OK && rx_token.identity != 0) {
        err = wifi_radio_promiscuous_registry_error(esp32_mquickjs_wifi_promiscuous_activate(&owner->rx_token));
        if (err != ESP_OK) {
            (void)wifi_radio_cleanup_fault("promiscuous-activate", err);
            wifi_radio_release_promiscuous_locked(out_lease);
        }
        return err;
    }
    if (err != ESP_OK) {
        taskENTER_CRITICAL(&s_radio.lock);
        owner->promiscuous_closing = true;
        taskEXIT_CRITICAL(&s_radio.lock);
        if (rx_token.identity != 0 && esp32_mquickjs_wifi_promiscuous_begin_close(&owner->rx_token) !=
            ESP32_MQUICKJS_WIFI_PROMISCUOUS_OK) {
            (void)wifi_radio_cleanup_fault("promiscuous-registry", ESP_ERR_INVALID_STATE);
            return err;
        }
        if (status.cleanup_pending) {
            (void)wifi_radio_record_fault(status.error_stage, status.error);
            (void)wifi_radio_cleanup_fault(status.cleanup_stage, status.cleanup_error);
            /* A failed open still owns its reserved control and Radio claim
             * until driver rollback and registry drain both finish. */
        } else {
            if (rx_token.identity != 0 && esp32_mquickjs_wifi_promiscuous_finish_close(&owner->rx_token) !=
                ESP32_MQUICKJS_WIFI_PROMISCUOUS_OK) {
                (void)wifi_radio_cleanup_fault("promiscuous-registry", ESP_ERR_INVALID_STATE);
                return err;
            }
            taskENTER_CRITICAL(&s_radio.lock);
            owner->promiscuous_identity = 0;
            owner->promiscuous_closing = false;
            wifi_radio_promiscuous_summary();
            taskEXIT_CRITICAL(&s_radio.lock);
            memset(out_lease, 0, sizeof(*out_lease));
        }
    }
    return err;
}

static void wifi_radio_release_promiscuous_locked(
    esp32_mquickjs_wifi_radio_promiscuous_lease_t *lease)
{
    if (lease == NULL || !lease->acquired) return;
    wifi_radio_live_lease_t *owner = wifi_radio_promiscuous_owner(lease->radio_lease_identity);
    if (lease->generation != s_radio.generation || owner == NULL ||
        owner->client != lease->client || lease->identity == 0 || owner->promiscuous_identity != lease->identity) {
        memset(lease, 0, sizeof(*lease));
        return;
    }
    taskENTER_CRITICAL(&s_radio.lock);
    owner->promiscuous_closing = true;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (owner->rx_token.identity != 0 && esp32_mquickjs_wifi_promiscuous_begin_close(&owner->rx_token) !=
        ESP32_MQUICKJS_WIFI_PROMISCUOUS_OK) {
        (void)wifi_radio_cleanup_fault("promiscuous-registry", ESP_ERR_INVALID_STATE);
        return;
    }
    esp_err_t err = esp32_mquickjs_wifi_promiscuous_driver_recover();
    if (err == ESP_OK) {
        esp32_mquickjs_wifi_promiscuous_demand_t demand;
        err = wifi_radio_promiscuous_demand(&demand);
        if (err != ESP_OK) {
            (void)wifi_radio_cleanup_fault("promiscuous-registry", err);
            return;
        }
        err = esp32_mquickjs_wifi_promiscuous_driver_apply(&demand);
    }
    if (err != ESP_OK) {
        esp32_mquickjs_wifi_promiscuous_driver_status_t status;
        esp32_mquickjs_wifi_promiscuous_driver_status(&status);
        if (status.error != ESP_OK && status.error_stage != NULL)
            (void)wifi_radio_record_fault(status.error_stage, status.error);
        (void)wifi_radio_cleanup_fault(status.cleanup_pending ? status.cleanup_stage :
            (status.error_stage != NULL ? status.error_stage : "promiscuous-stop"),
            status.cleanup_pending ? status.cleanup_error : err);
        return;
    }
    if (owner->rx_token.identity != 0) {
        esp32_mquickjs_wifi_promiscuous_result_t result = esp32_mquickjs_wifi_promiscuous_finish_close(&owner->rx_token);
        if (result == ESP32_MQUICKJS_WIFI_PROMISCUOUS_DRAINING) return;
        if (result != ESP32_MQUICKJS_WIFI_PROMISCUOUS_OK) {
            (void)wifi_radio_cleanup_fault("promiscuous-registry", ESP_ERR_INVALID_STATE);
            return;
        }
    }
    taskENTER_CRITICAL(&s_radio.lock);
    owner->promiscuous_identity = 0;
    owner->promiscuous_closing = false;
    wifi_radio_promiscuous_summary();
    taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_promiscuous_clear_fault();
    memset(lease, 0, sizeof(*lease));
}

static void wifi_radio_release_locked(
    esp32_mquickjs_wifi_radio_lease_t *lease)
{
    if (!wifi_radio_lease_valid(lease)) {
        return;
    }
#if ESP32_MQUICKJS_WIFI_MESH_AVAILABLE
    if (lease->client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_MESH &&
        !wifi_radio_mesh_release_owner_locked(lease)) return;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_DPP_SUPPORT
    if (s_dpp_radio) for (unsigned i = 0; i < 3; ++i)
        if (s_dpp_radio->owners[i] == lease->identity) return;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
    if (s_sc_radio) for (unsigned i = 0; i < 3; ++i)
        if (s_sc_radio->owners[i] == lease->identity) return;
    if (s_wps_radio) for (unsigned i = 0; i < 3; ++i)
        if (s_wps_radio->owners[i] == lease->identity) return;
#if CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR
    if (s_wps_ap_radio) for (unsigned i = 0; i < 3; ++i)
        if (s_wps_ap_radio->owners[i] == lease->identity) return;
#endif
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    if (WIFI_RADIO_EAP_PENDING && s_eap_radio.generation == lease->generation)
        for (unsigned i = 0; i < 3; ++i) if (s_eap_radio.owners[i] == lease->identity) return;
#endif
    if (s_radio.operation.identity != 0U &&
        s_radio.operation.lease_identity == lease->identity) return;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    if (wifi_radio_twt_individual_lease_retained(lease) || wifi_radio_twt_broadcast_lease_retained(lease)) return;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI || CONFIG_ESP32_MQUICKJS_FEATURE_ESPNOW
    if (s_interval.owner.owner_identity == lease->identity && s_interval.owner.generation == lease->generation) return;
#endif
    wifi_radio_live_lease_t *owner = wifi_radio_promiscuous_owner(lease->identity);
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    if (owner != NULL && owner->raw_tx_identity != 0U) return;
    if (s_tx_rate_lease.identity == lease->identity &&
        s_tx_rate_lease.generation == lease->generation) return;
#endif
    if (owner != NULL && owner->promiscuous_identity != 0) {
        esp32_mquickjs_wifi_radio_promiscuous_lease_t promiscuous = {
            .generation = lease->generation,
            .identity = owner->promiscuous_identity,
            .radio_lease_identity = lease->identity,
            .client = lease->client,
            .acquired = true,
            .framework_enabled = true,
        };
        wifi_radio_release_promiscuous_locked(&promiscuous);
        if (promiscuous.acquired) return;
    }
    taskENTER_CRITICAL(&s_radio.lock);
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        if (s_radio.leases[i].identity == lease->identity) {
            memset(&s_radio.leases[i], 0, sizeof(s_radio.leases[i]));
            s_radio.clients[lease->client]--;
            break;
        }
    }
    taskEXIT_CRITICAL(&s_radio.lock);
    memset(lease, 0, sizeof(*lease));
}

