99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
/* Observation failure never prevents STOP. Capture once per STOP event
 * identity, before its first SDK submission; a retry must not replace the
 * predecessor with failed/stopped SDK output. This is historical evidence,
 * not yet admission for replay across later stopped-state configuration. */
static void wifi_radio_capture_stop_snapshot_locked(void)
{
    esp32_mquickjs_wifi_radio_stop_snapshot_t snapshot = {
        .generation = s_radio.generation, .stop_identity = s_radio.event_identity,
        .mode = (uint8_t)s_radio.effective_mode,
        .error = ESP_ERR_INVALID_STATE, .step = ESP32_MQUICKJS_WIFI_STOP_SNAPSHOT_ADMISSION,
    };
    if (!s_radio.started || !s_radio.driver_owned || !s_radio.storage_configured ||
        s_radio.fault_stage != NULL || s_radio.restart_required ||
        (s_radio.effective_mode != WIFI_MODE_STA && s_radio.effective_mode != WIFI_MODE_AP &&
         s_radio.effective_mode != WIFI_MODE_APSTA)) goto done;
    if (s_radio.effective_mode & WIFI_MODE_STA)
        (void)wifi_radio_scan_parameters_observe_locked(NULL);
    int8_t power;
    wifi_band_mode_t band_mode, verified_mode;
    wifi_band_t band, verified_band;
    uint8_t primary, home;
    uint16_t inactive_time[2] = {0};
    wifi_second_chan_t secondary = WIFI_SECOND_CHAN_NONE, home_secondary = WIFI_SECOND_CHAN_NONE;
    snapshot.step = ESP32_MQUICKJS_WIFI_STOP_SNAPSHOT_POWER;
    snapshot.error = esp_wifi_get_max_tx_power(&power);
    if (snapshot.error == ESP_OK && (power < 8 || power > 80)) snapshot.error = ESP_ERR_INVALID_RESPONSE;
    if (snapshot.error != ESP_OK) goto done;
    snapshot.step = ESP32_MQUICKJS_WIFI_STOP_SNAPSHOT_BAND;
    snapshot.error = wifi_radio_band_snapshot(&band_mode, &band);
    if (snapshot.error != ESP_OK) goto done;
    snapshot.step = ESP32_MQUICKJS_WIFI_STOP_SNAPSHOT_CHANNEL;
    snapshot.error = esp_wifi_get_channel(&primary, &secondary);
    if (snapshot.error != ESP_OK) goto done;
    snapshot.step = ESP32_MQUICKJS_WIFI_STOP_SNAPSHOT_HOME;
    snapshot.error = esp_wifi_get_home_channel(&home, &home_secondary);
    if (snapshot.error != ESP_OK) goto done;
    for (unsigned i = 0; i < 2; ++i) {
        if (!(snapshot.mode & (1U << i))) continue;
        snapshot.step = i == 0 ? ESP32_MQUICKJS_WIFI_STOP_SNAPSHOT_STA_INACTIVE
                              : ESP32_MQUICKJS_WIFI_STOP_SNAPSHOT_AP_INACTIVE;
        snapshot.error = esp_wifi_get_inactive_time(i == 0 ? WIFI_IF_STA : WIFI_IF_AP, &inactive_time[i]);
        if (snapshot.error == ESP_OK && inactive_time[i] < (i == 0 ? 3 : 10))
            snapshot.error = ESP_ERR_INVALID_RESPONSE;
        wifi_radio_inactive_history_record(i, inactive_time[i], snapshot.error);
        if (snapshot.error != ESP_OK) goto done;
    }
    snapshot.step = ESP32_MQUICKJS_WIFI_STOP_SNAPSHOT_VERIFY;
    snapshot.error = wifi_radio_band_snapshot(&verified_mode, &verified_band);
    if (snapshot.error != ESP_OK) goto done;
    if (verified_mode != band_mode || verified_band != band || primary != home || secondary != home_secondary ||
        (secondary != WIFI_SECOND_CHAN_NONE && secondary != WIFI_SECOND_CHAN_ABOVE && secondary != WIFI_SECOND_CHAN_BELOW) ||
        (band == WIFI_BAND_2G ? primary < 1 || primary > 14 : esp32_mquickjs_wifi_radio_5ghz_channel_bit(primary) == 0U)) {
        snapshot.error = ESP_ERR_INVALID_RESPONSE;
        goto done;
    }
    snapshot.tx_power = power;
    snapshot.band_mode = (uint8_t)band_mode;
    snapshot.band = (uint8_t)band;
    snapshot.primary = primary;
    snapshot.secondary = (uint8_t)secondary;
    memcpy(snapshot.inactive_time, inactive_time, sizeof(inactive_time));
    snapshot.step = ESP32_MQUICKJS_WIFI_STOP_SNAPSHOT_COMPLETE;
    /* Candidate until STOP/fence completes. The getter also checks live state;
     * a later mutation clears this bit even while STOP cleanup is pending. */
    snapshot.unchanged = true;
done:
    /* Partial SDK outputs remain local. Only a complete observation supplies
     * payload; generation/event/error survive even on failed capture. */
    s_stop_snapshot = snapshot;
}

static bool wifi_radio_stop_snapshot_unchanged_locked(void)
{
    return s_stop_snapshot.unchanged && s_stop_snapshot.stop_identity != 0U &&
        s_stop_snapshot.stop_identity == s_radio.event_identity &&
        s_stop_snapshot.generation == s_radio.generation &&
        s_stop_snapshot.error == ESP_OK && s_stop_snapshot.step == ESP32_MQUICKJS_WIFI_STOP_SNAPSHOT_COMPLETE &&
        s_radio.driver_owned && s_radio.storage_configured && !s_radio.started && !s_radio.stop_required &&
        s_radio.driver_state == ESP32_MQUICKJS_WIFI_RADIO_STOPPED &&
        s_radio.fault_stage == NULL && s_radio.cleanup_stage == NULL && !s_radio.restart_required;
}

/* STOP removed the power/current/home getters. Use only the same physical
 * generation's unmodified predecessor, while verifying the SDK band policy
 * that remains readable after STOP. No driver mutation or guessed default. */
static esp_err_t wifi_radio_restart_stopped_observations_locked(
    wifi_radio_restart_configs_t *snapshot, bool verify)
{
    if (!wifi_radio_stop_snapshot_unchanged_locked() ||
        s_stop_snapshot.mode != (uint8_t)s_radio.effective_mode) return ESP_ERR_INVALID_STATE;
    wifi_band_mode_t mode;
    esp_err_t err = esp_wifi_get_band_mode(&mode);
    if (err != ESP_OK) return err;
    if (mode != (wifi_band_mode_t)s_stop_snapshot.band_mode) return ESP_ERR_INVALID_RESPONSE;
    if (verify)
        return snapshot->tx_power == s_stop_snapshot.tx_power && snapshot->band_mode == mode &&
            snapshot->band == (wifi_band_t)s_stop_snapshot.band && snapshot->primary == s_stop_snapshot.primary &&
            snapshot->secondary == (wifi_second_chan_t)s_stop_snapshot.secondary &&
            snapshot->inactive_mask == s_stop_snapshot.mode &&
            (!(snapshot->inactive_mask & WIFI_MODE_STA) || snapshot->inactive_time[0] == s_stop_snapshot.inactive_time[0]) &&
            (!(snapshot->inactive_mask & WIFI_MODE_AP) || snapshot->inactive_time[1] == s_stop_snapshot.inactive_time[1])
            ? ESP_OK : ESP_ERR_INVALID_RESPONSE;
    snapshot->tx_power = s_stop_snapshot.tx_power;
    snapshot->band_mode = mode;
    snapshot->band = (wifi_band_t)s_stop_snapshot.band;
    snapshot->primary = s_stop_snapshot.primary;
    snapshot->secondary = (wifi_second_chan_t)s_stop_snapshot.secondary;
    snapshot->inactive_mask = s_stop_snapshot.mode;
    memcpy(snapshot->inactive_time, s_stop_snapshot.inactive_time, sizeof(snapshot->inactive_time));
    snapshot->visible_bands = mode == WIFI_BAND_MODE_2G_ONLY ? 1U : mode == WIFI_BAND_MODE_5G_ONLY ? 2U : 3U;
    return ESP_OK;
}
#endif

