99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
/* An explicitly admitted recovery can retain its exact native owner across
 * physical STOP. The other exception is an exact temporary-rate owner restoring
 * pre-start settings. NULL requires zero owners; neither path drops a token to
 * satisfy admission or permits unrelated owners across SDK STOP. */
static esp_err_t wifi_radio_stop_owners_locked(const esp32_mquickjs_wifi_radio_lease_t *allowed,
    bool twt_recovery, uint32_t dpp_identity)
{
    bool dpp_restore = false;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_DPP_SUPPORT
    if (dpp_identity) {
        dpp_restore = wifi_radio_dpp_stop_owner_locked(dpp_identity);
        if (!dpp_restore || allowed || twt_recovery) return ESP_ERR_INVALID_STATE;
    }
#else
    if (dpp_identity) return ESP_ERR_INVALID_STATE;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    if (WIFI_RADIO_EAP_PENDING) return ESP_ERR_INVALID_STATE;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    if (twt_recovery && (allowed != NULL || !wifi_radio_twt_recovery_exact_locked(&s_radio.lifecycle) ||
        !s_twt_recovery.prepared || !wifi_radio_twt_recovery_owners_locked())) return ESP_ERR_INVALID_STATE;
#else
    if (twt_recovery) return ESP_ERR_INVALID_STATE;
#endif
    uint32_t identity = 0;
    if (allowed != NULL) {
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
        if (!wifi_radio_lease_valid(allowed)) return ESP_ERR_INVALID_STATE;
        if (allowed->client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_RAW_TX) {
            if (!wifi_radio_raw_tx_recovery_owner_locked(allowed) &&
                (s_tx_rate_lease.identity != allowed->identity || s_tx_rate_lease.generation != allowed->generation ||
                 s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U)) return ESP_ERR_INVALID_STATE;
#if ESP32_MQUICKJS_WIFI_MESH_AVAILABLE
        } else if (allowed->client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_MESH) {
            if (!wifi_radio_mesh_stop_owner_locked(allowed)) return ESP_ERR_INVALID_STATE;
#endif
        } else if (allowed->client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_ACTION) {
            esp32_mquickjs_wifi_action_token_t operation = {s_action.lane.generation, s_action.lane.identity};
            if (!wifi_radio_action_recovery_exact_locked(&s_radio.lifecycle) ||
                allowed->identity != s_action.lease.identity || !wifi_radio_action_exact_locked(&operation) ||
                s_action.lane.dispatching || s_action.lane.cancel_busy) return ESP_ERR_INVALID_STATE;
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
        } else if (allowed->client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_FTM) {
            if (!wifi_radio_ftm_recovery_exact_locked(&s_radio.lifecycle) ||
                allowed->identity != s_ftm.lease.identity || !wifi_radio_ftm_exact_locked(&s_ftm.state.token) ||
                !s_ftm.state.submitted || s_ftm.state.dispatching) return ESP_ERR_INVALID_STATE;
#endif
        } else return ESP_ERR_INVALID_STATE;
        wifi_radio_live_lease_t *owner = wifi_radio_promiscuous_owner(allowed->identity);
        if (owner == NULL || (owner->raw_tx_identity != 0U && !wifi_radio_raw_tx_recovery_owner_locked(allowed)))
            return ESP_ERR_INVALID_STATE;
        identity = allowed->identity;
#else
        return ESP_ERR_INVALID_STATE;
#endif
    }
    if (s_radio.wake_locks != 0) return ESP_ERR_INVALID_STATE;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (!twt_recovery && !dpp_restore && s_radio.leases[i].identity != 0U && s_radio.leases[i].identity != identity) return ESP_ERR_INVALID_STATE;
    if (s_radio.promiscuous_claimed) return ESP_ERR_INVALID_STATE;
    if (s_radio.restart_required) return s_radio.fault_error;
    if (!s_radio.stop_required) {
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
        if (twt_recovery && !s_twt_recovery.stopped) return ESP_ERR_INVALID_STATE;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
        if (wifi_radio_raw_tx_recovery_exact_locked(&s_radio.lifecycle) && !s_raw_tx_recovery.stopped)
            return ESP_ERR_INVALID_STATE;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
        if (wifi_radio_ftm_recovery_exact_locked(&s_radio.lifecycle) && !s_ftm.recovery_stopped)
            return ESP_ERR_INVALID_STATE;
#endif
        return ESP_OK;
    }
    wifi_radio_set_state(ESP32_MQUICKJS_WIFI_RADIO_STOPPING);
    esp_err_t err;
    if (s_radio.event_phase != RADIO_EVENTS_STOP) {
        taskENTER_CRITICAL(&s_radio.lock);
        /* An interface may already have delivered STOP during a failed AP
         * transition. Wait only for still-live interfaces, then require the
         * complete live mask to be empty at the queue fence. A configured mode
         * can include an already retired interface and would wait for a second
         * STOP that the SDK will not emit. */
        wifi_mode_t expected = s_radio.event_live;
        taskEXIT_CRITICAL(&s_radio.lock);
        err = wifi_radio_begin_events(RADIO_EVENTS_STOP, expected);
        if (err != ESP_OK) return wifi_radio_cleanup_fault("stop-events", err);
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
        wifi_radio_capture_stop_snapshot_locked();
#endif
    }
    if (!s_radio.stop_submitted) {
#if ESP32_MQUICKJS_WIFI_HE_STATISTICS_AVAILABLE
        err = wifi_radio_retire_he_statistics_locked();
        if (err != ESP_OK) return err;
#endif
        err = esp_wifi_stop();
        if (err != ESP_OK && err != ESP_ERR_WIFI_NOT_STARTED)
            return wifi_radio_cleanup_fault("stop", err);
        s_radio.stop_submitted = true;
    }
    /* An accepted stop is never repeated merely because its event/fence is
     * delayed or the event queue is full. Retry only this retained suffix.
     * DPP restoration runs on a worker: it must not enter the active JS
     * runtime's native-wait scope or call its cooperation hook off-task. */
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_DPP_SUPPORT
    err = dpp_restore ? wifi_radio_wait_events_inner(NULL) : wifi_radio_wait_events();
#else
    err = wifi_radio_wait_events();
#endif
    if (err != ESP_OK) return wifi_radio_cleanup_fault("stop-events", err);
#if ESP32_MQUICKJS_WIFI_AP_PRESTART_AVAILABLE
    if (s_radio.ap_reopen_config_pending) {
        err = esp32_mquickjs_wifi_ap_prestart_release(s_radio.lifecycle.generation, s_radio.lifecycle.identity);
        if (err != ESP_OK) return wifi_radio_cleanup_fault("ap-prestart-release", err);
        s_radio.ap_reopen_config_pending = false;
    }
#endif
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.started = false;
    s_radio.stop_required = false;
    s_radio.stop_submitted = false;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    if (wifi_radio_raw_tx_recovery_exact_locked(&s_radio.lifecycle)) s_raw_tx_recovery.stopped = true;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    if (wifi_radio_ftm_recovery_exact_locked(&s_radio.lifecycle)) s_ftm.recovery_stopped = true;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    if (twt_recovery) s_twt_recovery.stopped = true;
#endif
    s_radio.ap_stop_phase = AP_STOP_IDLE;
    s_radio.ap_reopen_pending = s_radio.ap_reopen_attempted = false;
    s_radio.ap_reopen_quiesced = s_radio.ap_reopen_restore_complete = false;
    s_radio.ap_transition_application = s_radio.ap_transition_station = s_radio.ap_transition_access_point = 0;
    s_radio.ap_stop_error = ESP_OK;
    if (s_radio.cleanup_stage != NULL &&
        (strcmp(s_radio.cleanup_stage, "stop") == 0 || strcmp(s_radio.cleanup_stage, "stop-events") == 0 ||
         strcmp(s_radio.cleanup_stage, "he-statistics-retire") == 0)) {
        s_radio.cleanup_stage = NULL;
        s_radio.cleanup_error = ESP_OK;
        if (s_radio.fault_stage != NULL &&
            (strcmp(s_radio.fault_stage, "stop") == 0 || strcmp(s_radio.fault_stage, "stop-events") == 0 ||
             strcmp(s_radio.fault_stage, "he-statistics-retire") == 0)) {
            s_radio.fault_stage = NULL;
            s_radio.fault_error = ESP_OK;
        }
    }
    /* A failed init/start needs shutdown; stop alone does not rebuild storage. */
    s_radio.driver_state = s_radio.fault_stage == NULL
        ? ESP32_MQUICKJS_WIFI_RADIO_STOPPED : ESP32_MQUICKJS_WIFI_RADIO_CLEANUP_PENDING;
    taskEXIT_CRITICAL(&s_radio.lock);
    return ESP_OK;
}

static esp_err_t wifi_radio_stop_lease_locked(const esp32_mquickjs_wifi_radio_lease_t *allowed, bool twt_recovery)
{
    return wifi_radio_stop_owners_locked(allowed, twt_recovery, 0);
}

