99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
void esp32_mquickjs_wifi_radio_stop_snapshot(esp32_mquickjs_wifi_radio_stop_snapshot_t *snapshot)
{
    if (snapshot == NULL) return;
    wifi_radio_operation_lock();
    *snapshot = s_stop_snapshot;
    snapshot->unchanged = wifi_radio_stop_snapshot_unchanged_locked();
    wifi_radio_operation_unlock();
}
#endif

static esp_err_t wifi_radio_stop_locked(void)
{
    return wifi_radio_stop_lease_locked(NULL, false);
}

esp_err_t esp32_mquickjs_wifi_radio_release_and_stop_idle(
    esp32_mquickjs_wifi_radio_lease_t *lease)
{
    if (lease == NULL) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_OK;
    if (lease->acquired) {
        if (!wifi_radio_lease_valid(lease)) { err = ESP_ERR_INVALID_STATE; goto done; }
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
        if (s_tx_rate_lease.identity == lease->identity && s_tx_rate_lease.generation == lease->generation) {
            err = wifi_radio_restore_tx_rate_locked(lease);
            if (err != ESP_OK) goto done;
        }
#endif
        wifi_radio_release_locked(lease);
        if (lease->acquired) {
            err = s_radio.fault_stage != NULL ? s_radio.fault_error : ESP_ERR_INVALID_STATE;
            goto done;
        }
    }
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
    if (s_radio.lifecycle.identity == 0U) err = wifi_radio_stop_locked();
done:
    wifi_radio_operation_unlock();
    return err;
}

static esp_err_t wifi_radio_shutdown_lease_locked(const esp32_mquickjs_wifi_radio_lease_t *allowed, bool twt_recovery)
{
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_WAPI_PSK
    esp32_mquickjs_wifi_wapi_status_t wapi;
    esp32_mquickjs_wifi_wapi_sdk_status(&wapi);
    if (wapi.uncertain) return wifi_radio_cleanup_fault("wapi-deinit", wapi.cleanup_error ?
        wapi.cleanup_error : wapi.error ? wapi.error : ESP_ERR_INVALID_STATE);
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    /* A parked Vendor IE still owns driver copies through its exact token. */
    if (s_vendor_ie.start_owner.identity != 0U) return ESP_ERR_INVALID_STATE;
#endif
    esp_err_t err = wifi_radio_stop_lease_locked(allowed, twt_recovery);
    if (err != ESP_OK) return err;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    /* TWT retirement still uses the initialized native ioctl queue. Keep both
     * driver and callback routes until the original owners have drained. */
    if (twt_recovery && (s_radio.clients[ESP32_MQUICKJS_WIFI_RADIO_CLIENT_TWT] != 0U ||
        s_radio.operation.identity != 0U || esp32_mquickjs_wifi_twt_information_pending()))
        return wifi_radio_cleanup_fault("twt-native-drain", ESP_ERR_TIMEOUT);
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    if (wifi_radio_ftm_recovery_exact_locked(&s_radio.lifecycle) && s_radio.driver_owned) {
        err = wifi_radio_ftm_recovery_timer_locked();
        if (err != ESP_OK) return wifi_radio_cleanup_fault(s_ftm.recovery_timer_ready ? "ftm-sdk-drain" : "ftm-timer-drain", err);
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    err = esp32_mquickjs_wifi_vendor_ie_broker_unregister(s_radio.generation);
    if (err != ESP_OK) {
        esp32_mquickjs_wifi_vendor_ie_broker_status_t vendor;
        esp32_mquickjs_wifi_vendor_ie_broker_status(&vendor);
        return wifi_radio_cleanup_fault(vendor.unregister_written ? "vendor-ie-drain" : "vendor-ie-unregister", err);
    }
    esp32_mquickjs_wifi_raw_tx_broker_status_t raw_tx;
    esp32_mquickjs_wifi_raw_tx_broker_status(&raw_tx);
    if (raw_tx.generation != 0U) {
        if (raw_tx.generation != s_radio.generation)
            return wifi_radio_cleanup_fault("raw-tx-generation", ESP_ERR_INVALID_STATE);
        bool recovery = wifi_radio_raw_tx_recovery_exact_locked(&s_radio.lifecycle);
        err = recovery ? esp32_mquickjs_wifi_raw_tx_broker_quiesce(raw_tx.generation, &s_raw_tx_recovery.operation)
            : esp32_mquickjs_wifi_raw_tx_broker_unregister(raw_tx.generation);
        if (err != ESP_OK) return wifi_radio_cleanup_fault("raw-tx-unregister", err);
        if (recovery && !s_raw_tx_recovery.sdk_fenced) {
            /* Unregister only clears a function pointer. Drain SDK task work
             * that may already have loaded it before physical deinit. */
            err = esp32_mquickjs_wifi_action_sdk_fence();
            if (err != ESP_OK) return wifi_radio_cleanup_fault("raw-tx-sdk-drain", err);
            s_raw_tx_recovery.sdk_fenced = true;
        }
    }
#endif
    if (s_channel_event_instance != NULL) {
        err = esp_event_handler_instance_unregister(WIFI_EVENT, ESP_EVENT_ANY_ID, s_channel_event_instance);
        if (err != ESP_OK) return wifi_radio_cleanup_fault("channel-unregister", err);
        s_channel_event_instance = NULL;
    }
    while (atomic_load_explicit(&s_channel_callbacks, memory_order_acquire) != 0U) {
        if (esp32_mquickjs_wifi_wait_remaining(portMAX_DELAY) == 0)
            return wifi_radio_cleanup_fault("channel-drain", ESP_ERR_TIMEOUT);
        vTaskDelay(1);
    }
    if (s_radio.driver_owned) {
#if ESP32_MQUICKJS_WIFI_HE_STATISTICS_AVAILABLE
        /* Covers initialized-but-stopped cleanup too; never destroy the native
         * task while it still owns statistics allocations. */
        err = wifi_radio_retire_he_statistics_locked();
        if (err != ESP_OK) return err;
#endif
        wifi_radio_set_state(ESP32_MQUICKJS_WIFI_RADIO_CLEANUP_PENDING);
        err = esp_wifi_deinit();
        if (err != ESP_OK) return wifi_radio_cleanup_fault("deinit", err);
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_WAPI_PSK
        err = esp32_mquickjs_wifi_wapi_sdk_cleanup_error();
        if (err != ESP_OK) {
            /* Physical deinit returned; do not repeat it because the SDK
             * discarded a WAPI cleanup error. Keep the fault diagnosable. */
            s_radio.driver_owned = false;
            return wifi_radio_cleanup_fault("wapi-deinit", err);
        }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI || CONFIG_ESP32_MQUICKJS_FEATURE_ESPNOW
        /* Normal shutdown requires zero Radio owners, hence no interval token.
         * Only successful physical deinit invalidates accepted SDK knowledge. */
        (void)esp32_mquickjs_wifi_interval_invalidate(&s_interval, s_radio.generation);
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
        /* Unregistration and callback retirement preceded physical deinit.
         * Only this successful physical boundary grants termination. Leave the
         * operation token and generation intact until its native owner retires. */
        if (wifi_radio_action_recovery_exact_locked(&s_radio.lifecycle) && s_action.lane.identity != 0U) {
            esp32_mquickjs_wifi_action_token_t operation = {s_action.lane.generation, s_action.lane.identity};
            taskENTER_CRITICAL(&s_radio.lock);
            (void)esp32_mquickjs_wifi_action_terminated(&s_action.lane, &operation);
            taskEXIT_CRITICAL(&s_radio.lock);
        }
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
        if (wifi_radio_ftm_recovery_exact_locked(&s_radio.lifecycle) && s_ftm.lease.acquired) {
            /* STOP freed SDK report/context, TASK timers and channel callbacks
             * drained before this deinit. Keep original attribution errors;
             * physical retirement does not fabricate a ranging completion. */
            taskENTER_CRITICAL(&s_radio.lock);
            s_ftm.state.physical_termination = true;
            s_ftm.state.report_consumed = s_ftm.state.report_discarded = true;
            s_ftm.state.copied_entries = 0;
            s_ftm.state.sdk_fenced = s_ftm.state.event_fenced = true;
            taskEXIT_CRITICAL(&s_radio.lock);
        }
#endif
        (void)esp32_mquickjs_wifi_vendor_ie_broker_reset(s_radio.generation);
        if (wifi_radio_raw_tx_recovery_exact_locked(&s_radio.lifecycle) &&
            s_tx_rate_lease.identity == s_raw_tx_recovery.operation.radio_lease_identity &&
            s_tx_rate_lease.generation == s_raw_tx_recovery.operation.generation)
            memset(&s_tx_rate_lease, 0, sizeof(s_tx_rate_lease));
        esp32_mquickjs_wifi_tx_rate_invalidate(&s_tx_rates);
        esp32_mquickjs_wifi_policy_invalidate(&s_policies);
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_RESPONDER_SUPPORT && CONFIG_ESP_WIFI_SOFTAP_SUPPORT
        esp32_mquickjs_wifi_ftm_offset_invalidate(&s_ftm_offset);
#endif
        memset(&s_inactive_history, 0, sizeof(s_inactive_history));
        memset(&s_scan_parameters, 0, sizeof(s_scan_parameters));
#if ESP32_MQUICKJS_WIFI_HE_STATISTICS_AVAILABLE
        memset(&s_he_statistics, 0, sizeof(s_he_statistics));
#endif
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
        memset(&s_twt_policy, 0, sizeof(s_twt_policy));
#endif
#endif
        taskENTER_CRITICAL(&s_radio.lock);
        s_radio.driver_owned = false;
        s_radio.storage_configured = false;
        s_radio.effective_mode = WIFI_MODE_NULL;
        taskEXIT_CRITICAL(&s_radio.lock);
    }
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    /* Successful physical deinit is recorded above before this suffix. A
     * callback still draining must not cause a second deinit on retry. */
    if (raw_tx.generation != 0U &&
        !esp32_mquickjs_wifi_raw_tx_broker_reset_after_deinit(raw_tx.generation))
        return wifi_radio_cleanup_fault("raw-tx-drain", ESP_ERR_TIMEOUT);
    if (wifi_radio_raw_tx_recovery_exact_locked(&s_radio.lifecycle) &&
        wifi_radio_promiscuous_owner(s_raw_tx_recovery.operation.radio_lease_identity) != NULL)
        return wifi_radio_cleanup_fault("raw-tx-retire", ESP_ERR_TIMEOUT);
    if (wifi_radio_action_recovery_exact_locked(&s_radio.lifecycle) && s_action.lease.acquired)
        return wifi_radio_cleanup_fault("action-retire", ESP_ERR_TIMEOUT);
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    if (wifi_radio_ftm_recovery_exact_locked(&s_radio.lifecycle) && s_ftm.lease.acquired)
        return wifi_radio_cleanup_fault("ftm-retire", ESP_ERR_TIMEOUT);
#endif
#endif
    taskENTER_CRITICAL(&s_radio.lock);
    if (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED) {
        /* Identity is boot-scoped. Never recycle it, even after driver reset. */
        if (s_radio.generation == UINT32_MAX) {
            s_radio.restart_required = true;
            s_radio.fault_stage = "generation-exhausted";
            s_radio.fault_error = ESP_ERR_INVALID_STATE;
            s_radio.driver_state = ESP32_MQUICKJS_WIFI_RADIO_FAULTED;
            taskEXIT_CRITICAL(&s_radio.lock);
            return ESP_ERR_INVALID_STATE;
        }
        s_radio.generation++;
    }
    s_radio.channel_observation_revision++;
    s_radio.channel_observation_error = ESP_OK;
    s_radio.primary_channel = 0U;
    s_radio.secondary_channel = WIFI_SECOND_CHAN_NONE;
    s_radio.fault_stage = NULL;
    s_radio.fault_error = ESP_OK;
    s_radio.cleanup_stage = NULL;
    s_radio.cleanup_error = ESP_OK;
    s_radio.driver_state = ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED;
    taskEXIT_CRITICAL(&s_radio.lock);
    return ESP_OK;
}

