99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
static esp_err_t wifi_radio_shutdown_locked(void)
{
    return wifi_radio_shutdown_lease_locked(NULL, false);
}

esp_err_t esp32_mquickjs_wifi_radio_stop(void)
{
    wifi_radio_operation_lock();
    esp_err_t err = s_radio.lifecycle.identity != 0U ? ESP_ERR_INVALID_STATE : wifi_radio_stop_locked();
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_shutdown(void)
{
    wifi_radio_operation_lock();
    esp_err_t err = s_radio.lifecycle.identity != 0U ? ESP_ERR_INVALID_STATE : wifi_radio_shutdown_locked();
    wifi_radio_operation_unlock();
    return err;
}

static esp_err_t wifi_radio_begin_lifecycle_with_dependents_locked(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    const esp32_mquickjs_wifi_radio_lease_t *dependent_station,
    const esp32_mquickjs_wifi_radio_lease_t *dependent_ap,
    esp32_mquickjs_wifi_radio_lifecycle_t *token, uint64_t eap_identity)
{
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    if (WIFI_RADIO_EAP_PENDING) {
        if (!eap_identity || eap_identity != s_eap_radio.identity ||
            s_eap_radio.generation != s_radio.generation || dependent_station || dependent_ap)
            return ESP_ERR_INVALID_STATE;
        const esp32_mquickjs_wifi_radio_lease_t *pinned[3] = {application, station, access_point};
        for (unsigned i = 0; i < 3; ++i)
            if ((pinned[i] && pinned[i]->acquired ? pinned[i]->identity : 0) != s_eap_radio.owners[i])
                return ESP_ERR_INVALID_STATE;
    } else if (eap_identity) return ESP_ERR_INVALID_STATE;
#else
    if (eap_identity) return ESP_ERR_NOT_SUPPORTED;
#endif
    if (token == NULL || token->identity != 0U) return ESP_ERR_INVALID_ARG;
    if (s_radio.wake_locks != 0 || s_radio.lifecycle.identity != 0U ||
        s_radio.operation.identity != 0U || s_radio.promiscuous_claimed) return ESP_ERR_INVALID_STATE;
    const esp32_mquickjs_wifi_radio_lease_t *owners[5] = {application, station, access_point, dependent_station, dependent_ap};
    const esp32_mquickjs_wifi_radio_client_t clients[5] = {
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION,
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA,
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP,
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_VENDOR_IE, ESP32_MQUICKJS_WIFI_RADIO_CLIENT_VENDOR_IE,
#else
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_COUNT, ESP32_MQUICKJS_WIFI_RADIO_CLIENT_COUNT,
#endif
    };
    uint32_t identities[5] = {0};
    for (size_t i = 0; i < 5; ++i) {
        if (owners[i] == NULL || !owners[i]->acquired) continue;
        if (!wifi_radio_lease_valid(owners[i]) || owners[i]->client != clients[i])
            return ESP_ERR_INVALID_STATE;
        identities[i] = owners[i]->identity;
    }
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U && s_radio.leases[i].identity != identities[0] &&
            s_radio.leases[i].identity != identities[1] && s_radio.leases[i].identity != identities[2] && s_radio.leases[i].identity != identities[3] &&
            s_radio.leases[i].identity != identities[4])
            return ESP_ERR_INVALID_STATE;
    if (s_radio.next_lifecycle_identity == 0U) return ESP_ERR_NO_MEM;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.lifecycle = (esp32_mquickjs_wifi_radio_lifecycle_t){s_radio.generation, s_radio.next_lifecycle_identity++};
    *token = s_radio.lifecycle;
    taskEXIT_CRITICAL(&s_radio.lock);
    return ESP_OK;
}

static esp_err_t wifi_radio_begin_lifecycle_locked(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    return wifi_radio_begin_lifecycle_with_dependents_locked(application, station, access_point, NULL, NULL, token, 0);
}

esp_err_t esp32_mquickjs_wifi_radio_begin_lifecycle(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_begin_lifecycle_locked(application, station, access_point, token);
    wifi_radio_operation_unlock();
    return err;
}

#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
/* Resolve the saved mode and reserve exclusive ownership under one mutex.
 * A prior status read cannot authorize restart: an intervening owner or writer
 * must be observed before admission. This does not capture or mutate the SDK. */
esp_err_t esp32_mquickjs_wifi_radio_begin_stopped_restart(
    esp32_mquickjs_wifi_radio_lifecycle_t *token,
    esp32_mquickjs_wifi_radio_restart_selection_t *selection)
{
    if (token == NULL || token->identity != 0U || token->generation != 0U || selection == NULL)
        return ESP_ERR_INVALID_ARG;
    bool allow_ap_restart = selection->allow_ap_restart;
    *selection = (esp32_mquickjs_wifi_radio_restart_selection_t){.allow_ap_restart = allow_ap_restart};
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    bool cold = s_radio.driver_state == ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED &&
        !s_radio.driver_owned && !s_radio.storage_configured && s_radio.effective_mode == WIFI_MODE_NULL;
    if ((!cold && (!s_radio.driver_owned || !s_radio.storage_configured ||
            s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED ||
            (s_radio.storage != WIFI_STORAGE_RAM && s_radio.storage != WIFI_STORAGE_FLASH))) || s_radio.started ||
        s_radio.stop_required || s_radio.stop_submitted || s_radio.restart_required ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL ||
        s_radio.event_phase != RADIO_EVENTS_IDLE || s_radio.event_live != 0U ||
        s_tx_rate_lease.identity != 0U || s_tx_rate_lease.restore_pending ||
        s_interval.owner.identity != 0U || s_interval.restore_pending ||
        s_config_restart.snapshot != NULL || s_policy_restart.owner.identity != 0U ||
        s_vendor_ie.start_owner.identity != 0U ||
        WIFI_RADIO_SMARTCONFIG_PENDING || WIFI_RADIO_WPS_PENDING || WIFI_RADIO_DPP_PENDING ||
        WIFI_RADIO_EAP_PENDING || WIFI_RADIO_NAN_PENDING || WIFI_RADIO_MESH_PENDING)
        goto done;
    wifi_mode_t saved_mode = s_radio.effective_mode;
    if (saved_mode != WIFI_MODE_NULL && saved_mode != WIFI_MODE_STA && saved_mode != WIFI_MODE_AP && saved_mode != WIFI_MODE_APSTA)
        goto done;
    bool restore_off = !cold && saved_mode == WIFI_MODE_NULL;
    if (cold || restore_off) saved_mode = WIFI_MODE_STA;
    if (restore_off) {
        bool needs_ap = s_policies.records[ESP32_MQUICKJS_WIFI_POLICY_SLOT_AP_11B].configured;
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_RESPONDER_SUPPORT && CONFIG_ESP_WIFI_SOFTAP_SUPPORT
        needs_ap |= s_ftm_offset.configured;
#endif
        if (needs_ap) {
            if (!allow_ap_restart) goto done;
            saved_mode = WIFI_MODE_APSTA;
        }
    }
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (saved_mode & WIFI_MODE_AP) { err = ESP_ERR_NOT_SUPPORTED; goto done; }
#endif
    /* NULL owner inputs require every registry slot, including Wi-Fi's own
     * Application/STA/AP leases, to be vacant. Never release an owner's lease. */
    err = wifi_radio_begin_lifecycle_locked(NULL, NULL, NULL, token);
    if (err == ESP_OK) {
        selection->mode = saved_mode;
        selection->cold = cold;
        selection->restore_off = restore_off;
    }
done:
    wifi_radio_operation_unlock();
    return err;
}

/* Resolve start defaults and admission together. A matching running driver is
 * a no-op; changing running mode/storage never implicitly stops its owners. */
esp_err_t esp32_mquickjs_wifi_radio_begin_start_lifecycle(
    esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    esp32_mquickjs_wifi_radio_configuration_selection_t *selection,
    esp32_mquickjs_wifi_radio_lifecycle_t *token, bool *already_started)
{
    if (selection == NULL || token == NULL || token->identity != 0U || already_started == NULL)
        return ESP_ERR_INVALID_ARG;
    *already_started = false;
    esp32_mquickjs_wifi_radio_configuration_selection_t resolved = *selection;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (s_radio.lifecycle.identity != 0U || s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL ||
        s_radio.restart_required || (s_radio.stop_required && !s_radio.started) ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED)) goto done;
    if (!resolved.mode_set) {
        resolved.mode = s_radio.storage_configured ? s_radio.effective_mode : WIFI_MODE_NULL;
        if (resolved.mode == WIFI_MODE_NULL) resolved.mode = WIFI_MODE_STA;
    }
    if (!resolved.storage_set)
        resolved.storage = s_radio.storage_configured ? s_radio.storage : WIFI_STORAGE_RAM;
    resolved.start = true;
    resolved.start_set = true;
    if ((resolved.mode != WIFI_MODE_STA && resolved.mode != WIFI_MODE_AP && resolved.mode != WIFI_MODE_APSTA) ||
        (resolved.storage != WIFI_STORAGE_RAM && resolved.storage != WIFI_STORAGE_FLASH) ||
        resolved.station_set || resolved.access_point_set || resolved.allow_disconnect || resolved.activate_ap) {
        err = ESP_ERR_INVALID_ARG;
        goto done;
    }
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (resolved.mode & WIFI_MODE_AP) { err = ESP_ERR_NOT_SUPPORTED; goto done; }
#endif
    if (s_radio.started) {
        if (resolved.mode != s_radio.effective_mode || resolved.storage != s_radio.storage)
            goto done;
        const esp32_mquickjs_wifi_radio_lease_t *owners[] = {application, station, access_point};
        const esp32_mquickjs_wifi_radio_client_t roles[] = {
            ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION, ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA,
            ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP,
        };
        for (size_t i = 0; i < 3; ++i)
            if (owners[i] != NULL && owners[i]->acquired &&
                (!wifi_radio_lease_valid(owners[i]) || owners[i]->client != roles[i])) goto done;
        if ((resolved.mode & WIFI_MODE_AP) &&
            (access_point == NULL || !access_point->acquired)) goto done;
        wifi_mode_t actual;
        err = esp_wifi_get_mode(&actual);
        if (err == ESP_OK && actual != resolved.mode) err = ESP_ERR_INVALID_STATE;
        if (err != ESP_OK) goto done;
        /* Anchor a Station-only driver started by another feature before
         * releasing the mutex. Otherwise its last owner could shut it down
         * between this resolution and helper allocation, changing storage. */
        if (resolved.mode == WIFI_MODE_STA && application != NULL && !application->acquired) {
            if (application->identity != 0U || application->generation != 0U ||
                s_radio.clients[ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION] != 0U) {
                err = ESP_ERR_INVALID_STATE;
                goto done;
            }
            err = wifi_radio_acquire_locked(ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION,
                                           WIFI_MODE_STA, application);
            if (err != ESP_OK) goto done;
        }
        *already_started = true;
    } else {
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
        err = wifi_radio_vendor_ie_begin_start_locked(application, station, access_point, &resolved, token);
#else
        err = wifi_radio_begin_lifecycle_locked(application, station, access_point, token);
#endif
        if (err != ESP_OK) goto done;
    }
    *selection = resolved;
    err = ESP_OK;
done:
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_begin_configuration_lifecycle(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    esp32_mquickjs_wifi_radio_configuration_selection_t *selection,
    const esp32_mquickjs_wifi_radio_config_controls_t *controls,
    const esp32_mquickjs_wifi_radio_start_controls_t *start_controls,
    esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (selection == NULL || token == NULL || token->identity != 0U)
        return ESP_ERR_INVALID_ARG;
    esp32_mquickjs_wifi_radio_configuration_selection_t resolved = *selection;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    /* Fault recovery belongs to explicit cleanup, never implicit defaults. */
    if (s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required ||
        (s_radio.stop_required && !s_radio.started) ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED)) goto done;
    if (!resolved.mode_set) {
        resolved.mode = s_radio.storage_configured ? s_radio.effective_mode : WIFI_MODE_NULL;
        if (resolved.mode == WIFI_MODE_NULL) {
            resolved.mode = (resolved.station_set ? WIFI_MODE_STA : 0) |
                (resolved.access_point_set ? WIFI_MODE_AP : 0);
            if (resolved.mode == WIFI_MODE_NULL) resolved.mode = WIFI_MODE_STA;
        }
    }
    if (!resolved.storage_set)
        resolved.storage = s_radio.storage_configured ? s_radio.storage : WIFI_STORAGE_RAM;
    if (!resolved.start_set) resolved.start = s_radio.storage_configured ? s_radio.started : true;
    err = ESP_ERR_INVALID_ARG;
    if (resolved.activate_ap) {
        /* Resolve under the same mutex as exact-owner admission. A status
         * sample before this lock must not decide which interface to remove.
         * This adapter never writes the saved Station configuration. */
        if (resolved.mode_set || resolved.storage_set || resolved.station_set ||
            !resolved.access_point_set || !resolved.allow_disconnect ||
            !resolved.start_set || !resolved.start || resolved.start_only ||
            controls != NULL || start_controls != NULL ||
            (resolved.mode != WIFI_MODE_STA && resolved.mode != WIFI_MODE_AP && resolved.mode != WIFI_MODE_APSTA))
            goto done;
        resolved.mode |= WIFI_MODE_AP;
    }
    if ((resolved.mode != WIFI_MODE_STA && resolved.mode != WIFI_MODE_AP && resolved.mode != WIFI_MODE_APSTA) ||
        (resolved.storage != WIFI_STORAGE_RAM && resolved.storage != WIFI_STORAGE_FLASH) ||
        (resolved.station_set && !(resolved.mode & WIFI_MODE_STA)) ||
        (resolved.access_point_set && !(resolved.mode & WIFI_MODE_AP)) ||
        (resolved.start && (resolved.mode & WIFI_MODE_AP) && !resolved.access_point_set)) goto done;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (resolved.mode & WIFI_MODE_AP) { err = ESP_ERR_NOT_SUPPORTED; goto done; }
#endif
    err = esp32_mquickjs_wifi_radio_validate_config_controls(resolved.mode, controls);
    if (err != ESP_OK) goto done;
    err = esp32_mquickjs_wifi_radio_validate_start_controls(resolved.start, start_controls);
    if (err != ESP_OK) goto done;
    /* A zero-client snapshot cannot exclude association before STOP. Require
     * explicit permission whenever the old running mode contains AP. The Radio
     * mutex serializes mode, admission and token publication, not peer traffic. */
    if (!resolved.allow_disconnect && s_radio.started && (s_radio.effective_mode & WIFI_MODE_AP)) {
        err = ESP_ERR_INVALID_STATE;
        goto done;
    }
    err = wifi_radio_begin_lifecycle_locked(application, station, access_point, token);
    if (err == ESP_OK) *selection = resolved;
done:
    wifi_radio_operation_unlock();
    return err;
}
#endif

/* Remove AP while retaining the same live Station/Application identities.
 * All callbacks/netifs stay attached until the AP_STOP event and marker finish. */
esp_err_t esp32_mquickjs_wifi_radio_begin_ap_stop(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (token == NULL || token->identity != 0U || station == NULL || access_point == NULL ||
        !station->acquired || !access_point->acquired) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.started || !s_radio.driver_owned || !s_radio.storage_configured ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED ||
        s_radio.effective_mode != WIFI_MODE_APSTA || s_radio.fault_stage != NULL ||
        s_radio.cleanup_stage != NULL || s_radio.restart_required || s_radio.ap_stop_phase != AP_STOP_IDLE)
        goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        if ((s_radio.leases[i].identity == station->identity &&
             s_radio.leases[i].required_mode != WIFI_MODE_STA) ||
            (s_radio.leases[i].identity == access_point->identity &&
             s_radio.leases[i].required_mode != WIFI_MODE_AP)) goto done;
    }
    err = wifi_radio_begin_lifecycle_locked(application, station, access_point, token);
    if (err != ESP_OK) goto done;
    s_radio.ap_transition_application = application != NULL && application->acquired ? application->identity : 0;
    s_radio.ap_transition_station = station->identity;
    s_radio.ap_transition_access_point = access_point->identity;
    s_radio.ap_stop_error = ESP_OK;
    s_radio.ap_stop_phase = AP_STOP_READY;
done:
    wifi_radio_operation_unlock();
    return err;
}

static bool wifi_radio_ap_transition_valid(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (token == NULL || token->identity == 0U || token->identity != s_radio.lifecycle.identity ||
        token->generation != s_radio.lifecycle.generation)
        return false;
    const uint32_t identities[] = {s_radio.ap_transition_application, s_radio.ap_transition_station, s_radio.ap_transition_access_point};
    const esp32_mquickjs_wifi_radio_client_t clients[] = {
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION, ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA,
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP,
    };
    for (size_t i = 0; i < 3; ++i) {
        if (i == 0 && identities[i] == 0U) continue;
        esp32_mquickjs_wifi_radio_lease_t owner = {token->generation, identities[i], clients[i], true};
        if (!wifi_radio_lease_valid(&owner)) return false;
    }
    return true;
}

static bool wifi_radio_ap_stop_valid(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    return s_radio.ap_stop_phase != AP_STOP_IDLE && wifi_radio_ap_transition_valid(token);
}

static bool wifi_radio_interfaces_live(wifi_mode_t mode)
{
    taskENTER_CRITICAL(&s_radio.lock);
    bool live = s_radio.event_live == mode;
    taskEXIT_CRITICAL(&s_radio.lock);
    return live;
}

