99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_SOFTAP_SUPPORT
static bool wifi_radio_ap_prestart_config_matches(const wifi_config_t *requested, const wifi_config_t *actual)
{
    return esp32_mquickjs_wifi_radio_accept_ap_config(requested, actual) &&
        (requested->ap.channel == 0 || requested->ap.channel == actual->ap.channel) &&
        requested->ap.ssid_hidden == actual->ap.ssid_hidden &&
        requested->ap.max_connection == actual->ap.max_connection &&
        requested->ap.beacon_interval == actual->ap.beacon_interval &&
        requested->ap.csa_count == actual->ap.csa_count && requested->ap.dtim_period == actual->ap.dtim_period &&
        requested->ap.ftm_responder == actual->ap.ftm_responder;
}

static bool wifi_radio_ap_reopen_config_matches(const wifi_config_t *requested, const wifi_config_t *actual)
{
    return wifi_radio_ap_prestart_config_matches(requested, actual) && requested->ap.channel == actual->ap.channel;
}
#endif

/* The SDK public setter rejects inactive AP. Different configurations use the
 * guarded native mode-change window before AP allocation and AP start.
 * Matching configurations retain their existing mutation-free capture path. */
esp_err_t esp32_mquickjs_wifi_radio_begin_ap_reopen(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const wifi_config_t *requested,
    esp32_mquickjs_wifi_radio_lease_t *access_point,
    esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
#if !CONFIG_ESP32_MQUICKJS_FEATURE_WIFI || !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    (void)application; (void)station; (void)requested; (void)access_point; (void)token;
    return ESP_ERR_NOT_SUPPORTED;
#else
    if (requested == NULL || token == NULL || token->identity != 0U ||
        station == NULL || !station->acquired || access_point == NULL ||
        access_point->acquired || access_point->identity != 0U || access_point->generation != 0U)
        return ESP_ERR_INVALID_ARG;
    esp_err_t err = esp32_mquickjs_wifi_radio_validate_ap_config(requested);
    if (err != ESP_OK) return err;
    wifi_radio_operation_lock();
    wifi_config_t *stored = NULL;
    err = ESP_ERR_INVALID_STATE;
    if (!s_radio.started || !s_radio.driver_owned || !s_radio.storage_configured ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED ||
        s_radio.effective_mode != WIFI_MODE_STA || !wifi_radio_interfaces_live(WIFI_MODE_STA) ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required ||
        s_radio.ap_stop_phase != AP_STOP_IDLE || s_radio.ap_reopen_pending) goto done;
    if (!wifi_radio_lease_valid(station) || station->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA)
        goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity == station->identity && s_radio.leases[i].required_mode != WIFI_MODE_STA)
            goto done;
    /* Claim the existing owners first; all following failures before AP owner
     * publication have no driver mutations and can release this reservation. */
    err = wifi_radio_begin_lifecycle_locked(application, station, NULL, token);
    if (err != ESP_OK) goto done;
    if (s_radio.next_lease_identity == 0U) { err = ESP_ERR_NO_MEM; goto release_token; }
    stored = esp32_mquickjs_memory_wireless_calloc("wifi.radio", 1, sizeof(*stored), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (stored == NULL) { err = ESP_ERR_NO_MEM; goto release_token; }
    wifi_mode_t mode;
    err = esp_wifi_get_mode(&mode);
    if (err == ESP_OK && mode != WIFI_MODE_STA) err = ESP_ERR_INVALID_STATE;
    if (err == ESP_OK && requested->ap.channel != 0)
        err = wifi_radio_validate_regulatory_channel(requested->ap.channel);
    if (err == ESP_OK) err = esp_wifi_get_config(WIFI_IF_AP, stored);
    if (err == ESP_OK && !wifi_radio_ap_reopen_config_matches(requested, stored)) {
#if ESP32_MQUICKJS_WIFI_AP_PRESTART_AVAILABLE
        err = esp32_mquickjs_wifi_ap_prestart_prepare(token->generation, token->identity, requested, stored,
            wifi_radio_ap_prestart_config_matches);
        if (err == ESP_OK) s_radio.ap_reopen_config_pending = true;
#else
        err = ESP_ERR_NOT_SUPPORTED;
#endif
    }
    if (err != ESP_OK) goto release_token;
    err = wifi_radio_acquire_locked(ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP, WIFI_MODE_AP, access_point);
    if (err != ESP_OK) goto release_token;
    s_radio.ap_transition_application = application != NULL && application->acquired ? application->identity : 0;
    s_radio.ap_transition_station = station->identity;
    s_radio.ap_transition_access_point = access_point->identity;
    s_radio.ap_reopen_pending = true;
    s_radio.ap_reopen_attempted = false;
    s_radio.ap_reopen_quiesced = s_radio.ap_reopen_restore_complete = false;
    goto done;
release_token:
#if ESP32_MQUICKJS_WIFI_AP_PRESTART_AVAILABLE
    if (s_radio.ap_reopen_config_pending) {
        esp_err_t released = esp32_mquickjs_wifi_ap_prestart_release(token->generation, token->identity);
        if (released) { err = wifi_radio_cleanup_fault("ap-prestart-release", released); goto done; }
        s_radio.ap_reopen_config_pending = false;
    }
#endif
    taskENTER_CRITICAL(&s_radio.lock);
    memset(&s_radio.lifecycle, 0, sizeof(s_radio.lifecycle));
    memset(token, 0, sizeof(*token));
    taskEXIT_CRITICAL(&s_radio.lock);
done:
    if (stored != NULL) {
        esp32_mquickjs_wireless_secure_zero(stored, sizeof(*stored));
        esp32_mquickjs_memory_payload_free(stored);
    }
    wifi_radio_operation_unlock();
    return err;
#endif
}

esp_err_t esp32_mquickjs_wifi_radio_check_ap_reopen(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    bool valid = s_radio.ap_reopen_pending && !s_radio.ap_reopen_attempted &&
        wifi_radio_ap_transition_valid(token) && s_radio.started &&
        s_radio.effective_mode == WIFI_MODE_STA && wifi_radio_interfaces_live(WIFI_MODE_STA);
    wifi_radio_operation_unlock();
    return valid ? ESP_OK : ESP_ERR_INVALID_STATE;
}

/* AP netif/handlers must already be attached. A failed activation is never
 * replayed; the caller must transfer this exact token to AP removal/cleanup. */
esp_err_t esp32_mquickjs_wifi_radio_finish_ap_reopen(
    esp32_mquickjs_wifi_radio_lifecycle_t *token, uint8_t *primary)
{
    if (primary == NULL) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    const char *stage = "ap-reopen-state";
    if (!s_radio.ap_reopen_pending || s_radio.ap_reopen_attempted ||
        !wifi_radio_ap_transition_valid(token)) goto done;
    if (!s_radio.started || s_radio.effective_mode != WIFI_MODE_STA || !wifi_radio_interfaces_live(WIFI_MODE_STA))
        goto failed;
    stage = "ap-reopen-events";
    err = wifi_radio_begin_events(RADIO_EVENTS_AP_START, WIFI_MODE_AP);
    if (err != ESP_OK) goto failed;
    s_radio.ap_reopen_attempted = true;
    stage = "ap-reopen-mode";
#if ESP32_MQUICKJS_WIFI_AP_PRESTART_AVAILABLE
    if (s_radio.ap_reopen_config_pending) {
        esp32_mquickjs_wifi_ap_prestart_result_t prepared;
        err = esp32_mquickjs_wifi_ap_prestart_activate(token->generation, token->identity, &prepared);
        s_radio.ap_reopen_quiesced = prepared.returned && prepared.ap_quiesced;
        s_radio.ap_reopen_restore_complete = s_radio.ap_reopen_quiesced &&
            (!prepared.mutated || (prepared.rollback_complete && s_radio.storage == WIFI_STORAGE_RAM));
        s_radio.configuration = (esp32_mquickjs_wifi_radio_config_result_t){
            .error = err, .stage = prepared.stage, .mutation_attempted = prepared.mutated,
            .rollback_attempted = prepared.rollback_attempted, .rollback_complete = prepared.rollback_complete,
            .rollback_error = prepared.rollback_error,
            .rollback_stage = prepared.rollback_attempted ? "ap-prestart-rollback" : NULL,
            .persistent_mutation_possible = prepared.mutated && s_radio.storage == WIFI_STORAGE_FLASH};
        if (prepared.stage) stage = prepared.stage;
        esp_err_t released = esp32_mquickjs_wifi_ap_prestart_release(token->generation, token->identity);
        if (!released) s_radio.ap_reopen_config_pending = false;
        else {
            s_radio.ap_reopen_restore_complete = false;
            if (!err) { err = released; stage = "ap-prestart-release"; }
        }
    } else
#endif
    err = esp_wifi_set_mode(WIFI_MODE_APSTA);
    if (err != ESP_OK) goto failed;
    stage = "ap-reopen-events";
    err = wifi_radio_wait_events();
    if (err != ESP_OK) goto failed;
    stage = "ap-reopen-mode-readback";
    wifi_mode_t mode;
    err = esp_wifi_get_mode(&mode);
    if (err == ESP_OK && mode != WIFI_MODE_APSTA) err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) goto failed;
    stage = "ap-reopen-channel";
    uint8_t channel;
    wifi_second_chan_t secondary;
    uint32_t generation;
    err = wifi_radio_refresh_channel(&channel, &secondary, &generation);
    if (err != ESP_OK) goto failed;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    stage = "ap-reopen-inactive-restore";
    err = wifi_radio_restore_inactive_locked(mode);
    if (err != ESP_OK) goto failed;
#endif
    taskENTER_CRITICAL(&s_radio.lock);
    if (s_radio.event_live != WIFI_MODE_APSTA) {
        taskEXIT_CRITICAL(&s_radio.lock);
        err = ESP_ERR_INVALID_STATE;
        goto failed;
    }
    *primary = channel;
    s_radio.effective_mode = WIFI_MODE_APSTA;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U && s_radio.leases[i].identity == s_radio.ap_transition_application)
            s_radio.leases[i].required_mode = WIFI_MODE_APSTA;
    s_radio.ap_reopen_pending = s_radio.ap_reopen_attempted = false;
    s_radio.ap_reopen_quiesced = s_radio.ap_reopen_restore_complete = false;
    s_radio.ap_transition_application = s_radio.ap_transition_station = s_radio.ap_transition_access_point = 0;
    memset(&s_radio.lifecycle, 0, sizeof(s_radio.lifecycle));
    memset(token, 0, sizeof(*token));
    taskEXIT_CRITICAL(&s_radio.lock);
    err = ESP_OK;
    goto done;
failed:
    err = wifi_radio_cleanup_fault(stage, err);
done:
    wifi_radio_operation_unlock();
    return err;
}

