99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
/* A rejected pre-create transaction can retire its AP netif after native AP
 * absence and an event fence, without waiting for an AP_STOP that cannot occur.
 * Once native AP start was allowed, normal AP_STOP must prove termination. */
esp_err_t esp32_mquickjs_wifi_radio_abort_ap_reopen(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (s_radio.ap_reopen_pending && wifi_radio_ap_transition_valid(token)) {
#if ESP32_MQUICKJS_WIFI_AP_PRESTART_AVAILABLE
        if (s_radio.ap_reopen_config_pending) {
            err = esp32_mquickjs_wifi_ap_prestart_release(token->generation, token->identity);
            if (err) { wifi_radio_operation_unlock(); return err; }
            s_radio.ap_reopen_config_pending = false;
        }
#endif
        if (s_radio.ap_reopen_quiesced) {
            err = wifi_radio_begin_events(RADIO_EVENTS_AP_STOP, WIFI_MODE_NULL);
            if (err != ESP_OK) { wifi_radio_operation_unlock(); return err; }
            s_radio.ap_stop_phase = AP_STOP_SUBMITTED;
        } else s_radio.ap_stop_phase = s_radio.ap_reopen_attempted ? AP_STOP_READY : AP_STOP_QUIESCED;
        s_radio.ap_stop_error = ESP_OK;
        s_radio.ap_reopen_pending = s_radio.ap_reopen_attempted = false;
        err = ESP_OK;
    }
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_quiesce_ap_lifecycle(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    const char *stage = "ap-stop-state";
    if (!wifi_radio_ap_stop_valid(token)) goto done;
    if (s_radio.ap_stop_phase == AP_STOP_QUIESCED) { err = ESP_OK; goto done; }
    if (!s_radio.started || s_radio.restart_required) goto failed;
    wifi_mode_t mode;
    if (s_radio.ap_stop_phase == AP_STOP_READY) {
        stage = "ap-stop-mode-snapshot";
        err = esp_wifi_get_mode(&mode);
        if (err != ESP_OK) goto failed;
        if (mode != WIFI_MODE_APSTA) { err = ESP_ERR_INVALID_STATE; goto failed; }
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
        /* Once AP is disabled its getter is unavailable. A read failure must
         * not prevent closing the interface; keep it as unavailable history. */
        uint16_t inactive = 0;
        esp_err_t observed = esp_wifi_get_inactive_time(WIFI_IF_AP, &inactive);
        wifi_radio_inactive_history_record(1, inactive, observed);
#endif
        stage = "ap-stop-events";
        err = wifi_radio_begin_events(RADIO_EVENTS_AP_STOP, WIFI_MODE_AP);
        if (err != ESP_OK) goto failed;
        stage = "ap-stop-mode";
        s_radio.ap_stop_phase = AP_STOP_ATTEMPTED;
        err = esp_wifi_set_mode(WIFI_MODE_STA);
        s_radio.ap_stop_error = err;
        if (err != ESP_OK) goto failed;
        s_radio.ap_stop_phase = AP_STOP_SUBMITTED;
    }
    if (s_radio.ap_stop_phase == AP_STOP_ATTEMPTED) {
        /* A failed setter may already have changed mode. A retry observes it;
         * never replay an uncertain mutation. If APSTA remains, explicit whole
         * cleanup after the Station exits is required. */
        stage = "ap-stop-mode-readback";
        err = esp_wifi_get_mode(&mode);
        if (err != ESP_OK) goto failed;
        if (mode != WIFI_MODE_STA) {
            err = s_radio.ap_stop_error != ESP_OK ? s_radio.ap_stop_error : ESP_ERR_INVALID_RESPONSE;
            goto failed;
        }
        s_radio.ap_stop_phase = AP_STOP_SUBMITTED;
    }
    if (s_radio.ap_stop_phase == AP_STOP_SUBMITTED) {
        stage = "ap-stop-events";
        err = wifi_radio_wait_events();
        if (err != ESP_OK) goto failed;
        s_radio.ap_stop_phase = AP_STOP_EVENTS_DONE;
    }
    stage = "ap-stop-mode-readback";
    err = esp_wifi_get_mode(&mode);
    if (err != ESP_OK) goto failed;
    if (mode != WIFI_MODE_STA) { err = ESP_ERR_INVALID_RESPONSE; goto failed; }
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.effective_mode = WIFI_MODE_STA;
    s_radio.ap_stop_phase = AP_STOP_QUIESCED;
    taskEXIT_CRITICAL(&s_radio.lock);
    err = ESP_OK;
    goto done;
failed:
    err = wifi_radio_cleanup_fault(stage, err);
done:
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_adopt_ap_stop(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (wifi_radio_ap_stop_valid(token)) {
        s_radio.ap_stop_phase = AP_STOP_IDLE;
        s_radio.ap_reopen_pending = s_radio.ap_reopen_attempted = false;
        s_radio.ap_reopen_quiesced = s_radio.ap_reopen_restore_complete = false;
        s_radio.ap_transition_application = s_radio.ap_transition_station = s_radio.ap_transition_access_point = 0;
        s_radio.ap_stop_error = ESP_OK;
        err = ESP_OK;
    }
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_check_ap_stopped_lifecycle(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    bool valid = wifi_radio_ap_stop_valid(token);
    taskENTER_CRITICAL(&s_radio.lock);
    valid = valid && s_radio.ap_stop_phase == AP_STOP_QUIESCED && s_radio.started &&
        s_radio.effective_mode == WIFI_MODE_STA && s_radio.event_live == WIFI_MODE_STA;
    taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return valid ? ESP_OK : ESP_ERR_INVALID_STATE;
}

/* Caller has retired only the AP netif. Do not stop the remaining driver or
 * touch Station helper/IP state; reduce Application's APSTA requirement to STA. */
esp_err_t esp32_mquickjs_wifi_radio_finish_ap_stop(
    esp32_mquickjs_wifi_radio_lifecycle_t *token,
    esp32_mquickjs_wifi_radio_lease_t *access_point)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_ap_stop_valid(token) || access_point == NULL ||
        !wifi_radio_lease_valid(access_point) || access_point->identity != s_radio.ap_transition_access_point ||
        access_point->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP ||
        s_radio.ap_stop_phase != AP_STOP_QUIESCED || !s_radio.started) goto done;
    taskENTER_CRITICAL(&s_radio.lock);
    bool station_live = s_radio.event_live == WIFI_MODE_STA && s_radio.effective_mode == WIFI_MODE_STA;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (!station_live) goto done;
    wifi_radio_release_locked(access_point);
    if (access_point->acquired) goto done;
    taskENTER_CRITICAL(&s_radio.lock);
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U && s_radio.leases[i].identity == s_radio.ap_transition_application)
            s_radio.leases[i].required_mode = WIFI_MODE_STA;
    if (s_radio.fault_stage != NULL && (strncmp(s_radio.fault_stage, "ap-stop-", 8) == 0 ||
        (s_radio.ap_reopen_restore_complete && strncmp(s_radio.fault_stage, "ap-prestart-", 12) == 0))) {
        s_radio.fault_stage = NULL;
        s_radio.fault_error = ESP_OK;
    }
    if (s_radio.cleanup_stage != NULL && (strncmp(s_radio.cleanup_stage, "ap-stop-", 8) == 0 ||
        (s_radio.ap_reopen_restore_complete && strncmp(s_radio.cleanup_stage, "ap-prestart-", 12) == 0))) {
        s_radio.cleanup_stage = NULL;
        s_radio.cleanup_error = ESP_OK;
    }
    s_radio.driver_state = s_radio.fault_stage == NULL ? ESP32_MQUICKJS_WIFI_RADIO_STARTED : ESP32_MQUICKJS_WIFI_RADIO_FAULTED;
    s_radio.ap_stop_phase = AP_STOP_IDLE;
    s_radio.ap_reopen_pending = s_radio.ap_reopen_attempted = false;
    s_radio.ap_reopen_quiesced = s_radio.ap_reopen_restore_complete = false;
    s_radio.ap_transition_application = s_radio.ap_transition_station = s_radio.ap_transition_access_point = 0;
    s_radio.ap_stop_error = ESP_OK;
    memset(&s_radio.lifecycle, 0, sizeof(s_radio.lifecycle));
    memset(token, 0, sizeof(*token));
    taskEXIT_CRITICAL(&s_radio.lock);
    err = ESP_OK;
done:
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_quiesce_lifecycle(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (token == NULL || token->identity == 0U) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (token->identity == s_radio.lifecycle.identity && token->generation == s_radio.lifecycle.generation)
        err = wifi_radio_stop_locked();
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_finish_lifecycle(
    esp32_mquickjs_wifi_radio_lifecycle_t *token, bool shutdown)
{
    if (token == NULL || token->identity == 0U) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (WIFI_RADIO_MESH_PENDING) goto done;
    if (token->identity != s_radio.lifecycle.identity || token->generation != s_radio.lifecycle.generation) goto done;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    if (s_vendor_ie.start_owner.identity != 0U) goto done;
#endif
    err = shutdown ? wifi_radio_shutdown_locked() : wifi_radio_stop_locked();
    if (err == ESP_OK) {
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
        wifi_radio_restart_configs_discard_locked(token);
        if (s_policy_restart.owner.identity == token->identity &&
            s_policy_restart.owner.generation == token->generation)
            memset(&s_policy_restart, 0, sizeof(s_policy_restart));
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
        if (wifi_radio_twt_recovery_exact_locked(token)) memset(&s_twt_recovery, 0, sizeof(s_twt_recovery));
#endif
        taskENTER_CRITICAL(&s_radio.lock);
        memset(&s_radio.lifecycle, 0, sizeof(s_radio.lifecycle));
        taskEXIT_CRITICAL(&s_radio.lock);
        memset(token, 0, sizeof(*token));
    }
done:
    wifi_radio_operation_unlock();
    return err;
}

