99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
static esp_err_t wifi_radio_check_stopped_lifecycle_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, bool cleanup)
{
    if (token == NULL || token->identity == 0U) return ESP_ERR_INVALID_ARG;
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (token->identity != s_radio.lifecycle.identity || token->generation != s_radio.lifecycle.generation ||
        s_radio.started || s_radio.stop_required || s_radio.operation.identity != 0U ||
        s_radio.wake_locks != 0 || s_radio.promiscuous_claimed ||
        s_radio.restart_required || (!cleanup && (s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL)) ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED &&
         !(cleanup && (s_radio.driver_state == ESP32_MQUICKJS_WIFI_RADIO_FAULTED ||
                       s_radio.driver_state == ESP32_MQUICKJS_WIFI_RADIO_CLEANUP_PENDING)))) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
    err = ESP_OK;
done:
    return err;
}


esp_err_t esp32_mquickjs_wifi_radio_check_stopped_lifecycle(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, bool cleanup)
{
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_check_stopped_lifecycle_locked(token, cleanup);
    wifi_radio_operation_unlock();
    return err;
}

#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
/* SDK get_config returns a dormant SAE default even for a non-SAE AP. This
 * caller-owned snapshot must retain its exact bytes; validate active policy
 * with the existing input validator, then put the inert SDK field back. */
static esp_err_t wifi_radio_validate_saved_ap_config(wifi_config_t *config)
{
    wifi_sae_pwe_method_t saved_pwe = config->ap.sae_pwe_h2e;
    bool sae = config->ap.authmode == WIFI_AUTH_WPA3_PSK ||
        config->ap.authmode == WIFI_AUTH_WPA2_WPA3_PSK || config->ap.wpa3_compatible_mode;
    if (!sae && (saved_pwe == WPA3_SAE_PWE_HUNT_AND_PECK ||
        saved_pwe == WPA3_SAE_PWE_HASH_TO_ELEMENT || saved_pwe == WPA3_SAE_PWE_BOTH))
        config->ap.sae_pwe_h2e = WPA3_SAE_PWE_UNSPECIFIED;
    esp_err_t error = esp32_mquickjs_wifi_radio_validate_ap_config(config);
    config->ap.sae_pwe_h2e = saved_pwe;
    return error;
}

/* Caller owns secure temporary output; never expose these credentials to JS. */
esp_err_t esp32_mquickjs_wifi_radio_copy_stopped_ap_configuration(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_config_t *config)
{
    if (config == NULL) return ESP_ERR_INVALID_ARG;
    memset(config, 0, sizeof(*config));
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_check_stopped_lifecycle_locked(token, false);
    if (err == ESP_OK && (!s_radio.driver_owned || !s_radio.storage_configured)) err = ESP_ERR_INVALID_STATE;
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (err == ESP_OK) err = esp_wifi_get_config(WIFI_IF_AP, config);
    if (err == ESP_OK) err = wifi_radio_validate_saved_ap_config(config);
    if (err == ESP_OK && config->ap.channel != 0) err = wifi_radio_validate_regulatory_channel(config->ap.channel);
#else
    if (err == ESP_OK) err = ESP_ERR_NOT_SUPPORTED;
#endif
    if (err != ESP_OK) esp32_mquickjs_wireless_secure_zero(config, sizeof(*config));
    wifi_radio_operation_unlock();
    return err;
}
#endif

esp_err_t esp32_mquickjs_wifi_radio_validate_start_controls(bool start,
    const esp32_mquickjs_wifi_radio_start_controls_t *controls)
{
    if (controls == NULL || !controls->tx_power_set) return ESP_OK;
    return start && controls->tx_power_quarter_dbm >= 8 && controls->tx_power_quarter_dbm <= 80
        ? ESP_OK : ESP_ERR_INVALID_ARG;
}

/* Native START/events/mode have completed, the exact lifecycle and staged
 * leases still exclude all other mutation. No JS roots or input are retained. */
static esp_err_t wifi_radio_apply_start_controls(
    const esp32_mquickjs_wifi_radio_start_controls_t *controls)
{
    if (controls == NULL || !controls->tx_power_set) return ESP_OK;
    esp32_mquickjs_wifi_radio_config_result_t result = {.stage = "tx-power-snapshot"};
    int8_t before, actual;
    esp_err_t err = esp_wifi_get_max_tx_power(&before);
    if (err == ESP_OK && (before < 8 || before > 80)) err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) goto record;
    result.stage = "tx-power-config";
    result.mutation_attempted = true;
    err = esp_wifi_set_max_tx_power(controls->tx_power_quarter_dbm);
    if (err != ESP_OK) goto rollback;
    result.stage = "tx-power-readback";
    err = esp_wifi_get_max_tx_power(&actual);
    /* The SDK quantizes/clamps power. Accept a valid lower ceiling, never a
     * value above the request. Actual power is available in radio status. */
    if (err == ESP_OK && (actual < 8 || actual > controls->tx_power_quarter_dbm))
        err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) goto rollback;
    result.stage = "complete";
    goto record;
rollback:
    result.rollback_attempted = true;
    result.rollback_stage = "rollback-tx-power";
    result.rollback_error = esp_wifi_set_max_tx_power(before);
    if (result.rollback_error != ESP_OK) goto record;
    result.rollback_stage = "rollback-tx-power-readback";
    result.rollback_error = esp_wifi_get_max_tx_power(&actual);
    if (result.rollback_error == ESP_OK && actual != before)
        result.rollback_error = ESP_ERR_INVALID_RESPONSE;
    if (result.rollback_error == ESP_OK) {
        result.rollback_complete = true;
        result.rollback_stage = NULL;
    }
record:
    result.error = err;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.activation = result;
    taskEXIT_CRITICAL(&s_radio.lock);
    /* Startup has happened even if power was restored. Explicit cleanup must
     * stop/drain it; a successful scalar rollback is not lifecycle recovery. */
    if (err != ESP_OK) {
        (void)wifi_radio_record_fault(result.stage, err);
        if (result.rollback_attempted && !result.rollback_complete)
            (void)wifi_radio_cleanup_fault("activation-rollback", result.rollback_error);
    }
    return err;
}

struct esp32_mquickjs_wifi_eap_profile;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
static esp_err_t wifi_radio_eap_restart_install_locked(esp32_mquickjs_wifi_eap_profile_t *profile,
    const esp32_mquickjs_wifi_radio_lease_t owners[3]);
#endif

static esp_err_t wifi_radio_resume_lifecycle_locked(
    esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode, bool start,
    esp32_mquickjs_wifi_radio_lease_t *application,
    esp32_mquickjs_wifi_radio_lease_t *station,
    esp32_mquickjs_wifi_radio_lease_t *access_point,
    const esp32_mquickjs_wifi_radio_start_controls_t *controls, bool keep_lifecycle,
    struct esp32_mquickjs_wifi_eap_profile *enterprise_profile)
{
    if (enterprise_profile && (!start || keep_lifecycle || controls ||
        !(mode & WIFI_MODE_STA) || !application || !station)) return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP32_MQUICKJS_FEATURE_WIFI || !CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    if (enterprise_profile) return ESP_ERR_NOT_SUPPORTED;
#endif
    if (token == NULL || token->identity == 0U ||
        (mode != WIFI_MODE_STA && mode != WIFI_MODE_AP && mode != WIFI_MODE_APSTA))
        return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (mode & WIFI_MODE_AP) return ESP_ERR_NOT_SUPPORTED;
#endif
    esp_err_t validated = esp32_mquickjs_wifi_radio_validate_start_controls(start, controls);
    if (validated != ESP_OK) return validated;
    esp32_mquickjs_wifi_radio_lease_t *outputs[3] = {application, station, access_point};
    const esp32_mquickjs_wifi_radio_client_t clients[3] = {
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION,
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA,
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP,
    };
    const wifi_mode_t modes[3] = {mode, WIFI_MODE_STA, WIFI_MODE_AP};
    size_t owner_count = 0;
    wifi_mode_t required_mode = WIFI_MODE_NULL;
    for (size_t i = 0; i < 3; ++i) {
        if (outputs[i] == NULL) continue;
        if (!start || outputs[i]->acquired || outputs[i]->identity != 0U ||
            outputs[i]->generation != 0U || (modes[i] & mode) != modes[i]) return ESP_ERR_INVALID_ARG;
        for (size_t j = 0; j < i; ++j)
            if (outputs[i] == outputs[j]) return ESP_ERR_INVALID_ARG;
        owner_count++;
        required_mode = (wifi_mode_t)(required_mode | modes[i]);
    }
    if (start && (owner_count == 0 || required_mode != mode)) return ESP_ERR_INVALID_ARG;
    if (token->identity != s_radio.lifecycle.identity || token->generation != s_radio.lifecycle.generation ||
        s_radio.operation.identity != 0U || s_radio.wake_locks != 0 || s_radio.promiscuous_claimed ||
        !s_radio.driver_owned || !s_radio.storage_configured || s_radio.started || s_radio.stop_required ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL) return ESP_ERR_INVALID_STATE;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) return ESP_ERR_INVALID_STATE;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    if (!wifi_radio_restart_configs_ready_locked(token, mode)) return ESP_ERR_INVALID_STATE;
    if (keep_lifecycle && (!start || s_config_restart.snapshot == NULL ||
        !s_config_restart.snapshot->restore_off || controls != NULL)) return ESP_ERR_INVALID_STATE;
    if (!keep_lifecycle && s_config_restart.snapshot != NULL && s_config_restart.snapshot->restore_off)
        return ESP_ERR_INVALID_STATE;
    /* A restoration and a new power request are different operations. */
    if (s_config_restart.captured && controls != NULL && controls->tx_power_set) return ESP_ERR_INVALID_ARG;
#endif
    size_t dependent_count = 0;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    if (s_vendor_ie.start_owner.identity != 0U) {
        if (!start || !wifi_radio_vendor_ie_start_matches(token) || mode != s_vendor_ie.start_mode ||
            s_radio.storage != s_vendor_ie.start_storage || controls != NULL) return ESP_ERR_INVALID_STATE;
        dependent_count = wifi_radio_vendor_ie_start_count();
    }
#endif
    size_t reservation_count = owner_count + dependent_count;
    if (reservation_count > WIFI_RADIO_MAX_LEASES) return ESP_ERR_NO_MEM;
    /* Reserve identity capacity before even attempting start. UINT32_MAX is a
     * valid final identity; zero is the exhausted sentinel, never recycled. */
    if (reservation_count != 0 && (s_radio.next_lease_identity == 0U ||
        reservation_count - 1 > UINT32_MAX - s_radio.next_lease_identity)) return ESP_ERR_NO_MEM;
    wifi_mode_t actual_mode;
    esp_err_t err = esp_wifi_get_mode(&actual_mode);
    if (err == ESP_OK && actual_mode != mode) err = ESP_ERR_INVALID_STATE;
    if (err != ESP_OK) return err;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    if (start) {
        /* Final replay may include temporary START/STOP cycles. Check the
         * resulting credentials before an AP can advertise or accept clients,
         * and before consuming any staged owner identity. */
        err = wifi_radio_restart_configs_pre_start_locked(token, mode);
        if (err != ESP_OK) return err;
    }
#endif
    esp32_mquickjs_wifi_radio_lease_t staged[3] = {0};
    esp32_mquickjs_wifi_radio_lease_t *start_lease = NULL;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    err = wifi_radio_vendor_ie_start_attach(token);
    if (err != ESP_OK) goto fail;
#endif
    for (size_t i = 0; i < 3; ++i) {
        if (outputs[i] == NULL) continue;
        err = wifi_radio_acquire_locked(clients[i], modes[i], &staged[i]);
        if (err != ESP_OK) goto fail;
        if (start_lease == NULL) start_lease = &staged[i];
    }
    if (start) {
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
        err = wifi_radio_restart_configs_start_locked(token, mode, start_lease);
#else
        err = wifi_radio_ensure_started_locked(start_lease);
#endif
        if (err != ESP_OK) goto fail;
        err = esp_wifi_get_mode(&actual_mode);
        if (err == ESP_OK && actual_mode != mode) err = ESP_ERR_INVALID_RESPONSE;
        if (err != ESP_OK) {
            (void)wifi_radio_record_fault("resume-mode-readback", err);
            goto fail;
        }
    }
    if (start) {
        err = wifi_radio_apply_start_controls(controls);
        if (err != ESP_OK) goto fail;
    }
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    if (s_policy_restart.owner.identity != 0U) {
        if (!start || s_policy_restart.mode != mode) { err = ESP_ERR_INVALID_STATE; goto fail; }
        err = wifi_radio_policy_restart_replay_locked(token, true);
        if (err != ESP_OK) goto fail;
        if (s_policy_restart.completed != s_policy_restart.snapshot.mask) { err = ESP_ERR_INVALID_STATE; goto fail; }
    }
    err = wifi_radio_restart_configs_post_start_locked(token);
    if (err != ESP_OK) goto fail;
    err = wifi_radio_restart_configs_commit_locked(token, mode);
    if (err != ESP_OK) goto fail;
#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    if (enterprise_profile) {
        err = wifi_radio_eap_restart_install_locked(enterprise_profile, staged);
        if (err != ESP_OK) goto fail;
    }
#endif
    if (!keep_lifecycle) {
        wifi_radio_restart_configs_discard_locked(token);
        memset(&s_policy_restart, 0, sizeof(s_policy_restart));
    }
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    wifi_radio_vendor_ie_start_commit(token);
#endif
    /* Only now hand the leases back to the runtime. Other operations remain
     * excluded until every output is installed and the token is retired. */
    for (size_t i = 0; i < 3; ++i)
        if (outputs[i] != NULL) *outputs[i] = staged[i];
    if (keep_lifecycle) return ESP_OK;
    taskENTER_CRITICAL(&s_radio.lock);
    memset(&s_radio.lifecycle, 0, sizeof(s_radio.lifecycle));
    taskEXIT_CRITICAL(&s_radio.lock);
    memset(token, 0, sizeof(*token));
    return ESP_OK;
fail:
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    wifi_radio_vendor_ie_start_park(token);
#endif
    for (size_t i = 3; i > 0; --i) wifi_radio_release_locked(&staged[i - 1]);
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_resume_lifecycle(
    esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode, bool start,
    esp32_mquickjs_wifi_radio_lease_t *application,
    esp32_mquickjs_wifi_radio_lease_t *station,
    esp32_mquickjs_wifi_radio_lease_t *access_point,
    const esp32_mquickjs_wifi_radio_start_controls_t *controls)
{
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_resume_lifecycle_locked(token, mode, start, application, station, access_point, controls, false, NULL);
    wifi_radio_operation_unlock();
    return err;
}

