99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
esp_err_t esp32_mquickjs_wifi_radio_resume_off_restart_lifecycle(
    esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    wifi_radio_operation_lock();
    /* The one temporary native lease is never published. The reservation and
     * frozen source outlive both START verification and the final STOP fence. */
    esp32_mquickjs_wifi_radio_lease_t temporary = {0};
    esp_err_t err = wifi_radio_resume_lifecycle_locked(token, mode, true,
        &temporary, NULL, NULL, NULL, true, NULL);
    wifi_radio_release_locked(&temporary);
    if (err != ESP_OK) goto done;
    err = wifi_radio_stop_locked();
    if (err != ESP_OK) goto done;
    err = wifi_radio_check_stopped_lifecycle_locked(token, false);
    if (err != ESP_OK) goto done;
    err = esp_wifi_set_mode(WIFI_MODE_NULL);
    if (err != ESP_OK) { err = wifi_radio_record_fault("restart-off-mode", err); goto done; }
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.effective_mode = WIFI_MODE_NULL;
    taskEXIT_CRITICAL(&s_radio.lock);
    wifi_mode_t actual;
    err = esp_wifi_get_mode(&actual);
    if (err == ESP_OK && actual != WIFI_MODE_NULL) err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) { err = wifi_radio_record_fault("restart-off-mode-readback", err); goto done; }
    err = wifi_radio_restart_configs_commit_storage_locked(token);
done:
    wifi_radio_operation_unlock();
    return err;
}

/* These phases retain the lifecycle reservation while the runtime retires or
 * attaches netifs outside the Radio mutex. They do not own helper resources. */
static bool wifi_radio_restart_checkpoint_matches_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    return token != NULL && token->identity != 0U &&
        token->identity == s_radio.lifecycle.identity && token->generation == s_radio.lifecycle.generation &&
        s_config_restart.captured && s_config_restart.owner.identity == token->identity &&
        s_config_restart.owner.generation == token->generation && s_config_restart.mode == mode &&
        s_policy_restart.owner.identity == token->identity &&
        s_policy_restart.owner.generation == token->generation && s_policy_restart.mode == mode;
}

esp_err_t esp32_mquickjs_wifi_radio_admit_restart_retry(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token,
    esp32_mquickjs_wifi_radio_restart_selection_t *selection)
{
    if (token == NULL || token->identity == 0U || selection == NULL) return ESP_ERR_INVALID_ARG;
    bool allow_ap_restart = selection->allow_ap_restart;
    *selection = (esp32_mquickjs_wifi_radio_restart_selection_t){.allow_ap_restart = allow_ap_restart};
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    wifi_mode_t mode = s_config_restart.mode;
    if (!wifi_radio_restart_checkpoint_matches_locked(token, mode) ||
        (mode != WIFI_MODE_STA && mode != WIFI_MODE_AP && mode != WIFI_MODE_APSTA) ||
        s_config_restart.source_generation == 0U ||
        (s_config_restart.snapshot != NULL && s_config_restart.snapshot->capture_error != ESP_OK) ||
        s_radio.restart_required || s_radio.operation.identity != 0U || s_radio.wake_locks != 0U ||
        s_radio.promiscuous_claimed || s_tx_rate_lease.identity != 0U || s_tx_rate_lease.restore_pending ||
        s_interval.owner.identity != 0U || s_interval.restore_pending || s_vendor_ie.start_owner.identity != 0U ||
        WIFI_RADIO_SMARTCONFIG_PENDING || WIFI_RADIO_WPS_PENDING || WIFI_RADIO_DPP_PENDING ||
        WIFI_RADIO_EAP_PENDING || WIFI_RADIO_NAN_PENDING || WIFI_RADIO_MESH_PENDING ||
        wifi_radio_raw_tx_recovery_exact_locked(token) || wifi_radio_action_recovery_exact_locked(token)) goto done;
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    if (wifi_radio_ftm_recovery_exact_locked(token)) goto done;
#endif
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    if (wifi_radio_twt_recovery_exact_locked(token)) goto done;
#endif
    if (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED &&
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED &&
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED &&
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_FAULTED &&
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_CLEANUP_PENDING) goto done;
    if ((!s_radio.driver_owned && (s_radio.started || s_radio.stop_required || s_radio.storage_configured)) ||
        (s_radio.driver_owned && s_radio.driver_state == ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED)) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
    bool restore_off = s_config_restart.snapshot != NULL && s_config_restart.snapshot->restore_off;
    if (restore_off && (mode & WIFI_MODE_AP) && !allow_ap_restart) goto done;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (mode & WIFI_MODE_AP) { err = ESP_ERR_NOT_SUPPORTED; goto done; }
#endif
    size_t owners = restore_off || mode == WIFI_MODE_AP ? 1U : mode == WIFI_MODE_STA ? 2U : 3U;
    if (s_radio.next_lease_identity == 0U || owners - 1U > UINT32_MAX - s_radio.next_lease_identity) {
        err = ESP_ERR_NO_MEM;
        goto done;
    }
    /* Faults stay visible through STOP/helper retirement. Only successful
     * physical shutdown can clear them. No uncertain current state is read as
     * a replacement for the predecessor captured by this exact lifecycle. */
    selection->mode = mode;
    selection->cold = s_config_restart.snapshot == NULL;
    selection->restore_off = restore_off;
    /* No configuration step of this new call has run yet. A STOP/helper/init
     * error must not expose the previous attempt's configuration result. */
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.configuration = (esp32_mquickjs_wifi_radio_config_result_t){0};
    taskEXIT_CRITICAL(&s_radio.lock);
    err = ESP_OK;
done:
    wifi_radio_operation_unlock();
    return err;
}

static esp_err_t wifi_radio_checkpoint_restart_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    if (s_vendor_ie.start_owner.identity != 0U) return ESP_ERR_INVALID_STATE;
    if (token == NULL || token->identity == 0U ||
        (mode != WIFI_MODE_STA && mode != WIFI_MODE_AP && mode != WIFI_MODE_APSTA)) return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (mode & WIFI_MODE_AP) return ESP_ERR_NOT_SUPPORTED;
#endif
    /* A rebuilt generation must keep its frozen predecessor, never treat the
     * new driver as another source checkpoint. Cleanup/rebuild is explicit. */
    if ((s_config_restart.captured || s_config_restart.snapshot != NULL) &&
        s_config_restart.source_generation != s_radio.generation) return ESP_ERR_INVALID_STATE;
    esp_err_t err = wifi_radio_policy_restart_prepare_locked(token, mode);
    if (err != ESP_OK) {
        taskENTER_CRITICAL(&s_radio.lock);
        s_radio.configuration = (esp32_mquickjs_wifi_radio_config_result_t){
            .stage = "restart-policy-snapshot", .error = err};
        taskEXIT_CRITICAL(&s_radio.lock);
        return err;
    }
    err = wifi_radio_restart_configs_capture_locked(token, mode);
    if (err != ESP_OK) return err;
    /* Capture may itself need START/STOP cycles to read an inactive band.
     * Only a completed final STOP permits old helper/netif retirement. */
    err = wifi_radio_stop_locked();
    if (err != ESP_OK) return err;
    return wifi_radio_check_stopped_lifecycle_locked(token, false);
}

