99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_checkpoint_restart_lifecycle(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    wifi_radio_operation_lock();
    /* Public execution details must never reuse a previous operation's config
     * result when this checkpoint rejects before reaching the capture helper. */
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.configuration = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "restart-checkpoint-admission"};
    taskEXIT_CRITICAL(&s_radio.lock);
    esp_err_t err = wifi_radio_checkpoint_restart_locked(token, mode);
    if (s_radio.configuration.stage != NULL && strcmp(s_radio.configuration.stage, "restart-checkpoint-admission") == 0) {
        taskENTER_CRITICAL(&s_radio.lock);
        s_radio.configuration.error = err;
        taskEXIT_CRITICAL(&s_radio.lock);
    }
    wifi_radio_operation_unlock();
    return err;
}

static esp_err_t wifi_radio_rebuild_restart_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    if (!wifi_radio_restart_checkpoint_matches_locked(token, mode)) return ESP_ERR_INVALID_STATE;
    /* Caller must have retired old helpers. Never hide STOP here: runtime
     * callbacks/netifs must survive until STOP and their own drain complete. */
    esp_err_t err = wifi_radio_check_stopped_lifecycle_locked(token, true);
    if (err != ESP_OK) return err;
    err = wifi_radio_shutdown_locked();
    if (err != ESP_OK) return err;
    err = wifi_radio_initialize();
    if (err != ESP_OK) return err;
    return wifi_radio_check_stopped_lifecycle_locked(token, false);
}

esp_err_t esp32_mquickjs_wifi_radio_rebuild_restart_lifecycle(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_rebuild_restart_locked(token, mode);
    wifi_radio_operation_unlock();
    return err;
}

#if CONFIG_ESP_WIFI_WAPI_PSK
esp_err_t esp32_mquickjs_wifi_radio_wapi_prepare(bool enabled, bool *rebuild)
{
    if (!rebuild) return ESP_ERR_INVALID_ARG;
    *rebuild = false;
    wifi_radio_operation_lock();
    esp32_mquickjs_wifi_wapi_status_t status;
    esp32_mquickjs_wifi_wapi_sdk_status(&status);
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (status.busy || status.uncertain || s_radio.lifecycle.identity || s_radio.fault_stage ||
        s_radio.cleanup_stage || s_radio.restart_required) goto done;
    if (status.requested_enabled == enabled &&
        (!status.supplicant_active || status.enabled == enabled)) { error = ESP_OK; goto done; }
    if (s_radio.driver_state == ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED && !s_radio.driver_owned &&
        !status.supplicant_active && !s_radio.operation.identity && !s_radio.wake_locks && !s_radio.promiscuous_claimed) {
        for (unsigned i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
            if (s_radio.leases[i].identity) goto done;
        error = esp32_mquickjs_wifi_wapi_sdk_policy(enabled);
    } else if (wifi_radio_stop_snapshot_unchanged_locked()) {
        /* The runtime obtains the exact zero-owner lifecycle before changing
         * policy; this observation does not authorize a later mutation. */
        *rebuild = true; error = ESP_OK;
    }
done:
    wifi_radio_operation_unlock();
    return error;
}

esp_err_t esp32_mquickjs_wifi_radio_wapi_select(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode, bool enabled)
{
    wifi_radio_operation_lock();
    esp_err_t error = wifi_radio_restart_checkpoint_matches_locked(token, mode) ?
        wifi_radio_check_stopped_lifecycle_locked(token, true) : ESP_ERR_INVALID_STATE;
    if (!error) error = esp32_mquickjs_wifi_wapi_sdk_policy(enabled);
    wifi_radio_operation_unlock();
    return error;
}
#endif

static esp_err_t wifi_radio_replay_restart_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    if (!wifi_radio_restart_checkpoint_matches_locked(token, mode)) return ESP_ERR_INVALID_STATE;
    esp_err_t err = wifi_radio_check_stopped_lifecycle_locked(token, false);
    if (err != ESP_OK) return err;
    if (!s_radio.driver_owned || !s_radio.storage_configured ||
        (s_config_restart.snapshot != NULL && s_config_restart.source_generation == s_radio.generation))
        return ESP_ERR_INVALID_STATE;
    /* New helper handlers/netifs must already be attached: replay can START
     * a temporary Station even when the final requested mode is AP-only. */
    err = wifi_radio_record_fault("mode", esp_wifi_set_mode(mode));
    if (err != ESP_OK) return err;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.effective_mode = mode;
    taskEXIT_CRITICAL(&s_radio.lock);
    err = wifi_radio_restart_configs_replay_locked(token);
    if (err != ESP_OK) return err;
    return wifi_radio_policy_restart_replay_locked(token, false);
}

esp_err_t esp32_mquickjs_wifi_radio_replay_restart_lifecycle(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_replay_restart_locked(token, mode);
    wifi_radio_operation_unlock();
    return err;
}
#endif

esp_err_t esp32_mquickjs_wifi_radio_restart_lifecycle(
    esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode,
    esp32_mquickjs_wifi_radio_lease_t *application)
{
    if (token == NULL || token->identity == 0U || application == NULL || application->acquired ||
        application->identity != 0U || application->generation != 0U ||
        (mode != WIFI_MODE_STA && mode != WIFI_MODE_AP && mode != WIFI_MODE_APSTA)) return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (mode & WIFI_MODE_AP) return ESP_ERR_NOT_SUPPORTED;
#endif
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (token->identity != s_radio.lifecycle.identity || token->generation != s_radio.lifecycle.generation) goto done;
    if (s_radio.next_lease_identity == 0U) { err = ESP_ERR_NO_MEM; goto done; }
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    err = wifi_radio_checkpoint_restart_locked(token, mode);
    if (err != ESP_OK) goto done;
    err = wifi_radio_rebuild_restart_locked(token, mode);
    if (err != ESP_OK) goto done;
    err = wifi_radio_replay_restart_locked(token, mode);
    if (err != ESP_OK) goto done;
#else
    err = wifi_radio_shutdown_locked();
    if (err != ESP_OK) goto done;
    err = wifi_radio_initialize();
    if (err != ESP_OK) goto done;
    err = wifi_radio_record_fault("mode", esp_wifi_set_mode(mode));
    if (err != ESP_OK) goto done;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.effective_mode = mode;
    taskEXIT_CRITICAL(&s_radio.lock);
#endif
    err = wifi_radio_resume_lifecycle_locked(token, mode, true, application, NULL, NULL, NULL, false, NULL);
done:
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_begin_operation(
    esp32_mquickjs_wifi_radio_lease_t *lease,
    esp32_mquickjs_wifi_radio_operation_kind_t kind,
    esp32_mquickjs_wifi_radio_operation_t *out_operation)
{
    if (out_operation == NULL || out_operation->identity != 0U ||
        (kind != ESP32_MQUICKJS_WIFI_RADIO_OPERATION_SCAN &&
         kind != ESP32_MQUICKJS_WIFI_RADIO_OPERATION_CONNECT)) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    if (WIFI_RADIO_EAP_PENDING && !s_eap_radio.ready) goto done;
#endif
    if (s_radio.lifecycle.identity != 0U) goto done;
    if (!wifi_radio_lease_valid(lease) ||
        lease->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA) goto done;
    if (s_radio.fault_stage != NULL) { err = s_radio.fault_error; goto done; }
    if (!s_radio.started || s_radio.operation.identity != 0U) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        if (s_radio.leases[i].identity != 0U && s_radio.leases[i].fixed_channel) goto done;
    }
    if (s_radio.next_operation_identity == 0U) { err = ESP_ERR_NO_MEM; goto done; }
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.operation = (esp32_mquickjs_wifi_radio_operation_t){
        .generation = lease->generation,
        .lease_identity = lease->identity,
        .identity = s_radio.next_operation_identity++,
        .kind = kind,
    };
    *out_operation = s_radio.operation;
    taskEXIT_CRITICAL(&s_radio.lock);
    err = ESP_OK;
done:
    wifi_radio_operation_unlock();
    return err;
}

