99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
void esp32_mquickjs_wifi_radio_end_operation(
    esp32_mquickjs_wifi_radio_operation_t *operation)
{
    if (operation == NULL || operation->identity == 0U) return;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    if (operation->kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_ACTION ||
        operation->kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_ROC
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
        || operation->kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_AP_DEAUTH
#endif
#if CONFIG_ESP_WIFI_DPP_SUPPORT
        || operation->kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_DPP
#endif
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE || CONFIG_ESP_WIFI_NAN_USD_ENABLE
        || operation->kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_NAN
#endif
#if CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
        || operation->kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_SMARTCONFIG
        || operation->kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_WPS
#endif
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
        || operation->kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_TWT_PROBE
#endif
#if CONFIG_ESP_WIFI_RRM_SUPPORT
        || operation->kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_RRM
#endif
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
        || operation->kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_FTM
#endif
        ) return;
#endif
    wifi_radio_operation_lock();
    taskENTER_CRITICAL(&s_radio.lock);
    if (operation->identity == s_radio.operation.identity &&
        operation->generation == s_radio.operation.generation &&
        operation->lease_identity == s_radio.operation.lease_identity &&
        operation->kind == s_radio.operation.kind)
        memset(&s_radio.operation, 0, sizeof(s_radio.operation));
    taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    memset(operation, 0, sizeof(*operation));
}

static esp_err_t wifi_radio_configuration_owner_locked(
    const esp32_mquickjs_wifi_radio_lease_t *lease)
{
    if (s_radio.lifecycle.identity != 0U) return ESP_ERR_INVALID_STATE;
    if (!wifi_radio_lease_valid(lease)) return ESP_ERR_INVALID_STATE;
    if (s_radio.fault_stage != NULL) return s_radio.fault_error;
    if (!s_radio.started || s_radio.promiscuous_claimed || s_radio.operation.identity != 0U)
        return ESP_ERR_INVALID_STATE;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        if (s_radio.leases[i].identity != 0U &&
            s_radio.leases[i].identity != lease->identity &&
            !(lease->client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA &&
              s_radio.clients[ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION] == 1U &&
              s_radio.leases[i].client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION))
            return ESP_ERR_INVALID_STATE;
    }
    return ESP_OK;
}

esp_err_t esp32_mquickjs_wifi_radio_set_power_save(
    esp32_mquickjs_wifi_radio_lease_t *lease,
    wifi_ps_type_t requested, wifi_ps_type_t *actual)
{
    if (actual == NULL || (requested != WIFI_PS_NONE &&
        requested != WIFI_PS_MIN_MODEM && requested != WIFI_PS_MAX_MODEM))
        return ESP_ERR_INVALID_ARG;
    wifi_ps_type_t value;
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_configuration_owner_locked(lease);
    if (err == ESP_OK) err = esp_wifi_set_ps(requested);
    if (err == ESP_OK) err = esp_wifi_get_ps(&value);
    if (err == ESP_OK) *actual = value;
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_set_tx_power(
    esp32_mquickjs_wifi_radio_lease_t *lease,
    int8_t requested, int8_t *actual)
{
    if (actual == NULL || requested < 8 || requested > 80)
        return ESP_ERR_INVALID_ARG;
    int8_t value;
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_configuration_owner_locked(lease);
    if (err == ESP_OK) err = esp_wifi_set_max_tx_power(requested);
    if (err == ESP_OK) err = esp_wifi_get_max_tx_power(&value);
    if (err == ESP_OK) *actual = value;
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_reserve_ap(esp32_mquickjs_wifi_radio_lease_t *lease)
{
    if (lease == NULL || lease->acquired) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (s_radio.lifecycle.identity != 0U || s_radio.started || s_radio.operation.identity != 0U ||
        s_radio.promiscuous_claimed) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
    err = wifi_radio_acquire_locked(ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP, WIFI_MODE_AP, lease);
done:
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_validate_ap_config(const wifi_config_t *config)
{
    if (config == NULL) return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    return ESP_ERR_NOT_SUPPORTED;
#else
    const wifi_ap_config_t *ap = &config->ap;
    if (ap->ssid_len == 0 || ap->ssid_len > sizeof(ap->ssid) ||
        (ap->channel > 14 && esp32_mquickjs_wifi_radio_5ghz_channel_bit(ap->channel) == 0) ||
        ap->max_connection < 1 || ap->max_connection > ESP32_MQUICKJS_WIFI_MAX_AP_CLIENTS ||
        ap->beacon_interval < ESP32_MQUICKJS_WIFI_AP_BEACON_QUANTUM_TU ||
        ap->beacon_interval > ESP32_MQUICKJS_WIFI_AP_BEACON_MAX_TU ||
        ap->beacon_interval % ESP32_MQUICKJS_WIFI_AP_BEACON_QUANTUM_TU != 0 ||
        ap->dtim_period < 1 || ap->dtim_period > ESP32_MQUICKJS_WIFI_AP_DTIM_MAX || ap->csa_count == 0 ||
        (ap->gtk_rekey_interval != 0 && ap->gtk_rekey_interval < 60)) return ESP_ERR_INVALID_ARG;
#if !CONFIG_SOC_WIFI_SUPPORT_5G
    if (ap->channel > 14) return ESP_ERR_NOT_SUPPORTED;
#endif
    bool sae = ap->authmode == WIFI_AUTH_WPA3_PSK || ap->authmode == WIFI_AUTH_WPA2_WPA3_PSK ||
        ap->wpa3_compatible_mode;
    bool owe = ap->authmode == WIFI_AUTH_OWE;
    bool open = ap->authmode == WIFI_AUTH_OPEN;
    if (!open && !owe && !sae && ap->authmode != WIFI_AUTH_WPA_PSK &&
        ap->authmode != WIFI_AUTH_WPA2_PSK && ap->authmode != WIFI_AUTH_WPA_WPA2_PSK) return ESP_ERR_INVALID_ARG;
    size_t password_length = strnlen((const char *)ap->password, sizeof(ap->password));
    if (open || owe) {
        if (password_length != 0) return ESP_ERR_INVALID_ARG;
    } else if (password_length < (ap->authmode == WIFI_AUTH_WPA3_PSK && !ap->wpa3_compatible_mode ? 1U : 8U) || password_length > 63)
        return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_ENABLE_WPA3_SAE || !CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT
    if (sae) return ESP_ERR_NOT_SUPPORTED;
#endif
#if !CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_SOFTAP
    if (owe) return ESP_ERR_NOT_SUPPORTED;
#endif
    bool tkip = ap->pairwise_cipher == WIFI_CIPHER_TYPE_TKIP || ap->pairwise_cipher == WIFI_CIPHER_TYPE_TKIP_CCMP;
    if (!tkip && ap->pairwise_cipher != WIFI_CIPHER_TYPE_CCMP &&
        ap->pairwise_cipher != WIFI_CIPHER_TYPE_GCMP && ap->pairwise_cipher != WIFI_CIPHER_TYPE_GCMP256)
        return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_GCMP_SUPPORT
    if (ap->pairwise_cipher == WIFI_CIPHER_TYPE_GCMP || ap->pairwise_cipher == WIFI_CIPHER_TYPE_GCMP256)
        return ESP_ERR_NOT_SUPPORTED;
#endif
    if ((ap->authmode == WIFI_AUTH_WPA_PSK && !tkip) ||
        (!ap->pmf_cfg.capable && (ap->pmf_cfg.required || sae || owe)) ||
        ((sae || owe || ap->pmf_cfg.required) && tkip) ||
        ((ap->authmode == WIFI_AUTH_WPA3_PSK || owe) && !ap->pmf_cfg.required) ||
        (open && (ap->pmf_cfg.required || ap->gtk_rekey_interval != 0)) ||
        (ap->transition_disable && !sae)) return ESP_ERR_INVALID_ARG;
    if (ap->sae_pwe_h2e != WPA3_SAE_PWE_UNSPECIFIED) {
        if (!sae || (ap->sae_pwe_h2e != WPA3_SAE_PWE_HUNT_AND_PECK &&
            ap->sae_pwe_h2e != WPA3_SAE_PWE_HASH_TO_ELEMENT && ap->sae_pwe_h2e != WPA3_SAE_PWE_BOTH))
            return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_ENABLE_SAE_H2E
        if (ap->sae_pwe_h2e != WPA3_SAE_PWE_HUNT_AND_PECK) return ESP_ERR_NOT_SUPPORTED;
#endif
    }
#if !CONFIG_ESP_WIFI_FTM_ENABLE || !CONFIG_ESP_WIFI_FTM_RESPONDER_SUPPORT
    if (ap->ftm_responder) return ESP_ERR_NOT_SUPPORTED;
#endif
    if (ap->sae_ext && (ap->wpa3_compatible_mode || ap->authmode != WIFI_AUTH_WPA3_PSK ||
        ap->pairwise_cipher != WIFI_CIPHER_TYPE_GCMP256 ||
        (ap->sae_pwe_h2e != WPA3_SAE_PWE_HASH_TO_ELEMENT && ap->sae_pwe_h2e != WPA3_SAE_PWE_BOTH)))
        return ESP_ERR_INVALID_ARG;
#if !CONFIG_SOC_WIFI_GCMP_SUPPORT || !CONFIG_ESP_WIFI_GCMP_SUPPORT || !CONFIG_ESP_WIFI_ENABLE_SAE_H2E
    if (ap->sae_ext) return ESP_ERR_NOT_SUPPORTED;
#endif
    /* Compatible mode explicitly authorizes the SDK's WPA2/CCMP base profile
     * override, with SAE supplied through RSN override for compatible peers. */
    if (ap->wpa3_compatible_mode &&
        ((ap->authmode != WIFI_AUTH_WPA2_PSK && ap->authmode != WIFI_AUTH_WPA3_PSK &&
          ap->authmode != WIFI_AUTH_WPA2_WPA3_PSK) || ap->pairwise_cipher != WIFI_CIPHER_TYPE_CCMP))
        return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_WPA3_COMPATIBLE_SUPPORT
    if (ap->wpa3_compatible_mode) return ESP_ERR_NOT_SUPPORTED;
#endif
    if ((ap->bss_max_idle_cfg.period != 0 && ap->bss_max_idle_cfg.period < 10) ||
        (ap->bss_max_idle_cfg.protected_keep_alive && (ap->bss_max_idle_cfg.period == 0 || open)))
        return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_BSS_MAX_IDLE_SUPPORT
    if (ap->bss_max_idle_cfg.period != 0 || ap->bss_max_idle_cfg.protected_keep_alive)
        return ESP_ERR_NOT_SUPPORTED;
#endif
    return ESP_OK;
#endif
}

