99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
/* Compare public semantic fields from the pinned SDK, excluding reserved bits
 * and compiler padding. These are rollback snapshots, not JS config inputs. */
static bool wifi_radio_config_equal(wifi_interface_t interface,
    const wifi_config_t *a, const wifi_config_t *b)
{
#define EQ(field) (a->field == b->field)
#define BYTES(field) (memcmp(a->field, b->field, sizeof(a->field)) == 0)
    if (interface == WIFI_IF_STA) {
        return BYTES(sta.ssid) && BYTES(sta.password) && BYTES(sta.bssid) &&
            BYTES(sta.sae_h2e_identifier) && EQ(sta.scan_method) && EQ(sta.bssid_set) &&
            EQ(sta.channel) && EQ(sta.listen_interval) && EQ(sta.sort_method) &&
            EQ(sta.threshold.rssi) && EQ(sta.threshold.authmode) && EQ(sta.threshold.rssi_5g_adjustment) &&
            EQ(sta.pmf_cfg.capable) && EQ(sta.pmf_cfg.required) &&
            EQ(sta.rm_enabled) && EQ(sta.btm_enabled) && EQ(sta.mbo_enabled) &&
            EQ(sta.ft_enabled) && EQ(sta.owe_enabled) && EQ(sta.transition_disable) &&
            EQ(sta.disable_wpa3_compatible_mode) && EQ(sta.sae_pwe_h2e) &&
            EQ(sta.sae_pk_mode) && EQ(sta.failure_retry_cnt) && EQ(sta.he_dcm_set) &&
            EQ(sta.he_dcm_max_constellation_tx) && EQ(sta.he_dcm_max_constellation_rx) &&
            EQ(sta.he_mcs9_enabled) && EQ(sta.he_su_beamformee_disabled) &&
            EQ(sta.he_trig_su_bmforming_feedback_disabled) &&
            EQ(sta.he_trig_mu_bmforming_partial_feedback_disabled) &&
            EQ(sta.he_trig_cqi_feedback_disabled) && EQ(sta.vht_su_beamformee_disabled) &&
            EQ(sta.vht_mu_beamformee_disabled) && EQ(sta.vht_mcs8_enabled);
    }
    return BYTES(ap.ssid) && BYTES(ap.password) && EQ(ap.ssid_len) && EQ(ap.channel) &&
        EQ(ap.authmode) && EQ(ap.ssid_hidden) && EQ(ap.max_connection) &&
        EQ(ap.beacon_interval) && EQ(ap.csa_count) && EQ(ap.dtim_period) &&
        EQ(ap.pairwise_cipher) && EQ(ap.ftm_responder) && EQ(ap.pmf_cfg.capable) &&
        EQ(ap.pmf_cfg.required) && EQ(ap.sae_pwe_h2e) && EQ(ap.transition_disable) &&
        EQ(ap.sae_ext) && EQ(ap.wpa3_compatible_mode) && EQ(ap.bss_max_idle_cfg.period) &&
        EQ(ap.bss_max_idle_cfg.protected_keep_alive) && EQ(ap.gtk_rekey_interval);
#undef BYTES
#undef EQ
}

bool esp32_mquickjs_wifi_radio_accept_station_config(const wifi_config_t *requested,
    const wifi_config_t *actual)
{
    return requested != NULL && actual != NULL && wifi_radio_config_equal(WIFI_IF_STA, requested, actual);
}

enum { RESTART_CONFIG_RAM,
    RESTART_CONFIG_DISABLE,
    RESTART_CONFIG_DISABLE_READ,
    RESTART_CONFIG_COUNTRY,
    RESTART_CONFIG_COUNTRY_READ,
    RESTART_CONFIG_EVENT_MASK,
    RESTART_CONFIG_EVENT_MASK_READ,
    RESTART_CONFIG_MAC_MODE,
    RESTART_CONFIG_MAC_MODE_READ,
    RESTART_CONFIG_MAC_TEMP,
    RESTART_CONFIG_MAC_AP,
    RESTART_CONFIG_MAC_AP_READ,
    RESTART_CONFIG_MAC_STA,
    RESTART_CONFIG_MAC_STA_READ,
    RESTART_CONFIG_ENABLE,
    RESTART_CONFIG_STA_WRITE,
    RESTART_CONFIG_STA_READ,
    RESTART_CONFIG_AP_WRITE,
    RESTART_CONFIG_AP_READ,
    RESTART_CONFIG_PHY_MODE,
    RESTART_CONFIG_STA_PHY_WRITE,
    RESTART_CONFIG_STA_PHY_READ,
    RESTART_CONFIG_AP_PHY_WRITE,
    RESTART_CONFIG_AP_PHY_READ,
    RESTART_CONFIG_BAND_RESTORE,
    RESTART_CONFIG_PS,
    RESTART_CONFIG_PS_READ,
    RESTART_CONFIG_MODE,
    RESTART_CONFIG_MODE_READ,
    RESTART_CONFIG_RATES,
    RESTART_CONFIG_INTERVAL,
    RESTART_CONFIG_DONE };

static bool wifi_radio_restart_configs_owner(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    return token != NULL && token->identity != 0U && token->identity == s_radio.lifecycle.identity &&
        token->generation == s_radio.lifecycle.generation;
}

static esp_err_t wifi_radio_restart_configs_record(const char *stage, esp_err_t err, bool mutated)
{
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.configuration = (esp32_mquickjs_wifi_radio_config_result_t){
        .stage = stage, .error = err, .mutation_attempted = mutated};
    taskEXIT_CRITICAL(&s_radio.lock);
    if (err != ESP_OK && mutated) (void)wifi_radio_record_fault(stage, err);
    return err;
}

static void wifi_radio_restart_configs_discard_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (token == NULL || s_config_restart.owner.identity != token->identity ||
        s_config_restart.owner.generation != token->generation) return;
    if (s_config_restart.snapshot != NULL) {
        esp32_mquickjs_wireless_secure_zero(s_config_restart.snapshot, sizeof(*s_config_restart.snapshot));
        esp32_mquickjs_memory_payload_free(s_config_restart.snapshot);
    }
    memset(&s_config_restart, 0, sizeof(s_config_restart));
}

/* Full PHY reads require AUTO on C5. Capture preparation retains the visible
 * predecessor before exposing the hidden band; never substitute defaults. */
static esp_err_t wifi_radio_restart_phy_mode(void)
{
    wifi_band_mode_t mode;
    esp_err_t err = esp_wifi_get_band_mode(&mode);
    if (err != ESP_OK) return err;
    if (mode != WIFI_BAND_MODE_2G_ONLY && mode != WIFI_BAND_MODE_5G_ONLY && mode != WIFI_BAND_MODE_AUTO)
        return ESP_ERR_INVALID_RESPONSE;
#if CONFIG_SOC_WIFI_SUPPORT_5G
    return mode == WIFI_BAND_MODE_AUTO ? ESP_OK : ESP_ERR_NOT_SUPPORTED;
#else
    return mode == WIFI_BAND_MODE_2G_ONLY ? ESP_OK : ESP_ERR_INVALID_RESPONSE;
#endif
}

static esp_err_t wifi_radio_restart_band_mode_read(wifi_band_mode_t wanted)
{
    wifi_band_mode_t actual;
    esp_err_t err = esp_wifi_get_band_mode(&actual);
    return err == ESP_OK && actual != wanted ? ESP_ERR_INVALID_RESPONSE : err;
}

/* New driver only, no published owner. Both AUTO preparation and restoring
 * the saved single-band mode require START: use Station, fence the SDK cycle,
 * and finish STOP before enabling the final interface mode. */
static esp_err_t wifi_radio_restart_band_select_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t restore_mode,
    wifi_band_mode_t wanted, const char **stage)
{
    if (!wifi_radio_restart_configs_owner(token) || !s_config_restart.captured ||
        s_config_restart.owner.identity != token->identity || s_config_restart.owner.generation != token->generation ||
        s_config_restart.source_generation == s_radio.generation || !s_radio.driver_owned || !s_radio.storage_configured ||
        s_radio.started || s_radio.stop_required || s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED ||
        s_radio.operation.identity != 0U || s_radio.wake_locks != 0U || s_radio.promiscuous_claimed ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL ||
        (restore_mode != WIFI_MODE_STA && restore_mode != WIFI_MODE_AP && restore_mode != WIFI_MODE_APSTA))
        return ESP_ERR_INVALID_STATE;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) return ESP_ERR_INVALID_STATE;
    if (wanted != WIFI_BAND_MODE_2G_ONLY && wanted != WIFI_BAND_MODE_5G_ONLY && wanted != WIFI_BAND_MODE_AUTO)
        return ESP_ERR_INVALID_ARG;
    *stage = "restart-band-select-snapshot";
    wifi_band_mode_t current;
    esp_err_t err = esp_wifi_get_band_mode(&current);
    if (err != ESP_OK) return err;
    if (current != WIFI_BAND_MODE_2G_ONLY && current != WIFI_BAND_MODE_5G_ONLY && current != WIFI_BAND_MODE_AUTO)
        return ESP_ERR_INVALID_RESPONSE;
#if CONFIG_SOC_WIFI_SUPPORT_5G
    if (current == wanted) return ESP_OK;
    *stage = "restart-band-select-station";
    err = esp_wifi_set_mode(WIFI_MODE_STA);
    if (err != ESP_OK) return err;
    taskENTER_CRITICAL(&s_radio.lock); s_radio.effective_mode = WIFI_MODE_STA; taskEXIT_CRITICAL(&s_radio.lock);
    wifi_mode_t actual;
    *stage = "restart-band-select-station-readback";
    err = esp_wifi_get_mode(&actual);
    if (err == ESP_OK && actual != WIFI_MODE_STA) err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) return err;
    *stage = "restart-band-select-start";
    err = wifi_radio_start_stopped_locked(WIFI_MODE_STA, true);
    if (err != ESP_OK) return err;
    /* In this unassociated Station path the fixed SDK mode change restarts
     * the native interface. Observe that cycle separately from our final STOP. */
    *stage = "restart-band-select-cycle-begin";
    err = wifi_radio_begin_events(RADIO_EVENTS_RESTART, WIFI_MODE_STA);
    if (err != ESP_OK) return err;
    wifi_radio_set_state(ESP32_MQUICKJS_WIFI_RADIO_STARTING);
    *stage = "restart-band-select-write";
    err = esp_wifi_set_band_mode(wanted);
    if (err != ESP_OK) return err;
    *stage = "restart-band-select-readback";
    err = wifi_radio_restart_band_mode_read(wanted);
    if (err != ESP_OK) return err;
    *stage = "restart-band-select-cycle-events";
    err = wifi_radio_wait_events();
    if (err != ESP_OK) return err;
    wifi_radio_set_state(ESP32_MQUICKJS_WIFI_RADIO_STARTED);
    *stage = "restart-band-select-stop";
    err = wifi_radio_stop_locked();
    if (err != ESP_OK) return err;
    *stage = "restart-band-select-stopped-readback";
    err = wifi_radio_restart_band_mode_read(wanted);
    if (err != ESP_OK) return err;
    *stage = "restart-band-select-mode";
    err = esp_wifi_set_mode(restore_mode);
    if (err != ESP_OK) return err;
    taskENTER_CRITICAL(&s_radio.lock); s_radio.effective_mode = restore_mode; taskEXIT_CRITICAL(&s_radio.lock);
    *stage = "restart-band-select-mode-readback";
    err = esp_wifi_get_mode(&actual);
    if (err == ESP_OK && actual != restore_mode) err = ESP_ERR_INVALID_RESPONSE;
#else
    if (wanted != WIFI_BAND_MODE_2G_ONLY || current != WIFI_BAND_MODE_2G_ONLY) return ESP_ERR_INVALID_RESPONSE;
#endif
    return err;
}

static esp_err_t wifi_radio_restart_band_prepare_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t restore_mode, const char **stage)
{
#if CONFIG_SOC_WIFI_SUPPORT_5G
    const wifi_band_mode_t wanted = WIFI_BAND_MODE_AUTO;
#else
    const wifi_band_mode_t wanted = WIFI_BAND_MODE_2G_ONLY;
#endif
    return wifi_radio_restart_band_select_locked(token, restore_mode, wanted, stage);
}

