99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
static esp_err_t wifi_radio_restart_phy_subset_io(wifi_radio_restart_configs_t *snapshot,
    unsigned index, uint8_t bands, bool verify, uint8_t preserve)
{
    wifi_protocols_t protocols;
    wifi_bandwidths_t bandwidths;
    esp_err_t err = wifi_radio_read_phy(index == 0 ? WIFI_IF_STA : WIFI_IF_AP, &protocols, &bandwidths);
    if (err != ESP_OK) return err;
    for (unsigned band = 1; band <= bands; band <<= 1) {
        if (!(bands & band)) continue;
        uint16_t protocol = band == 1 ? protocols.ghz_2g : protocols.ghz_5g;
        wifi_bandwidth_t width = band == 1 ? bandwidths.ghz_2g : bandwidths.ghz_5g;
        if (wifi_radio_validate_protocol(protocol, band == 2) != ESP_OK ||
            (width != WIFI_BW20 && width != WIFI_BW40) ||
            (width == WIFI_BW40 && (!(protocol & WIFI_PROTOCOL_11N) || (protocol & (WIFI_PROTOCOL_11AC | WIFI_PROTOCOL_11AX)))))
            return ESP_ERR_INVALID_RESPONSE;
    }
    if (verify)
        return wifi_radio_phy_equal(bands, &snapshot->protocols[index], &snapshot->bandwidths[index],
            &protocols, &bandwidths) ? ESP_OK : ESP_ERR_INVALID_RESPONSE;
    if (preserve != 0U && !wifi_radio_phy_equal(preserve, &snapshot->protocols[index],
        &snapshot->bandwidths[index], &protocols, &bandwidths)) return ESP_ERR_INVALID_RESPONSE;
    snapshot->protocols[index] = protocols;
    snapshot->bandwidths[index] = bandwidths;
    return ESP_OK;
}

/* Capture saved policy without a temporary START/AUTO cycle while the native
 * Action/ROC operation remains owned. The pinned C5 SDK adapter supplies the
 * otherwise hidden band; single-band targets use their ordinary getter. */
static esp_err_t wifi_radio_restart_recovery_phy_read(wifi_radio_restart_configs_t *snapshot, unsigned index)
{
    esp32_mquickjs_wifi_saved_phy_t saved = {0};
#if CONFIG_SOC_WIFI_SUPPORT_5G
    const uint8_t bands = 3U;
    esp_err_t err = esp32_mquickjs_wifi_action_sdk_saved_phy(index == 0 ? WIFI_IF_STA : WIFI_IF_AP, &saved);
#else
    const uint8_t bands = 1U;
    esp_err_t err = wifi_radio_read_phy(index == 0 ? WIFI_IF_STA : WIFI_IF_AP, &saved.protocols, &saved.bandwidths);
#endif
    if (err != ESP_OK) return err;
    for (unsigned band = 1; band <= bands; band <<= 1) {
        uint16_t protocol = band == 1 ? saved.protocols.ghz_2g : saved.protocols.ghz_5g;
        wifi_bandwidth_t width = band == 1 ? saved.bandwidths.ghz_2g : saved.bandwidths.ghz_5g;
        if (wifi_radio_validate_protocol(protocol, band == 2) != ESP_OK ||
            (width != WIFI_BW20 && width != WIFI_BW40) ||
            (width == WIFI_BW40 && (!(protocol & WIFI_PROTOCOL_11N) || (protocol & (WIFI_PROTOCOL_11AC | WIFI_PROTOCOL_11AX)))))
            return ESP_ERR_INVALID_RESPONSE;
    }
    snapshot->protocols[index] = saved.protocols;
    snapshot->bandwidths[index] = saved.bandwidths;
    return ESP_OK;
}

static esp_err_t wifi_radio_restart_phy_io(wifi_radio_restart_configs_t *snapshot, unsigned index, bool verify)
{
#if CONFIG_SOC_WIFI_SUPPORT_5G
    const uint8_t bands = 3U;
#else
    const uint8_t bands = 1U;
#endif
    return wifi_radio_restart_phy_subset_io(snapshot, index, bands, verify, 0U);
}

static esp_err_t wifi_radio_restart_phy_read(wifi_radio_restart_configs_t *snapshot, bool verify, const char **stage)
{
    *stage = verify ? "restart-phy-band-final-readback" : "restart-phy-band-snapshot";
    esp_err_t err = verify ? wifi_radio_restart_band_mode_read(snapshot->band_mode) : wifi_radio_restart_phy_mode();
    if (err != ESP_OK) return err;
    for (unsigned i = 0; i < 2; ++i) {
        if (!(snapshot->mask & (1U << i))) continue;
        *stage = i == 0 ? (verify ? "restart-station-phy-final-readback" : "restart-station-phy-snapshot")
                        : (verify ? "restart-ap-phy-final-readback" : "restart-ap-phy-snapshot");
        /* Both bands were read back in AUTO before selecting the saved mode.
         * Final single-band getters can only prove the visible band's fields. */
        err = verify ? wifi_radio_restart_phy_subset_io(snapshot, i, snapshot->visible_bands, true, 0U)
                     : wifi_radio_restart_phy_io(snapshot, i, false);
        if (err != ESP_OK) return err;
    }
    return ESP_OK;
}

/* Inactive-time getters are START-only and reject disabled interfaces. Capture
 * only the original active mode; never manufacture values for hidden slots.
 * The caller freezes this before any temporary Station/band preparation. */
static esp_err_t wifi_radio_restart_inactive_read(wifi_radio_restart_configs_t *snapshot,
    uint8_t mask, bool verify, const char **stage)
{
    *stage = "restart-inactive-admission";
    if (!s_radio.started ||
        (mask & ~((uint8_t)s_radio.effective_mode)) != 0U ||
        (mask & ~snapshot->mask) != 0U) return ESP_ERR_INVALID_STATE;
    uint16_t observed[2] = {0};
    for (unsigned i = 0; i < 2; ++i) {
        if (!(mask & (1U << i))) continue;
        *stage = i == 0 ? (verify ? "restart-station-inactive-final-readback" : "restart-station-inactive-snapshot")
                        : (verify ? "restart-ap-inactive-final-readback" : "restart-ap-inactive-snapshot");
        esp_err_t err = esp_wifi_get_inactive_time(i == 0 ? WIFI_IF_STA : WIFI_IF_AP, &observed[i]);
        if (err == ESP_OK && (observed[i] < (i == 0 ? 3 : 10) ||
            (verify && observed[i] != snapshot->inactive_time[i]))) err = ESP_ERR_INVALID_RESPONSE;
        wifi_radio_inactive_history_record(i, observed[i], err);
        if (err != ESP_OK) return err;
    }
    if (!verify) memcpy(snapshot->inactive_time, observed, sizeof(observed));
    return ESP_OK;
}

static esp_err_t wifi_radio_restart_globals_read(wifi_radio_restart_configs_t *snapshot,
    bool verify, const char **stage)
{
    wifi_country_t country = {0};
    *stage = verify ? "restart-country-final-readback" : "restart-country-snapshot";
    esp_err_t err = esp_wifi_get_country(&country);
    if (err == ESP_OK && (!wifi_radio_country_valid(&country) ||
        (verify && !wifi_radio_country_equal(&snapshot->country, &country, false)))) err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) return err;
    if (!verify) snapshot->country = country;
    wifi_ps_type_t power_save;
    *stage = verify ? "restart-power-save-final-readback" : "restart-power-save-snapshot";
    err = esp_wifi_get_ps(&power_save);
    if (err == ESP_OK && (power_save != WIFI_PS_NONE && power_save != WIFI_PS_MIN_MODEM && power_save != WIFI_PS_MAX_MODEM))
        err = ESP_ERR_INVALID_RESPONSE;
    if (err == ESP_OK && verify && power_save != snapshot->power_save) err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) return err;
    if (!verify) snapshot->power_save = power_save;
    uint32_t event_mask;
    *stage = verify ? "restart-event-mask-final-readback" : "restart-event-mask-snapshot";
    err = esp_wifi_get_event_mask(&event_mask);
    if (err == ESP_OK && ((event_mask & ~((uint32_t)WIFI_EVENT_MASK_AP_PROBEREQRECVED)) != 0U ||
        (verify && event_mask != snapshot->event_mask))) err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) return err;
    if (!verify) snapshot->event_mask = event_mask;
    for (unsigned i = 0; i < 2; ++i) {
        if (!(snapshot->mask & (1U << i))) continue;
        uint8_t mac[6];
        *stage = i == 0 ? (verify ? "restart-station-mac-final-readback" : "restart-station-mac-snapshot")
                        : (verify ? "restart-ap-mac-final-readback" : "restart-ap-mac-snapshot");
        err = esp_wifi_get_mac(i == 0 ? WIFI_IF_STA : WIFI_IF_AP, mac);
        if (err == ESP_OK && ((mac[0] & 1U) || memcmp(mac, "\0\0\0\0\0\0", 6) == 0 ||
            (verify && memcmp(mac, snapshot->mac[i], 6) != 0))) err = ESP_ERR_INVALID_RESPONSE;
        if (err != ESP_OK) return err;
        if (!verify) memcpy(snapshot->mac[i], mac, 6);
    }
    if ((snapshot->mask & WIFI_MODE_AP) && memcmp(snapshot->mac[0], snapshot->mac[1], 6) == 0)
        return ESP_ERR_INVALID_RESPONSE;
    return ESP_OK;
}

/* Both interfaces are selected while the physical driver remains stopped.
 * An unused local address frees the STA address
 * before restoring AP, so a valid swapped STA/AP pair survives factory reset.
 * The temporary address is never used by a started interface. */
static esp_err_t wifi_radio_restart_mac_temporary(const wifi_radio_restart_configs_t *snapshot,
    const char **stage)
{
    uint8_t current[3][6], temporary[6], actual[6];
    unsigned count = 2;
    *stage = "restart-mac-temporary-snapshot";
    esp_err_t err = esp_wifi_get_mac(WIFI_IF_STA, current[0]);
    if (err == ESP_OK) err = esp_wifi_get_mac(WIFI_IF_AP, current[1]);
    if (err != ESP_OK) return err;
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE || CONFIG_ESP_WIFI_NAN_USD_ENABLE
    err = esp_wifi_get_mac(WIFI_IF_NAN, current[2]);
    if (err != ESP_OK) return err;
    count = 3;
    if (memcmp(current[2], snapshot->mac[0], 6) == 0 || memcmp(current[2], snapshot->mac[1], 6) == 0)
        return ESP_ERR_INVALID_STATE;
#endif
    memcpy(temporary, snapshot->mac[0], 6);
    temporary[0] = (temporary[0] | 2U) & 0xfeU;
    bool found = false;
    for (unsigned suffix = 0; suffix < 256; ++suffix) {
        temporary[5] = (uint8_t)(snapshot->mac[0][5] + suffix);
        bool conflict = false;
        for (unsigned i = 0; i < count; ++i) conflict |= memcmp(temporary, current[i], 6) == 0;
        for (unsigned i = 0; i < 2; ++i) conflict |= memcmp(temporary, snapshot->mac[i], 6) == 0;
        if (!conflict) { found = true; break; }
    }
    if (!found) return ESP_ERR_INVALID_STATE;
    *stage = "restart-mac-temporary-write";
    err = esp_wifi_set_mac(WIFI_IF_STA, temporary);
    if (err != ESP_OK) return err;
    *stage = "restart-mac-temporary-readback";
    err = esp_wifi_get_mac(WIFI_IF_STA, actual);
    return err == ESP_OK && memcmp(actual, temporary, 6) != 0 ? ESP_ERR_INVALID_RESPONSE : err;
}

/* The current and home channel must describe the same idle radio. This does
 * not invent an observation of the inactive band's hidden home channel.
 * The pinned C5 SDK writes only the low byte of each secondary-channel enum;
 * initialize the complete outputs before native access, as in channel refresh. */
static esp_err_t wifi_radio_restart_channel_read(wifi_radio_restart_configs_t *snapshot, bool verify)
{
    wifi_band_mode_t mode;
    wifi_band_t band;
    uint8_t primary, home;
    wifi_second_chan_t secondary = WIFI_SECOND_CHAN_NONE, home_secondary = WIFI_SECOND_CHAN_NONE;
    esp_err_t err = wifi_radio_band_snapshot(&mode, &band);
    if (err == ESP_OK) err = esp_wifi_get_channel(&primary, &secondary);
    if (err == ESP_OK) err = esp_wifi_get_home_channel(&home, &home_secondary);
    if (err != ESP_OK) return err;
    if ((secondary != WIFI_SECOND_CHAN_NONE && secondary != WIFI_SECOND_CHAN_ABOVE && secondary != WIFI_SECOND_CHAN_BELOW) ||
        (band == WIFI_BAND_2G ? primary < 1 || primary > 14 : esp32_mquickjs_wifi_radio_5ghz_channel_bit(primary) == 0U))
        return ESP_ERR_INVALID_RESPONSE;
    if (primary != home || secondary != home_secondary) return ESP_ERR_INVALID_STATE;
    if (verify)
        return snapshot->band_mode == mode && snapshot->band == band && snapshot->primary == primary &&
            snapshot->secondary == secondary ? ESP_OK : ESP_ERR_INVALID_RESPONSE;
    snapshot->band_mode = mode;
    snapshot->band = band;
    snapshot->primary = primary;
    snapshot->secondary = secondary;
    snapshot->visible_bands = mode == WIFI_BAND_MODE_2G_ONLY ? 1U : mode == WIFI_BAND_MODE_5G_ONLY ? 2U : 3U;
    return ESP_OK;
}

/* Recovery returns to the SDK's home channel, not the current off-channel
 * residency. The runtime must quiesce managed scan/connect/AP transitions before
 * capture; repeat this observation before freezing the complete checkpoint. */
static esp_err_t wifi_radio_restart_recovery_home_read(wifi_radio_restart_configs_t *snapshot, bool verify)
{
    wifi_band_mode_t mode;
    uint8_t home;
    wifi_second_chan_t secondary = WIFI_SECOND_CHAN_NONE;
    esp_err_t err = esp_wifi_get_band_mode(&mode);
    if (err == ESP_OK) err = esp_wifi_get_home_channel(&home, &secondary);
    if (err != ESP_OK) return err;
    if ((mode != WIFI_BAND_MODE_2G_ONLY && mode != WIFI_BAND_MODE_5G_ONLY && mode != WIFI_BAND_MODE_AUTO) ||
        (secondary != WIFI_SECOND_CHAN_NONE && secondary != WIFI_SECOND_CHAN_ABOVE && secondary != WIFI_SECOND_CHAN_BELOW) ||
        home == 0U || (home > 14 && esp32_mquickjs_wifi_radio_5ghz_channel_bit(home) == 0U) ||
        (mode == WIFI_BAND_MODE_2G_ONLY && home > 14) || (mode == WIFI_BAND_MODE_5G_ONLY && home <= 14))
        return ESP_ERR_INVALID_RESPONSE;
#if !CONFIG_SOC_WIFI_SUPPORT_5G
    if (mode != WIFI_BAND_MODE_2G_ONLY || home > 14) return ESP_ERR_INVALID_RESPONSE;
#endif
    wifi_band_t band = home > 14 ? WIFI_BAND_5G : WIFI_BAND_2G;
    if (verify) return snapshot->band_mode == mode && snapshot->band == band &&
        snapshot->primary == home && snapshot->secondary == secondary ? ESP_OK : ESP_ERR_INVALID_RESPONSE;
    snapshot->band_mode = mode;
    snapshot->band = band;
    snapshot->primary = home;
    snapshot->secondary = secondary;
    snapshot->visible_bands = mode == WIFI_BAND_MODE_2G_ONLY ? 1U : mode == WIFI_BAND_MODE_5G_ONLY ? 2U : 3U;
    return ESP_OK;
}

