99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
enum { RESTART_CAPTURE_RAM, RESTART_CAPTURE_STOP, RESTART_CAPTURE_MODE, RESTART_CAPTURE_MODE_READ,
    RESTART_CAPTURE_START, RESTART_CAPTURE_START_EVENTS, RESTART_CAPTURE_AUTO, RESTART_CAPTURE_AUTO_READ,
    RESTART_CAPTURE_AUTO_EVENTS, RESTART_CAPTURE_STA_PHY, RESTART_CAPTURE_AP_PHY, RESTART_CAPTURE_DONE,
    RESTART_CAPTURE_FAILED };

/* Old physical generation, exact lifecycle owner, no published leases. Once
 * preparation begins, retain the original secret snapshot until replay or
 * explicit successful cleanup. Retry only known read/event/STOP suffixes;
 * an uncertain configuration/START write requires explicit cleanup. */
static esp_err_t wifi_radio_restart_capture_continue_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    wifi_radio_restart_configs_t *snapshot = s_config_restart.snapshot;
    if (!wifi_radio_restart_configs_owner(token) || snapshot == NULL || s_config_restart.captured ||
        s_config_restart.owner.identity != token->identity || s_config_restart.owner.generation != token->generation ||
        s_config_restart.mode != mode || s_config_restart.source_generation != s_radio.generation ||
        !s_radio.driver_owned || !s_radio.storage_configured || s_radio.restart_required ||
        s_radio.operation.identity != 0U || s_radio.wake_locks != 0U || s_radio.promiscuous_claimed ||
        s_tx_rate_lease.identity != 0U || s_tx_rate_lease.restore_pending) return ESP_ERR_INVALID_STATE;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) return ESP_ERR_INVALID_STATE;
    if (s_config_restart.snapshot->capture_phase == RESTART_CAPTURE_FAILED)
        return wifi_radio_restart_configs_record(s_config_restart.snapshot->capture_stage, s_config_restart.snapshot->capture_error, true);
#if CONFIG_SOC_WIFI_SUPPORT_5G
    const char *stage = "restart-capture-phase";
    esp_err_t err = ESP_ERR_INVALID_STATE;
    while (s_config_restart.snapshot->capture_phase < RESTART_CAPTURE_DONE) {
        bool uncertain_write = false;
        switch (s_config_restart.snapshot->capture_phase) {
        case RESTART_CAPTURE_RAM:
            stage = "restart-capture-ram";
            uncertain_write = true;
            err = esp_wifi_set_storage(WIFI_STORAGE_RAM);
            if (err == ESP_OK) {
                taskENTER_CRITICAL(&s_radio.lock); s_radio.storage = WIFI_STORAGE_RAM; taskEXIT_CRITICAL(&s_radio.lock);
            }
            break;
        case RESTART_CAPTURE_STOP:
            stage = "restart-capture-stop";
            err = wifi_radio_stop_locked();
            break;
        case RESTART_CAPTURE_MODE:
            stage = "restart-capture-station";
            uncertain_write = true;
            err = esp_wifi_set_mode(WIFI_MODE_STA);
            if (err == ESP_OK) {
                taskENTER_CRITICAL(&s_radio.lock); s_radio.effective_mode = WIFI_MODE_STA; taskEXIT_CRITICAL(&s_radio.lock);
            }
            break;
        case RESTART_CAPTURE_MODE_READ: {
            wifi_mode_t actual;
            stage = "restart-capture-station-readback";
            err = esp_wifi_get_mode(&actual);
            if (err == ESP_OK && actual != WIFI_MODE_STA) err = ESP_ERR_INVALID_RESPONSE;
            break;
        }
        case RESTART_CAPTURE_START:
            stage = "restart-capture-start";
            /* This temporary, unleased START only exposes hidden PHY state.
             * The exact checkpoint already owns the settings. Keep their
             * pending flags and the original fault until physical rebuild;
             * normal activation gates must not block known capture suffixes. */
            err = wifi_radio_start_stopped_locked(WIFI_MODE_STA, false);
            if (s_radio.started) {
                /* Accepted native START: even on timeout, never submit again. */
                s_config_restart.snapshot->capture_phase = RESTART_CAPTURE_START_EVENTS;
                if (err == ESP_OK) { ++s_config_restart.snapshot->capture_phase; continue; }
            } else {
                uncertain_write = s_radio.stop_required;
            }
            break;
        case RESTART_CAPTURE_START_EVENTS:
            stage = "restart-capture-start-events";
            err = wifi_radio_wait_events();
            break;
        case RESTART_CAPTURE_AUTO:
            stage = "restart-capture-cycle-begin";
            err = wifi_radio_begin_events(RADIO_EVENTS_RESTART, WIFI_MODE_STA);
            if (err != ESP_OK) break;
            wifi_radio_set_state(ESP32_MQUICKJS_WIFI_RADIO_STARTING);
            stage = "restart-capture-auto";
            uncertain_write = true;
            err = esp_wifi_set_band_mode(WIFI_BAND_MODE_AUTO);
            break;
        case RESTART_CAPTURE_AUTO_READ:
            stage = "restart-capture-auto-readback";
            err = wifi_radio_restart_phy_mode();
            break;
        case RESTART_CAPTURE_AUTO_EVENTS:
            stage = "restart-capture-cycle-events";
            err = wifi_radio_wait_events();
            if (err == ESP_OK) wifi_radio_set_state(ESP32_MQUICKJS_WIFI_RADIO_STARTED);
            break;
        case RESTART_CAPTURE_STA_PHY:
        case RESTART_CAPTURE_AP_PHY: {
            unsigned index = s_config_restart.snapshot->capture_phase - RESTART_CAPTURE_STA_PHY;
            stage = index == 0 ? "restart-capture-station-phy" : "restart-capture-ap-phy";
            err = !(snapshot->mask & (1U << index)) ? ESP_OK :
                wifi_radio_restart_phy_subset_io(snapshot, index, 3U, false, snapshot->visible_bands);
            break;
        }
        default:
            return ESP_ERR_INVALID_STATE;
        }
        if (err != ESP_OK) {
            if (uncertain_write) {
                s_config_restart.snapshot->capture_phase = RESTART_CAPTURE_FAILED;
                s_config_restart.snapshot->capture_stage = stage;
                s_config_restart.snapshot->capture_error = err;
            }
            return wifi_radio_restart_configs_record(stage, err, true);
        }
        ++s_config_restart.snapshot->capture_phase;
    }
    s_config_restart.captured = true;
    return ESP_OK;
#else
    return ESP_ERR_INVALID_STATE;
#endif
}

