99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
static esp_err_t wifi_radio_restart_configs_capture_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    const char *stage = "restart-config-admission";
    esp_err_t err = ESP_ERR_INVALID_STATE;
    bool source_mutated = false;
    bool raw_recovery = wifi_radio_raw_tx_recovery_exact_locked(token);
    if (!wifi_radio_restart_configs_owner(token) ||
        (s_tx_rate_lease.identity != 0U && !raw_recovery) || s_tx_rate_lease.restore_pending) goto failed;
    if (s_config_restart.captured) {
        if (s_config_restart.owner.identity != token->identity ||
            s_config_restart.owner.generation != token->generation || s_config_restart.mode != mode)
            goto failed;
        /* Every new physical attempt consumes baseline plus replay revisions.
         * Keep frozen intent on failure; never recapture uncertain driver state. */
        if (s_config_restart.snapshot != NULL && s_interval.revision > UINT32_MAX - 2U)
            return wifi_radio_restart_configs_record("restart-interval-capacity", err, false);
        if (s_config_restart.snapshot != NULL &&
            !esp32_mquickjs_wifi_tx_rate_replay_capacity(&s_tx_rates, &s_config_restart.snapshot->rates))
            return wifi_radio_restart_configs_record("restart-tx-rate-capacity", err, false);
        return ESP_OK;
    }
    if (s_config_restart.snapshot != NULL)
        return wifi_radio_restart_capture_continue_locked(token, mode);
    bool recovery = wifi_radio_action_recovery_exact_locked(token);
    uint32_t recovery_owner = recovery ? wifi_radio_action_recovery_capture_owner_locked(token) : 0U;
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    if (wifi_radio_ftm_recovery_exact_locked(token)) {
        recovery = true;
        recovery_owner = wifi_radio_ftm_recovery_capture_owner_locked(token);
    }
#endif
    if (raw_recovery) {
        recovery = true;
        recovery_owner = wifi_radio_raw_tx_recovery_capture_owner_locked(token);
        if (recovery_owner == 0U) goto failed;
    }
    bool twt_recovery = false;
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    twt_recovery = wifi_radio_twt_recovery_exact_locked(token);
    if (twt_recovery) {
        if (!wifi_radio_twt_recovery_owners_locked()) goto failed;
        recovery = true;
    }
#endif
    if ((s_radio.operation.identity != 0U && recovery_owner == 0U && !twt_recovery) || s_radio.wake_locks != 0U || s_radio.promiscuous_claimed ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required) goto failed;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (!twt_recovery && s_radio.leases[i].identity != 0U && s_radio.leases[i].identity != recovery_owner) goto failed;
    /* Cold initialization has no previous SDK config, and allocates no secret
     * snapshot. An uncertain init still fails the existing shutdown boundary. */
    if (!s_radio.driver_owned) {
        s_config_restart.owner = *token;
        s_config_restart.mode = mode;
        s_config_restart.source_generation = s_radio.generation;
        s_config_restart.captured = true;
        return ESP_OK;
    }
    if (!s_radio.storage_configured || (s_radio.storage != WIFI_STORAGE_RAM && s_radio.storage != WIFI_STORAGE_FLASH))
        goto failed;
    bool stopped_source = !s_radio.started && wifi_radio_stop_snapshot_unchanged_locked() &&
        s_stop_snapshot.mode == (uint8_t)s_radio.effective_mode;
    bool start_source = !s_radio.started && !stopped_source;
    if (start_source && (s_radio.stop_required || s_radio.stop_submitted ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED ||
        s_radio.event_phase != RADIO_EVENTS_IDLE || s_radio.event_live != 0U || recovery)) {
        stage = "restart-source-admission";
        goto failed;
    }
    bool restore_off = s_radio.effective_mode == WIFI_MODE_NULL;
    if (restore_off && (!start_source || (mode != WIFI_MODE_STA && mode != WIFI_MODE_APSTA))) {
        stage = "restart-inactive-mode-admission";
        goto failed;
    }
    stage = "restart-config-allocate";
    wifi_radio_restart_configs_t *snapshot = esp32_mquickjs_memory_wireless_calloc("wifi.radio", 1, sizeof(*snapshot), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (snapshot == NULL) { err = ESP_ERR_NO_MEM; goto failed; }
    snapshot->storage = s_radio.storage;
    snapshot->restore_off = restore_off;
    snapshot->mask = WIFI_MODE_STA;
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    snapshot->mask |= WIFI_MODE_AP;
#endif
    stage = "restart-tx-rate-snapshot";
    err = raw_recovery ? esp32_mquickjs_wifi_tx_rate_recovery_capture(&s_tx_rates,
        s_radio.generation, recovery_owner, &s_tx_rate_lease, &snapshot->rates)
        : esp32_mquickjs_wifi_tx_rate_restart_capture(&s_tx_rates, s_radio.generation, &snapshot->rates);
    if (err != ESP_OK) goto discard;
    stage = "restart-interval-snapshot";
    err = esp32_mquickjs_wifi_interval_capture(&s_interval, s_radio.generation, &snapshot->interval);
    if (err != ESP_OK) goto discard;
    wifi_mode_t actual;
    stage = "restart-config-mode-snapshot";
    err = esp_wifi_get_mode(&actual);
    if (err == ESP_OK && actual != s_radio.effective_mode) err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) goto discard;
    for (unsigned i = 0; i < 2; ++i) {
        if (!(snapshot->mask & (1U << i))) continue;
        stage = i == 0 ? "restart-station-snapshot" : "restart-ap-snapshot";
        /* The getter can read inactive interfaces too; no mode mutation is
         * needed for capture. Setter restoration enables them while stopped. */
        err = esp_wifi_get_config(i == 0 ? WIFI_IF_STA : WIFI_IF_AP, &snapshot->saved[i]);
        if (err != ESP_OK) goto discard;
    }
    err = wifi_radio_restart_globals_read(snapshot, false, &stage);
    if (err != ESP_OK) goto discard;
    if (start_source) {
        /* A healthy configured driver may never have run, or a stopped write
         * may have invalidated its old RF observations. The explicit restart
         * owns the source START too; no owner is published or STA connected.
         * Allocate and validate all readable intent before touching the SDK.
         * As with replay, use RAM so a temporary AP START cannot commit NVS. */
        if (s_radio.storage != WIFI_STORAGE_RAM) {
            stage = "restart-source-ram";
            source_mutated = true;
            taskENTER_CRITICAL(&s_radio.lock); s_radio.storage_configured = false; taskEXIT_CRITICAL(&s_radio.lock);
            err = esp_wifi_set_storage(WIFI_STORAGE_RAM);
            if (err != ESP_OK) goto discard;
            taskENTER_CRITICAL(&s_radio.lock);
            s_radio.storage = WIFI_STORAGE_RAM;
            s_radio.storage_configured = true;
            taskEXIT_CRITICAL(&s_radio.lock);
        }
        if (restore_off) {
            stage = "restart-source-off-mode";
            source_mutated = true;
            err = esp_wifi_set_mode(mode);
            if (err != ESP_OK) goto discard;
            taskENTER_CRITICAL(&s_radio.lock);
            s_radio.effective_mode = mode;
            taskEXIT_CRITICAL(&s_radio.lock);
            stage = "restart-source-off-mode-readback";
            err = esp_wifi_get_mode(&actual);
            if (err == ESP_OK && actual != mode) err = ESP_ERR_INVALID_RESPONSE;
            if (err != ESP_OK) goto discard;
        }
        stage = "restart-source-start";
        err = wifi_radio_start_stopped_locked(actual, true);
        source_mutated |= s_radio.stop_required;
        if (err != ESP_OK) goto discard;
        /* START may normalize SDK configuration. Capture its actual result
         * consistently with the runtime-only power/channel/inactive values,
         * retaining the original storage selection for final commit. */
        stage = "restart-source-mode-readback";
        wifi_mode_t started_mode;
        err = esp_wifi_get_mode(&started_mode);
        if (err == ESP_OK && started_mode != actual) err = ESP_ERR_INVALID_RESPONSE;
        if (err != ESP_OK) goto discard;
        for (unsigned i = 0; i < 2; ++i) {
            if (!(snapshot->mask & (1U << i))) continue;
            stage = i == 0 ? "restart-source-station-readback" : "restart-source-ap-readback";
            err = esp_wifi_get_config(i == 0 ? WIFI_IF_STA : WIFI_IF_AP, &snapshot->saved[i]);
            if (err != ESP_OK) goto discard;
        }
        err = wifi_radio_restart_globals_read(snapshot, false, &stage);
        if (err != ESP_OK) goto discard;
    }
    if (stopped_source) {
        stage = "restart-stop-observations";
        err = wifi_radio_restart_stopped_observations_locked(snapshot, false);
    } else {
        snapshot->inactive_mask = (uint8_t)actual;
        err = wifi_radio_restart_inactive_read(snapshot, snapshot->inactive_mask, false, &stage);
        if (err != ESP_OK) goto discard;
        stage = "restart-tx-power-snapshot";
        err = esp_wifi_get_max_tx_power(&snapshot->tx_power);
        if (err == ESP_OK && (snapshot->tx_power < 8 || snapshot->tx_power > 80)) err = ESP_ERR_INVALID_RESPONSE;
        if (err != ESP_OK) goto discard;
        stage = "restart-band-channel-snapshot";
        err = recovery ? wifi_radio_restart_recovery_home_read(snapshot, false) : wifi_radio_restart_channel_read(snapshot, false);
    }
    if (err != ESP_OK) goto discard;
    for (unsigned i = 0; i < 2; ++i) {
        if (!(snapshot->mask & (1U << i))) continue;
        stage = i == 0 ? "restart-station-visible-phy" : "restart-ap-visible-phy";
        err = recovery ? wifi_radio_restart_recovery_phy_read(snapshot, i)
            : wifi_radio_restart_phy_subset_io(snapshot, i, snapshot->visible_bands, false, 0U);
        if (err != ESP_OK) goto discard;
    }
    stage = "restart-band-channel-snapshot-check";
    err = stopped_source ? wifi_radio_restart_stopped_observations_locked(snapshot, true)
        : recovery ? wifi_radio_restart_recovery_home_read(snapshot, true) : wifi_radio_restart_channel_read(snapshot, true);
    if (err != ESP_OK) goto discard;
    if (!stopped_source) {
        err = wifi_radio_restart_inactive_read(snapshot, snapshot->inactive_mask, true, &stage);
        if (err != ESP_OK) goto discard;
    }
#if ESP32_MQUICKJS_WIFI_HE_STATISTICS_AVAILABLE
    stage = "restart-he-statistics-snapshot";
    if (s_he_statistics.pending) snapshot->he_statistics = s_he_statistics.saved;
    else {
        err = esp32_mquickjs_wifi_he_statistics_snapshot(&snapshot->he_statistics, false);
        if (err != ESP_OK) goto discard;
        s_he_statistics.managed = true;
    }
#endif
    stage = "restart-scan-parameters-snapshot";
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    esp32_mquickjs_wifi_twt_control_t twt_control = {0};
    stage = "restart-twt-policy-snapshot";
    err = esp32_mquickjs_wifi_twt_sdk_control(ESP32_MQUICKJS_WIFI_TWT_READ_CONFIG, &twt_control);
    if (err != ESP_OK) goto discard;
    snapshot->twt_policy = twt_control.config;
    stage = "restart-scan-parameters-snapshot";
#endif
    if (!stopped_source && (actual & WIFI_MODE_STA)) {
        err = wifi_radio_scan_parameters_observe_locked(&snapshot->scan_parameters);
        if (err != ESP_OK) goto discard;
        snapshot->scan_parameters_known = true;
    } else if (s_scan_parameters.generation == s_radio.generation) {
        if (s_scan_parameters.error != ESP_OK) { err = s_scan_parameters.error; goto discard; }
        snapshot->scan_parameters_known = s_scan_parameters.known;
        snapshot->scan_parameters = s_scan_parameters.value;
    }
    snapshot->inactive_saved_mask = snapshot->inactive_mask;
    if (s_inactive_history.generation == s_radio.generation) {
        /* An unavailable hidden observation is not permission to substitute an
         * SDK default. Active observations above may repair their own slots. */
        if (s_inactive_history.failed & snapshot->mask & ~snapshot->inactive_mask & ~s_inactive_history.pending) {
            stage = "restart-hidden-inactive-history";
            err = s_inactive_history.error != ESP_OK ? s_inactive_history.error : ESP_ERR_INVALID_STATE;
            goto discard;
        }
        for (unsigned i = 0; i < 2; ++i) {
            uint8_t bit = (uint8_t)(1U << i);
            if (!(snapshot->mask & bit) || (snapshot->inactive_mask & bit) ||
                !((s_inactive_history.known | s_inactive_history.pending) & bit)) continue;
            snapshot->inactive_time[i] = (s_inactive_history.pending & bit)
                ? s_inactive_history.pending_values[i] : s_inactive_history.values[i];
            snapshot->inactive_saved_mask |= bit;
        }
    }
#if CONFIG_SOC_WIFI_SUPPORT_5G
    if (!stopped_source && snapshot->visible_bands != 3U && (!s_radio.started || !s_radio.stop_required ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED)) {
        err = ESP_ERR_INVALID_STATE;
        goto discard;
    }
#endif
    s_config_restart.owner = *token;
    s_config_restart.snapshot = snapshot;
    s_config_restart.source_generation = s_radio.generation;
    s_config_restart.mode = mode;
#if CONFIG_SOC_WIFI_SUPPORT_5G
    if (!recovery && snapshot->visible_bands != 3U)
        return wifi_radio_restart_capture_continue_locked(token, mode);
#endif
    s_config_restart.captured = true;
    return ESP_OK;
discard:
    if (source_mutated) {
        /* No complete checkpoint exists. Keep the partial source and exact
         * failure until physical cleanup; never replay it or repeat START. */
        snapshot->capture_phase = RESTART_CAPTURE_FAILED;
        snapshot->capture_stage = stage;
        snapshot->capture_error = err;
        s_config_restart.owner = *token;
        s_config_restart.snapshot = snapshot;
        s_config_restart.source_generation = s_radio.generation;
        s_config_restart.mode = mode;
    } else {
        esp32_mquickjs_wireless_secure_zero(snapshot, sizeof(*snapshot));
        esp32_mquickjs_memory_payload_free(snapshot);
    }
failed:
    return wifi_radio_restart_configs_record(stage, err, source_mutated);
}

bool esp32_mquickjs_wifi_radio_pmf_disable_allowed(wifi_interface_t interface, const wifi_config_t *config)
{
    if (config == NULL || (interface != WIFI_IF_STA && interface != WIFI_IF_AP)) return false;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (interface == WIFI_IF_AP) return false;
#endif
    wifi_auth_mode_t auth = interface == WIFI_IF_STA ? config->sta.threshold.authmode : config->ap.authmode;
    /* Explicitly reviewed non-WPA3 families only. Never turn a new/unknown
     * security encoding into permission to remove management protection. */
    switch (auth) {
    case WIFI_AUTH_OPEN:
    case WIFI_AUTH_WEP:
    case WIFI_AUTH_WPA_PSK:
    case WIFI_AUTH_WPA2_PSK:
    case WIFI_AUTH_WPA_WPA2_PSK:
    case WIFI_AUTH_ENTERPRISE:
    case WIFI_AUTH_WPA_ENTERPRISE:
        break;
    default:
        return false;
    }
    return interface == WIFI_IF_STA ? config->sta.disable_wpa3_compatible_mode :
        !config->ap.wpa3_compatible_mode;
}

