99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
/* Only for an SDK-observed predecessor, never new caller input. set_config
 * may ignore capable=false; a disabled predecessor needs the dedicated API
 * after config restoration and before START, followed by full caller readback. */
static esp_err_t wifi_radio_restore_disabled_pmf(wifi_interface_t interface, const wifi_config_t *config)
{
    const wifi_pmf_config_t *pmf = interface == WIFI_IF_STA ? &config->sta.pmf_cfg : &config->ap.pmf_cfg;
    if (pmf->capable || pmf->required) return ESP_OK;
    wifi_config_t observed = {0};
    esp_err_t err = esp_wifi_get_config(interface, &observed);
    const wifi_pmf_config_t *actual = interface == WIFI_IF_STA ? &observed.sta.pmf_cfg : &observed.ap.pmf_cfg;
    bool disabled = !actual->capable && !actual->required;
    esp32_mquickjs_wireless_secure_zero(&observed, sizeof(observed));
    if (err != ESP_OK || disabled) return err;
    if (!esp32_mquickjs_wifi_radio_pmf_disable_allowed(interface, config)) return ESP_ERR_NOT_SUPPORTED;
    return esp_wifi_disable_pmf_config(interface);
}

static esp_err_t wifi_radio_restart_config_io(wifi_radio_restart_configs_t *snapshot,
    unsigned index, bool write)
{
    wifi_interface_t interface = index == 0 ? WIFI_IF_STA : WIFI_IF_AP;
    memset(&snapshot->scratch, 0, sizeof(snapshot->scratch));
    esp_err_t err = ESP_OK;
    if (write) {
        bool apply = true;
        if (interface == WIFI_IF_AP) {
            /* The SDK's untouched OPEN AP default reports PMF capable=true,
             * but set_config normalizes it to false. Preserve an already exact
             * predecessor without rewriting it; read failures never authorize
             * a write, and the separate readback phase still checks all fields. */
            err = esp_wifi_get_config(interface, &snapshot->scratch);
            apply = err == ESP_OK &&
                !wifi_radio_config_equal(interface, &snapshot->saved[index], &snapshot->scratch);
        }
        if (apply) {
            /* SDK's mutable input cannot alter the frozen predecessor. */
            snapshot->scratch = snapshot->saved[index];
            err = esp_wifi_set_config(interface, &snapshot->scratch);
            if (err == ESP_OK) err = wifi_radio_restore_disabled_pmf(interface, &snapshot->saved[index]);
        }
    } else {
        err = esp_wifi_get_config(interface, &snapshot->scratch);
        if (err == ESP_OK && !wifi_radio_config_equal(interface, &snapshot->saved[index], &snapshot->scratch)) {
            err = ESP_ERR_INVALID_RESPONSE;
        }
    }
    esp32_mquickjs_wireless_secure_zero(&snapshot->scratch, sizeof(snapshot->scratch));
    return err;
}

static esp_err_t wifi_radio_restart_configs_replay_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (!wifi_radio_restart_configs_owner(token) || !s_config_restart.captured ||
        s_config_restart.owner.identity != token->identity || s_config_restart.owner.generation != token->generation ||
        !s_radio.driver_owned || !s_radio.storage_configured || s_radio.started || s_radio.stop_required ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED) return ESP_ERR_INVALID_STATE;
    if (s_config_restart.replay_generation != s_radio.generation) {
        s_config_restart.replay_generation = s_radio.generation;
        s_config_restart.phase = RESTART_CONFIG_RAM;
        s_config_restart.start_phase = 0;
        s_config_restart.interval_revision = 0;
        s_config_restart.rate_completed = 0;
#if ESP32_MQUICKJS_WIFI_HE_STATISTICS_AVAILABLE
        s_config_restart.he_completed = 0;
#endif
        memset(s_config_restart.rate_identity, 0, sizeof(s_config_restart.rate_identity));
    }
    wifi_radio_restart_configs_t *snapshot = s_config_restart.snapshot;
    if (snapshot == NULL) { s_config_restart.phase = RESTART_CONFIG_DONE; return ESP_OK; }
    if (s_config_restart.source_generation == s_radio.generation) return ESP_ERR_INVALID_STATE;
    static const char *const stages[] = {
        "restart-config-ram",
        "restart-config-disable",
        "restart-config-disable-readback",
        "restart-country-write",
        "restart-country-readback",
        "restart-event-mask-write",
        "restart-event-mask-readback",
        "restart-mac-mode",
        "restart-mac-mode-readback",
        "restart-mac-temporary",
        "restart-ap-mac-write",
        "restart-ap-mac-readback",
        "restart-station-mac-write",
        "restart-station-mac-readback",
        "restart-config-enable",
        "restart-station-write",
        "restart-station-readback",
        "restart-ap-write",
        "restart-ap-readback",
        "restart-phy-band-replay",
        "restart-station-phy-write",
        "restart-station-phy-readback",
        "restart-ap-phy-write",
        "restart-ap-phy-readback",
        "restart-band-restore",
        "restart-power-save-write",
        "restart-power-save-readback",
        "restart-config-mode",
        "restart-config-mode-readback",
        "restart-tx-rate-replay",
        "restart-interval-replay"
    };
    while (s_config_restart.phase < RESTART_CONFIG_DONE) {
        unsigned phase = s_config_restart.phase;
        esp_err_t err = ESP_OK;
        wifi_mode_t actual;
        const char *stage = stages[phase];
        wifi_country_t country;
        uint8_t mac[6];
        uint32_t event_mask;
        wifi_ps_type_t power_save;
        switch (phase) {
        case RESTART_CONFIG_RAM:
            err = esp_wifi_set_storage(WIFI_STORAGE_RAM);
            if (err == ESP_OK) {
                taskENTER_CRITICAL(&s_radio.lock); s_radio.storage = WIFI_STORAGE_RAM; taskEXIT_CRITICAL(&s_radio.lock);
            }
            break;
        case RESTART_CONFIG_DISABLE:
            err = esp_wifi_set_mode(WIFI_MODE_NULL);
            if (err == ESP_OK) {
                taskENTER_CRITICAL(&s_radio.lock); s_radio.effective_mode = WIFI_MODE_NULL; taskEXIT_CRITICAL(&s_radio.lock);
            }
            break;
        case RESTART_CONFIG_DISABLE_READ:
            err = esp_wifi_get_mode(&actual);
            if (err == ESP_OK && actual != WIFI_MODE_NULL) err = ESP_ERR_INVALID_RESPONSE;
            break;
        case RESTART_CONFIG_COUNTRY:
            country = snapshot->country;
            /* Country's maximum-power member is observation-only in the SDK.
             * Explicit TX-power restoration is a separate post-start control. */
            err = esp_wifi_set_country(&country);
            break;
        case RESTART_CONFIG_COUNTRY_READ:
            memset(&country, 0, sizeof(country));
            err = esp_wifi_get_country(&country);
            if (err == ESP_OK && !wifi_radio_country_equal(&snapshot->country, &country, false)) err = ESP_ERR_INVALID_RESPONSE;
            break;
        case RESTART_CONFIG_EVENT_MASK:
            err = esp_wifi_set_event_mask(snapshot->event_mask);
            break;
        case RESTART_CONFIG_EVENT_MASK_READ:
            err = esp_wifi_get_event_mask(&event_mask);
            if (err == ESP_OK && event_mask != snapshot->event_mask) err = ESP_ERR_INVALID_RESPONSE;
            break;
        case RESTART_CONFIG_MAC_MODE:
            /* The SDK rejects MAC writes for interfaces absent from mode.
             * Selecting the saved interface mask does not set its START flag;
             * MAC replacement therefore emits no Station/AP activation. */
            err = esp_wifi_set_mode((wifi_mode_t)snapshot->mask);
            if (err == ESP_OK) {
                taskENTER_CRITICAL(&s_radio.lock);
                s_radio.effective_mode = (wifi_mode_t)snapshot->mask;
                taskEXIT_CRITICAL(&s_radio.lock);
            }
            break;
        case RESTART_CONFIG_MAC_MODE_READ:
            err = esp_wifi_get_mode(&actual);
            if (err == ESP_OK && actual != (wifi_mode_t)snapshot->mask) err = ESP_ERR_INVALID_RESPONSE;
            break;
        case RESTART_CONFIG_MAC_TEMP:
            if (snapshot->mask & WIFI_MODE_AP) err = wifi_radio_restart_mac_temporary(snapshot, &stage);
            break;
        case RESTART_CONFIG_MAC_AP:
            if (snapshot->mask & WIFI_MODE_AP) {
                memcpy(mac, snapshot->mac[1], 6);
                err = esp_wifi_set_mac(WIFI_IF_AP, mac);
            }
            break;
        case RESTART_CONFIG_MAC_AP_READ:
            if (snapshot->mask & WIFI_MODE_AP) {
                err = esp_wifi_get_mac(WIFI_IF_AP, mac);
                if (err == ESP_OK && memcmp(mac, snapshot->mac[1], 6) != 0) err = ESP_ERR_INVALID_RESPONSE;
            }
            break;
        case RESTART_CONFIG_MAC_STA:
            memcpy(mac, snapshot->mac[0], 6);
            err = esp_wifi_set_mac(WIFI_IF_STA, mac);
            break;
        case RESTART_CONFIG_MAC_STA_READ:
            err = esp_wifi_get_mac(WIFI_IF_STA, mac);
            if (err == ESP_OK && memcmp(mac, snapshot->mac[0], 6) != 0) err = ESP_ERR_INVALID_RESPONSE;
            break;
        case RESTART_CONFIG_PHY_MODE:
            err = wifi_radio_restart_band_prepare_locked(token, (wifi_mode_t)snapshot->mask, &stage);
            break;
        case RESTART_CONFIG_STA_PHY_WRITE:
            err = wifi_radio_write_phy(WIFI_IF_STA, &snapshot->protocols[0], &snapshot->bandwidths[0]);
            break;
        case RESTART_CONFIG_STA_PHY_READ:
            err = wifi_radio_restart_phy_io(snapshot, 0, true);
            break;
        case RESTART_CONFIG_AP_PHY_WRITE:
            if (snapshot->mask & WIFI_MODE_AP)
                err = wifi_radio_write_phy(WIFI_IF_AP, &snapshot->protocols[1], &snapshot->bandwidths[1]);
            break;
        case RESTART_CONFIG_AP_PHY_READ:
            if (snapshot->mask & WIFI_MODE_AP) err = wifi_radio_restart_phy_io(snapshot, 1, true);
            break;
        case RESTART_CONFIG_BAND_RESTORE:
            err = wifi_radio_restart_band_select_locked(token, (wifi_mode_t)snapshot->mask, snapshot->band_mode, &stage);
            break;
        case RESTART_CONFIG_PS:
            err = esp_wifi_set_ps(snapshot->power_save);
            break;
        case RESTART_CONFIG_PS_READ:
            err = esp_wifi_get_ps(&power_save);
            if (err == ESP_OK && power_save != snapshot->power_save) err = ESP_ERR_INVALID_RESPONSE;
            break;
        case RESTART_CONFIG_ENABLE:
            err = esp_wifi_set_mode((wifi_mode_t)snapshot->mask);
            if (err == ESP_OK) {
                taskENTER_CRITICAL(&s_radio.lock); s_radio.effective_mode = (wifi_mode_t)snapshot->mask; taskEXIT_CRITICAL(&s_radio.lock);
            }
            break;
        case RESTART_CONFIG_STA_WRITE:
        case RESTART_CONFIG_STA_READ:
            err = wifi_radio_restart_config_io(snapshot, 0, phase == RESTART_CONFIG_STA_WRITE);
            break;
        case RESTART_CONFIG_AP_WRITE:
        case RESTART_CONFIG_AP_READ:
            if (snapshot->mask & WIFI_MODE_AP)
                err = wifi_radio_restart_config_io(snapshot, 1, phase == RESTART_CONFIG_AP_WRITE);
            break;
        case RESTART_CONFIG_MODE:
            err = esp_wifi_set_mode(s_config_restart.mode);
            if (err == ESP_OK) {
                taskENTER_CRITICAL(&s_radio.lock); s_radio.effective_mode = s_config_restart.mode; taskEXIT_CRITICAL(&s_radio.lock);
            }
            break;
        case RESTART_CONFIG_MODE_READ:
            err = esp_wifi_get_mode(&actual);
            if (err == ESP_OK && actual != s_config_restart.mode) err = ESP_ERR_INVALID_RESPONSE;
            break;
        case RESTART_CONFIG_RATES: {
            esp32_mquickjs_wifi_tx_rate_write_t output;
            err = esp32_mquickjs_wifi_tx_rate_replay(&s_tx_rates, s_radio.generation, &snapshot->rates,
                &s_config_restart.rate_completed, wifi_radio_write_tx_rate, NULL, &output);
            for (unsigned i = 0; i < 2; ++i)
                if (s_config_restart.rate_completed & (1U << i)) s_config_restart.rate_identity[i] = s_tx_rates.records[i].write_identity;
            break;
        }
        case RESTART_CONFIG_INTERVAL: {
            esp32_mquickjs_wifi_interval_result_t result;
            err = esp32_mquickjs_wifi_interval_replay(&s_interval, s_radio.generation, &snapshot->interval,
                wifi_radio_interval_writer, NULL, &result);
            if (err == ESP_OK) s_config_restart.interval_revision = result.revision;
            break;
        }
        }
        if (err != ESP_OK) return wifi_radio_restart_configs_record(stage, err, true);
        ++s_config_restart.phase;
    }
    return ESP_OK;
}

static bool wifi_radio_restart_configs_ready_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    if (!s_config_restart.captured) return s_config_restart.snapshot == NULL;
    return wifi_radio_restart_configs_owner(token) && s_config_restart.owner.identity == token->identity &&
        s_config_restart.owner.generation == token->generation && s_config_restart.mode == mode &&
        s_config_restart.replay_generation == s_radio.generation && s_config_restart.phase == RESTART_CONFIG_DONE;
}

static esp_err_t wifi_radio_restart_configs_pre_start_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    if (!s_config_restart.captured) return s_config_restart.snapshot == NULL ? ESP_OK : ESP_ERR_INVALID_STATE;
    if (!wifi_radio_restart_configs_ready_locked(token, mode) ||
        !s_radio.driver_owned || !s_radio.storage_configured || s_radio.started || s_radio.stop_required ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED || s_radio.fault_stage != NULL ||
        s_radio.cleanup_stage != NULL || s_radio.operation.identity != 0U || s_radio.wake_locks != 0U ||
        s_radio.promiscuous_claimed || s_radio.restart_required) return ESP_ERR_INVALID_STATE;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) return ESP_ERR_INVALID_STATE;
    wifi_radio_restart_configs_t *snapshot = s_config_restart.snapshot;
    if (snapshot == NULL) return ESP_OK;
    /* AP START can save its chosen channel through the SDK's NVS path. Keep
     * that implicit write, and all explicit restoration, in RAM until final
     * acceptance. Restoring FLASH before START can persist intermediate state. */
    if (s_radio.storage != WIFI_STORAGE_RAM)
        return wifi_radio_restart_configs_record("restart-storage-admission", ESP_ERR_INVALID_STATE, true);
    for (unsigned i = 0; i < 2; ++i) {
        if (!(snapshot->mask & (1U << i))) continue;
        esp_err_t err = wifi_radio_restart_config_io(snapshot, i, false);
        if (err != ESP_OK) return wifi_radio_restart_configs_record(
            i == 0 ? "restart-station-pre-start-readback" : "restart-ap-pre-start-readback", err, true);
    }
    /* AP preferred/automatic channel may differ from the saved home channel.
     * The activation path starts AP-only and uses SDK-supported CSA before
     * enabling STA, retaining the original AP configuration throughout. */
    if ((mode & WIFI_MODE_AP) && !(snapshot->mask & WIFI_MODE_AP))
        return wifi_radio_restart_configs_record("restart-ap-channel-admission", ESP_ERR_INVALID_STATE, true);
    return ESP_OK;
}

