99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
/* Poll observations only while an accepted AP CSA settles. Preserve SDK
 * failures independently of an ordinary not-yet-matching channel snapshot. */
static esp_err_t wifi_radio_restart_ap_channel_matches(
    const wifi_radio_restart_configs_t *snapshot, bool *matches)
{
    *matches = false;
    wifi_band_mode_t mode;
    wifi_band_t band;
    esp_err_t err = wifi_radio_band_snapshot(&mode, &band);
    if (err != ESP_OK) return err;
    uint8_t primary, home;
    wifi_second_chan_t secondary = WIFI_SECOND_CHAN_NONE, home_secondary = WIFI_SECOND_CHAN_NONE;
    err = esp_wifi_get_channel(&primary, &secondary);
    if (err == ESP_OK) err = esp_wifi_get_home_channel(&home, &home_secondary);
    if (err != ESP_OK) return err;
    *matches = mode == snapshot->band_mode && band == snapshot->band &&
        primary == snapshot->primary && home == snapshot->primary &&
        secondary == snapshot->secondary && home_secondary == snapshot->secondary;
    return ESP_OK;
}

static esp_err_t wifi_radio_restart_ap_channel_wait_inner(
    esp32_mquickjs_runtime_t *runtime, const wifi_radio_restart_configs_t *snapshot)
{
    TickType_t started = xTaskGetTickCount();
    TickType_t timeout = esp32_mquickjs_wifi_wait_remaining(pdMS_TO_TICKS(WIFI_RADIO_START_EVENT_TIMEOUT_MS));
    for (;;) {
        if (!esp32_mquickjs_cooperate(runtime)) return ESP_ERR_INVALID_STATE;
        bool matches;
        esp_err_t err = wifi_radio_restart_ap_channel_matches(snapshot, &matches);
        if (err != ESP_OK || matches) return err;
        if ((TickType_t)(xTaskGetTickCount() - started) >= timeout) return ESP_ERR_TIMEOUT;
        vTaskDelay(1);
    }
}

static esp_err_t wifi_radio_restart_ap_channel_wait(const wifi_radio_restart_configs_t *snapshot)
{
#if ESP32_MQUICKJS_WIFI_MESH_AVAILABLE
    if (wifi_radio_mesh_worker_locked()) return wifi_radio_restart_ap_channel_wait_inner(NULL, snapshot);
#endif
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    esp32_mquickjs_native_wait_t wait;
    esp32_mquickjs_native_wait_begin(runtime, &wait);
    esp_err_t err = wifi_radio_restart_ap_channel_wait_inner(runtime, snapshot);
    esp32_mquickjs_native_wait_end(runtime, &wait);
    return err;
}

/* All output leases are staged under the exact lifecycle token. AP-only mode
 * permits SDK CSA even if a native client arrives before publication. APSTA
 * forbids that mutation with clients: add STA only after AP channel acceptance.
 * Never update live AP config, which the pinned SDK implements as AP STOP/START.
 * Any failed write/event/readback leaves the physical attempt for cleanup. */
static esp_err_t wifi_radio_restart_configs_start_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode,
    esp32_mquickjs_wifi_radio_lease_t *lease)
{
    wifi_radio_restart_configs_t *snapshot = s_config_restart.snapshot;
    if (!s_config_restart.captured || snapshot == NULL || !(mode & WIFI_MODE_AP))
        return wifi_radio_ensure_started_locked(lease);
    if (!wifi_radio_restart_configs_ready_locked(token, mode) || !wifi_radio_lease_valid(lease) ||
        !s_radio.driver_owned || !s_radio.storage_configured || s_radio.storage != WIFI_STORAGE_RAM ||
        s_radio.started || s_radio.stop_required || s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED ||
        s_radio.operation.identity != 0U || s_radio.wake_locks != 0U || s_radio.promiscuous_claimed ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required)
        return ESP_ERR_INVALID_STATE;
    const char *stage = "restart-ap-mode";
    esp_err_t err = ESP_OK;
    if (mode == WIFI_MODE_APSTA) {
        err = esp_wifi_set_mode(WIFI_MODE_AP);
        if (err != ESP_OK) goto failed;
        taskENTER_CRITICAL(&s_radio.lock); s_radio.effective_mode = WIFI_MODE_AP; taskEXIT_CRITICAL(&s_radio.lock);
    }
    wifi_mode_t actual;
    stage = "restart-ap-mode-readback";
    err = esp_wifi_get_mode(&actual);
    if (err == ESP_OK && actual != WIFI_MODE_AP) err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) goto failed;
    stage = "restart-ap-start";
    err = wifi_radio_start_stopped_locked(WIFI_MODE_AP, true);
    if (err != ESP_OK) goto failed;
    stage = "restart-ap-channel-write";
    err = esp_wifi_set_channel(snapshot->primary, snapshot->secondary);
    if (err != ESP_OK) goto failed;
    stage = "restart-ap-channel-wait";
    err = wifi_radio_restart_ap_channel_wait(snapshot);
    if (err != ESP_OK) goto failed;
    if (mode == WIFI_MODE_APSTA) {
        stage = "restart-station-start-events";
        err = wifi_radio_begin_events(RADIO_EVENTS_STA_START, WIFI_MODE_STA);
        if (err != ESP_OK) goto failed;
        wifi_radio_set_state(ESP32_MQUICKJS_WIFI_RADIO_STARTING);
        stage = "restart-station-start-mode";
        err = esp_wifi_set_mode(WIFI_MODE_APSTA);
        if (err != ESP_OK) goto failed;
        taskENTER_CRITICAL(&s_radio.lock); s_radio.effective_mode = WIFI_MODE_APSTA; taskEXIT_CRITICAL(&s_radio.lock);
        stage = "restart-station-start-events";
        err = wifi_radio_wait_events();
        if (err != ESP_OK) goto failed;
        wifi_radio_set_state(ESP32_MQUICKJS_WIFI_RADIO_STARTED);
    }
    stage = "restart-activation-mode-readback";
    err = esp_wifi_get_mode(&actual);
    if (err == ESP_OK && actual != mode) err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) goto failed;
    stage = "restart-activation-channel-readback";
    err = wifi_radio_restart_channel_read(snapshot, true);
    if (err != ESP_OK) goto failed;
    return ESP_OK;
failed:
    return wifi_radio_restart_configs_record(stage, err, true);
}

enum { RESTART_START_CHANNEL, RESTART_START_CHANNEL_READ, RESTART_START_POWER,
    RESTART_START_POWER_READ, RESTART_START_STA_INACTIVE, RESTART_START_STA_INACTIVE_READ,
    RESTART_START_AP_INACTIVE, RESTART_START_AP_INACTIVE_READ,
    RESTART_START_SCAN_PARAMETERS, RESTART_START_SCAN_PARAMETERS_READ, RESTART_START_HE_STATISTICS,
    RESTART_START_TWT_POLICY, RESTART_START_DONE };

/* START and policy replay have finished, but staged leases are unpublished.
 * Restoring a prior SDK observation requires equality, not the lower ceiling
 * accepted by an explicit new setTxPower request. */
static esp_err_t wifi_radio_restart_configs_post_start_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (!s_config_restart.captured) return s_config_restart.snapshot == NULL ? ESP_OK : ESP_ERR_INVALID_STATE;
    if (!wifi_radio_restart_configs_ready_locked(token, s_config_restart.mode)) return ESP_ERR_INVALID_STATE;
    if (s_config_restart.snapshot == NULL) return ESP_OK;
    if (!s_radio.started || s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED ||
        !s_radio.storage_configured || s_radio.storage != WIFI_STORAGE_RAM ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL) return ESP_ERR_INVALID_STATE;
    if (s_config_restart.start_phase == RESTART_START_CHANNEL) {
        /* set_channel is START-only and does not survive STOP. The restored
         * Station is not scanning/connecting and its owners remain staged.
         * AP activation already restored its channel in AP-only mode and,
         * for APSTA, fenced STA startup. This stage only verifies AP/APSTA. */
        if (s_config_restart.mode == WIFI_MODE_STA) {
            esp_err_t err = esp_wifi_set_channel(s_config_restart.snapshot->primary, s_config_restart.snapshot->secondary);
            if (err != ESP_OK) return wifi_radio_restart_configs_record("restart-channel-write", err, true);
        }
        s_config_restart.start_phase = RESTART_START_CHANNEL_READ;
    }
    if (s_config_restart.start_phase == RESTART_START_CHANNEL_READ) {
        esp_err_t err = wifi_radio_restart_channel_read(s_config_restart.snapshot, true);
        if (err != ESP_OK) return wifi_radio_restart_configs_record("restart-channel-readback", err, true);
        s_config_restart.start_phase = RESTART_START_POWER;
    }
    if (s_config_restart.start_phase == RESTART_START_POWER) {
        esp_err_t err = esp_wifi_set_max_tx_power(s_config_restart.snapshot->tx_power);
        if (err != ESP_OK) return wifi_radio_restart_configs_record("restart-tx-power-write", err, true);
        s_config_restart.start_phase = RESTART_START_POWER_READ;
    }
    if (s_config_restart.start_phase == RESTART_START_POWER_READ) {
        int8_t actual;
        esp_err_t err = esp_wifi_get_max_tx_power(&actual);
        if (err == ESP_OK && actual != s_config_restart.snapshot->tx_power) err = ESP_ERR_INVALID_RESPONSE;
        if (err != ESP_OK) return wifi_radio_restart_configs_record("restart-tx-power-readback", err, true);
        s_config_restart.start_phase = RESTART_START_STA_INACTIVE;
    }
    while (s_config_restart.start_phase < RESTART_START_SCAN_PARAMETERS) {
        unsigned phase = s_config_restart.start_phase - RESTART_START_STA_INACTIVE;
        unsigned index = phase / 2U;
        bool readback = (phase & 1U) != 0U;
        if (s_config_restart.snapshot->inactive_saved_mask & (uint8_t)s_config_restart.mode & (1U << index)) {
            wifi_interface_t interface = index == 0 ? WIFI_IF_STA : WIFI_IF_AP;
            uint16_t wanted = s_config_restart.snapshot->inactive_time[index], actual;
            const char *stage = index == 0
                ? (readback ? "restart-station-inactive-readback" : "restart-station-inactive-write")
                : (readback ? "restart-ap-inactive-readback" : "restart-ap-inactive-write");
            /* Storage stays RAM until all final acceptance checks pass. A
             * failed write retains its phase and the original frozen value. */
            esp_err_t err = readback ? esp_wifi_get_inactive_time(interface, &actual)
                                     : esp_wifi_set_inactive_time(interface, wanted);
            if (err == ESP_OK && readback && actual != wanted) err = ESP_ERR_INVALID_RESPONSE;
            if (readback || err != ESP_OK) wifi_radio_inactive_history_record(index, wanted, err);
            if (err != ESP_OK) return wifi_radio_restart_configs_record(stage, err, true);
        }
        ++s_config_restart.start_phase;
    }
    if (s_config_restart.start_phase == RESTART_START_SCAN_PARAMETERS) {
        if (s_config_restart.snapshot->scan_parameters_known && (s_config_restart.mode & WIFI_MODE_STA)) {
            esp_err_t error = wifi_scan_parameters_set_native(&s_config_restart.snapshot->scan_parameters);
            if (error != ESP_OK) return wifi_radio_restart_configs_record("restart-scan-parameters-write", error, true);
        }
        s_config_restart.start_phase = RESTART_START_SCAN_PARAMETERS_READ;
    }
    if (s_config_restart.start_phase == RESTART_START_SCAN_PARAMETERS_READ) {
        if (s_config_restart.snapshot->scan_parameters_known && (s_config_restart.mode & WIFI_MODE_STA)) {
            wifi_scan_default_params_t actual;
            esp_err_t error = wifi_radio_scan_parameters_observe_locked(&actual);
            if (error == ESP_OK && !wifi_scan_parameters_equal(&actual, &s_config_restart.snapshot->scan_parameters))
                error = ESP_ERR_INVALID_RESPONSE;
            if (error != ESP_OK) return wifi_radio_restart_configs_record("restart-scan-parameters-readback", error, true);
        }
        s_config_restart.start_phase = RESTART_START_HE_STATISTICS;
    }
    if (s_config_restart.start_phase == RESTART_START_HE_STATISTICS) {
#if ESP32_MQUICKJS_WIFI_HE_STATISTICS_AVAILABLE
        s_he_statistics.managed = true;
        esp_err_t error = esp32_mquickjs_wifi_he_statistics_restore(
            &s_config_restart.snapshot->he_statistics, &s_config_restart.he_completed);
        if (error != ESP_OK) return wifi_radio_restart_configs_record("restart-he-statistics", error, true);
#endif
        s_config_restart.start_phase = RESTART_START_TWT_POLICY;
    }
    if (s_config_restart.start_phase == RESTART_START_TWT_POLICY) {
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
        esp32_mquickjs_wifi_twt_control_t value = {.config = s_config_restart.snapshot->twt_policy};
        esp_err_t error = esp32_mquickjs_wifi_twt_sdk_control(ESP32_MQUICKJS_WIFI_TWT_WRITE_CONFIG, &value);
        if (error != ESP_OK) return wifi_radio_restart_configs_record("restart-twt-policy", error, true);
        s_twt_policy.value = value.config;
        s_twt_policy.known = true;
        s_twt_policy.pending = false;
#endif
        s_config_restart.start_phase = RESTART_START_DONE;
    }
    return ESP_OK;
}

static esp_err_t wifi_radio_restart_configs_verify_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    if (!wifi_radio_restart_configs_ready_locked(token, mode)) return ESP_ERR_INVALID_STATE;
    if (s_config_restart.snapshot == NULL) return ESP_OK;
    if (s_config_restart.start_phase != RESTART_START_DONE || !s_radio.started) return ESP_ERR_INVALID_STATE;
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    esp32_mquickjs_wifi_twt_control_t twt_value = {0};
    esp_err_t twt_error = esp32_mquickjs_wifi_twt_sdk_control(ESP32_MQUICKJS_WIFI_TWT_READ_CONFIG, &twt_value);
    if (twt_error == ESP_OK &&
        (twt_value.config.post_wakeup_event != s_config_restart.snapshot->twt_policy.post_wakeup_event ||
         twt_value.config.twt_enable_keep_alive != s_config_restart.snapshot->twt_policy.twt_enable_keep_alive))
        twt_error = ESP_ERR_INVALID_RESPONSE;
    if (twt_error != ESP_OK) return wifi_radio_restart_configs_record("restart-twt-policy-readback", twt_error, true);
#endif
#if ESP32_MQUICKJS_WIFI_HE_STATISTICS_AVAILABLE
    esp32_mquickjs_wifi_he_statistics_t he_actual;
    esp_err_t he_error = esp32_mquickjs_wifi_he_statistics_snapshot(&he_actual, false);
    if (he_error == ESP_OK && !wifi_he_statistics_equal(&he_actual, &s_config_restart.snapshot->he_statistics))
        he_error = ESP_ERR_INVALID_RESPONSE;
    if (he_error != ESP_OK) return wifi_radio_restart_configs_record("restart-he-statistics-readback", he_error, true);
#endif
    const esp32_mquickjs_wifi_tx_rate_snapshot_t *rates = &s_config_restart.snapshot->rates;
    if (s_config_restart.rate_completed != rates->mask || s_tx_rate_lease.identity != 0U || s_tx_rate_lease.restore_pending)
        return wifi_radio_restart_configs_record("restart-tx-rate-acceptance", ESP_ERR_INVALID_STATE, true);
    for (unsigned i = 0; i < 2; ++i) {
        if (!(rates->mask & (1U << i))) continue;
        const esp32_mquickjs_wifi_tx_rate_record_t *record = &s_tx_rates.records[i];
        const wifi_tx_rate_config_t *wanted = &rates->configs[i];
        if (!record->known || record->uncertain || record->generation != s_radio.generation ||
            record->write_identity != s_config_restart.rate_identity[i] || record->config.phymode != wanted->phymode ||
            record->config.rate != wanted->rate || record->config.ersu != wanted->ersu || record->config.dcm != wanted->dcm)
            return wifi_radio_restart_configs_record("restart-tx-rate-acceptance", ESP_ERR_INVALID_STATE, true);
    }
    /* There is no SDK interval getter. Verify the exclusive writer's accepted
     * revision/value, not an invented native readback or RF timing guarantee. */
    if (!s_interval.known || s_interval.uncertain || s_interval.restore_pending || s_interval.owner.identity != 0U ||
        s_interval.generation != s_radio.generation || s_interval.revision != s_config_restart.interval_revision ||
        s_interval.value != s_config_restart.snapshot->interval.value)
        return wifi_radio_restart_configs_record("restart-interval-acceptance", ESP_ERR_INVALID_STATE, true);
    if (s_config_restart.snapshot->scan_parameters_known && (mode & WIFI_MODE_STA)) {
        wifi_scan_default_params_t actual;
        esp_err_t error = wifi_radio_scan_parameters_observe_locked(&actual);
        if (error == ESP_OK && !wifi_scan_parameters_equal(&actual, &s_config_restart.snapshot->scan_parameters))
            error = ESP_ERR_INVALID_RESPONSE;
        if (error != ESP_OK) return wifi_radio_restart_configs_record("restart-scan-parameters-final-readback", error, true);
    }
    int8_t actual_power;
    esp_err_t power_error = esp_wifi_get_max_tx_power(&actual_power);
    if (power_error == ESP_OK && actual_power != s_config_restart.snapshot->tx_power) power_error = ESP_ERR_INVALID_RESPONSE;
    if (power_error != ESP_OK) return wifi_radio_restart_configs_record("restart-tx-power-final-readback", power_error, true);
    const char *stage = NULL;
    esp_err_t global_error = wifi_radio_restart_inactive_read(s_config_restart.snapshot,
        s_config_restart.snapshot->inactive_saved_mask & (uint8_t)mode, true, &stage);
    if (global_error != ESP_OK) return wifi_radio_restart_configs_record(stage, global_error, true);
    global_error = wifi_radio_restart_phy_read(s_config_restart.snapshot, true, &stage);
    if (global_error != ESP_OK) return wifi_radio_restart_configs_record(stage, global_error, true);
    /* Full AUTO PHY replay alone is insufficient. The final mode, current
     * band and current/home channel must still match the frozen predecessor. */
    global_error = wifi_radio_restart_channel_read(s_config_restart.snapshot, true);
    if (global_error != ESP_OK)
        return wifi_radio_restart_configs_record("restart-band-channel-final-readback", global_error, true);
    global_error = wifi_radio_restart_globals_read(s_config_restart.snapshot, true, &stage);
    if (global_error != ESP_OK) return wifi_radio_restart_configs_record(stage, global_error, true);
    for (unsigned i = 0; i < 2; ++i) {
        if (!(s_config_restart.snapshot->mask & (1U << i))) continue;
        esp_err_t err = wifi_radio_restart_config_io(s_config_restart.snapshot, i, false);
        if (err != ESP_OK) return wifi_radio_restart_configs_record(
            i == 0 ? "restart-station-final-readback" : "restart-ap-final-readback", err, true);
    }
    return ESP_OK;
}

/* Called by the real resume path before owner publication. Verification and
 * SDK START happen while storage is RAM. Only then restore the caller's policy
 * for subsequent writes. set_storage has no getter: record SDK acceptance,
 * and keep failure unknown instead of claiming rollback or retrying it here. */
static esp_err_t wifi_radio_restart_configs_commit_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    wifi_radio_restart_configs_t *snapshot = s_config_restart.snapshot;
    if (s_config_restart.captured && snapshot != NULL &&
        (!s_radio.driver_owned || !s_radio.storage_configured || s_radio.storage != WIFI_STORAGE_RAM ||
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED ||
         s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL)) return ESP_ERR_INVALID_STATE;
    esp_err_t err = wifi_radio_restart_configs_verify_locked(token, mode);
    if (err != ESP_OK || snapshot == NULL) return err;
    /* Transfer hidden intent before the frozen allocation can be released.
     * It remains unobserved in this new driver until that interface is enabled. */
    if (snapshot->scan_parameters_known && !(mode & WIFI_MODE_STA)) {
        s_scan_parameters.value = snapshot->scan_parameters;
        s_scan_parameters.generation = s_radio.generation;
        s_scan_parameters.known = s_scan_parameters.pending = true;
        s_scan_parameters.error = ESP_OK;
        s_scan_parameters.attempted = false;
    }
    uint8_t hidden = snapshot->inactive_saved_mask & ~((uint8_t)mode);
    if (s_inactive_history.generation != s_radio.generation) {
        memset(&s_inactive_history, 0, sizeof(s_inactive_history));
        s_inactive_history.generation = s_radio.generation;
    }
    for (unsigned i = 0; i < 2; ++i) {
        uint8_t bit = (uint8_t)(1U << i);
        if (!(hidden & bit)) continue;
        s_inactive_history.pending_values[i] = snapshot->inactive_time[i];
        s_inactive_history.pending |= bit;
        s_inactive_history.attempted &= (uint8_t)~bit;
        s_inactive_history.persistent &= (uint8_t)~bit;
        s_inactive_history.known &= (uint8_t)~bit;
    }
    /* Off restoration keeps RAM through final STOP and mode=NULL. The source
     * remains frozen until helper retirement and lifecycle completion. */
    if (snapshot->restore_off) return ESP_OK;
    return wifi_radio_restart_configs_commit_storage_locked(token);
}

static esp_err_t wifi_radio_restart_configs_commit_storage_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_restart_configs_t *snapshot = s_config_restart.snapshot;
    if (!wifi_radio_restart_configs_owner(token) || !s_config_restart.captured || snapshot == NULL ||
        s_config_restart.owner.identity != token->identity || s_config_restart.owner.generation != token->generation ||
        !s_radio.driver_owned || !s_radio.storage_configured || s_radio.storage != WIFI_STORAGE_RAM ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL) return ESP_ERR_INVALID_STATE;
    if (snapshot->restore_off && (s_radio.started || s_radio.stop_required ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED || s_radio.effective_mode != WIFI_MODE_NULL))
        return ESP_ERR_INVALID_STATE;
    if (snapshot->storage == WIFI_STORAGE_RAM) return ESP_OK;
    if (snapshot->storage != WIFI_STORAGE_FLASH) return ESP_ERR_INVALID_STATE;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.storage_configured = false;
    taskEXIT_CRITICAL(&s_radio.lock);
    esp_err_t err = esp_wifi_set_storage(snapshot->storage);
    if (err != ESP_OK) return wifi_radio_restart_configs_record("restart-storage-commit", err, true);
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.storage = snapshot->storage;
    s_radio.storage_configured = true;
    taskEXIT_CRITICAL(&s_radio.lock);
    return ESP_OK;
}

uint32_t esp32_mquickjs_wifi_radio_restart_snapshot_bytes(void)
{
    wifi_radio_operation_lock();
    uint32_t bytes = s_config_restart.snapshot == NULL ? 0U : sizeof(*s_config_restart.snapshot);
    wifi_radio_operation_unlock();
    return bytes;
}

/* These helpers run inside the Radio mutation lane. PHY writes require STOP;
 * country-only transactions also support an idle, unassociated Station. */
typedef struct {
    wifi_country_t country;
    wifi_protocols_t protocols[2], desired_protocols[2];
    wifi_bandwidths_t bandwidths[2], desired_bandwidths[2];
    wifi_ps_type_t power_save;
    uint8_t active_bands;
    bool country_touched, phy_touched[2], power_save_touched;
} wifi_radio_controls_snapshot_t;

static bool wifi_radio_country_valid(const wifi_country_t *c)
{
    return !(!((c->cc[0] >= 'A' && c->cc[0] <= 'Z' && c->cc[1] >= 'A' && c->cc[1] <= 'Z') ||
              (c->cc[0] == '0' && c->cc[1] == '1')) ||
            (c->cc[2] != '\0' && c->cc[2] != ' ' && c->cc[2] != 'I' && c->cc[2] != 'O' && c->cc[2] != 'X') ||
            (c->policy != WIFI_COUNTRY_POLICY_AUTO && c->policy != WIFI_COUNTRY_POLICY_MANUAL) ||
            c->schan < 1 || c->nchan < 1 || (unsigned)c->schan + c->nchan > 15);
}

static bool wifi_radio_country_equal(const wifi_country_t *a, const wifi_country_t *b,
    bool include_power)
{
    /* SDK normalizes an unspecified environment octet to a space. */
    char a_env = a->cc[2] == '\0' ? ' ' : a->cc[2];
    char b_env = b->cc[2] == '\0' ? ' ' : b->cc[2];
    return a->cc[0] == b->cc[0] && a->cc[1] == b->cc[1] && a_env == b_env &&
        a->schan == b->schan && a->nchan == b->nchan && a->policy == b->policy &&
        (!include_power || a->max_tx_power == b->max_tx_power)
#if CONFIG_SOC_WIFI_SUPPORT_5G
        && a->wifi_5g_channel_mask == b->wifi_5g_channel_mask
#endif
        ;
}

