99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
static esp_err_t wifi_radio_validate_protocol(uint16_t value, bool ghz5)
{
    uint16_t base = ghz5 ? WIFI_PROTOCOL_11A : WIFI_PROTOCOL_11B;
    uint16_t allowed = base | WIFI_PROTOCOL_11N | WIFI_PROTOCOL_11AX |
        (ghz5 ? WIFI_PROTOCOL_11AC : WIFI_PROTOCOL_11G | WIFI_PROTOCOL_LR);
    if (value == 0 || (value & ~allowed) != 0) return ESP_ERR_INVALID_ARG;
#if !CONFIG_SOC_WIFI_SUPPORT_5G
    if (ghz5) return ESP_ERR_NOT_SUPPORTED;
#endif
#if !CONFIG_SOC_WIFI_HE_SUPPORT
    if (value & WIFI_PROTOCOL_11AX) return ESP_ERR_NOT_SUPPORTED;
#endif
    /* Preserve LR as a bitmap; never expand it into an unrelated PHY. */
    uint16_t regular = value & ~WIFI_PROTOCOL_LR;
    if (regular == 0) return ESP_OK;
    if (!(regular & base)) return ESP_ERR_INVALID_ARG;
    if (!ghz5 && (regular & WIFI_PROTOCOL_11N) && !(regular & WIFI_PROTOCOL_11G))
        return ESP_ERR_INVALID_ARG;
    if ((regular & (WIFI_PROTOCOL_11AC | WIFI_PROTOCOL_11AX)) && !(regular & WIFI_PROTOCOL_11N))
        return ESP_ERR_INVALID_ARG;
    if (ghz5 && (regular & WIFI_PROTOCOL_11AX) && !(regular & WIFI_PROTOCOL_11AC))
        return ESP_ERR_INVALID_ARG;
    return ESP_OK;
}

esp_err_t esp32_mquickjs_wifi_radio_validate_config_controls(wifi_mode_t mode,
    const esp32_mquickjs_wifi_radio_config_controls_t *controls)
{
    if (mode != WIFI_MODE_STA && mode != WIFI_MODE_AP && mode != WIFI_MODE_APSTA)
        return ESP_ERR_INVALID_ARG;
    if (controls == NULL) return ESP_OK;
    if (controls->country_set) {
        const wifi_country_t *c = &controls->country;
        if (!((c->cc[0] >= 'A' && c->cc[0] <= 'Z' && c->cc[1] >= 'A' && c->cc[1] <= 'Z') ||
              (c->cc[0] == '0' && c->cc[1] == '1')) ||
            (c->policy != WIFI_COUNTRY_POLICY_AUTO && c->policy != WIFI_COUNTRY_POLICY_MANUAL))
            return ESP_ERR_INVALID_ARG;
        if (controls->country_by_code) {
            if (c->cc[2] != '\0') return ESP_ERR_INVALID_ARG;
        } else {
            if ((c->cc[2] != '\0' && c->cc[2] != ' ' && c->cc[2] != 'O' &&
                 c->cc[2] != 'I' && c->cc[2] != 'X') || c->schan < 1 ||
                c->nchan < 1 || (unsigned)c->schan + c->nchan > 15 || c->max_tx_power != 0)
                return ESP_ERR_INVALID_ARG;
#if CONFIG_SOC_WIFI_SUPPORT_5G
            uint32_t known = 0;
            for (unsigned ch = 15; ch <= 177; ++ch)
                known |= esp32_mquickjs_wifi_radio_5ghz_channel_bit((uint8_t)ch);
            if ((c->wifi_5g_channel_mask & ~known) != 0 ||
                (c->wifi_5g_channel_mask && c->policy != WIFI_COUNTRY_POLICY_MANUAL))
                return ESP_ERR_INVALID_ARG;
#endif
        }
    }
    if (controls->power_save_set && (!(mode & WIFI_MODE_STA) ||
        (controls->power_save != WIFI_PS_NONE && controls->power_save != WIFI_PS_MIN_MODEM &&
         controls->power_save != WIFI_PS_MAX_MODEM))) return ESP_ERR_INVALID_ARG;
    for (size_t i = 0; i < 2; ++i) {
        unsigned bands = controls->protocol_bands[i] | controls->bandwidth_bands[i];
        if ((bands & ~3U) || (bands && !(mode & (i == 0 ? WIFI_MODE_STA : WIFI_MODE_AP))))
            return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
        if (i == 1 && bands) return ESP_ERR_NOT_SUPPORTED;
#endif
#if !CONFIG_SOC_WIFI_SUPPORT_5G
        if (bands & 2U) return ESP_ERR_NOT_SUPPORTED;
#endif
        for (unsigned band = 1; band <= 2; band <<= 1) {
            if (controls->protocol_bands[i] & band) {
                esp_err_t err = wifi_radio_validate_protocol(band == 1 ?
                    controls->protocols[i].ghz_2g : controls->protocols[i].ghz_5g, band == 2);
                if (err != ESP_OK) return err;
            }
            if (controls->bandwidth_bands[i] & band) {
                wifi_bandwidth_t bw = band == 1 ? controls->bandwidths[i].ghz_2g : controls->bandwidths[i].ghz_5g;
                if (bw != WIFI_BW20 && bw != WIFI_BW40) return ESP_ERR_INVALID_ARG;
                if ((controls->protocol_bands[i] & band) && bw == WIFI_BW40) {
                    uint16_t p = band == 1 ? controls->protocols[i].ghz_2g : controls->protocols[i].ghz_5g;
                    if (!(p & WIFI_PROTOCOL_11N) || (p & (WIFI_PROTOCOL_11AC | WIFI_PROTOCOL_11AX)))
                        return ESP_ERR_INVALID_ARG;
                }
            }
        }
    }
    return ESP_OK;
}

static esp_err_t wifi_radio_read_phy(wifi_interface_t iface, wifi_protocols_t *protocols,
    wifi_bandwidths_t *bandwidths)
{
    memset(protocols, 0, sizeof(*protocols));
    memset(bandwidths, 0, sizeof(*bandwidths));
#if CONFIG_SOC_WIFI_SUPPORT_5G
    esp_err_t err = esp_wifi_get_protocols(iface, protocols);
    return err == ESP_OK ? esp_wifi_get_bandwidths(iface, bandwidths) : err;
#else
    uint8_t protocol = 0;
    esp_err_t err = esp_wifi_get_protocol(iface, &protocol);
    protocols->ghz_2g = protocol;
    return err == ESP_OK ? esp_wifi_get_bandwidth(iface, &bandwidths->ghz_2g) : err;
#endif
}

esp_err_t esp32_mquickjs_wifi_radio_read_phy(wifi_interface_t interface,
    esp32_mquickjs_wifi_phy_query_t query, esp32_mquickjs_wifi_phy_readback_t *output,
    const char **stage)
{
    if (output != NULL) memset(output, 0, sizeof(*output));
    if (stage != NULL) *stage = "admission";
    if (output == NULL || stage == NULL ||
        (interface != WIFI_IF_STA && interface != WIFI_IF_AP) ||
        (query != ESP32_MQUICKJS_WIFI_PHY_PROTOCOL && query != ESP32_MQUICKJS_WIFI_PHY_PROTOCOLS &&
         query != ESP32_MQUICKJS_WIFI_PHY_BANDWIDTH && query != ESP32_MQUICKJS_WIFI_PHY_BANDWIDTHS))
        return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (interface == WIFI_IF_AP) return ESP_ERR_NOT_SUPPORTED;
#endif
    bool plural = query == ESP32_MQUICKJS_WIFI_PHY_PROTOCOLS || query == ESP32_MQUICKJS_WIFI_PHY_BANDWIDTHS;
    bool protocol = query == ESP32_MQUICKJS_WIFI_PHY_PROTOCOL || query == ESP32_MQUICKJS_WIFI_PHY_PROTOCOLS;
    esp32_mquickjs_wifi_phy_readback_t value = {.bands = 1U};
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (!s_radio.storage_configured || s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED) ||
        !(s_radio.effective_mode & (interface == WIFI_IF_STA ? WIFI_MODE_STA : WIFI_MODE_AP))) goto done;
#if CONFIG_SOC_WIFI_SUPPORT_5G
    if (plural) {
        wifi_band_mode_t mode;
        *stage = "band-mode";
        err = esp_wifi_get_band_mode(&mode);
        if (err != ESP_OK) goto done;
        if (mode == WIFI_BAND_MODE_2G_ONLY) value.bands = 1U;
        else if (mode == WIFI_BAND_MODE_5G_ONLY) value.bands = 2U;
        else if (mode == WIFI_BAND_MODE_AUTO) value.bands = 3U;
        else { err = ESP_ERR_INVALID_RESPONSE; goto done; }
        *stage = protocol ? "protocols" : "bandwidths";
        err = protocol ? esp_wifi_get_protocols(interface, &value.protocols)
                       : esp_wifi_get_bandwidths(interface, &value.bandwidths);
    } else
#else
    (void)plural;
#endif
    {
        *stage = protocol ? "protocol" : "bandwidth";
        if (protocol) {
            uint8_t bitmap = 0;
            err = esp_wifi_get_protocol(interface, &bitmap);
            value.protocols.ghz_2g = bitmap;
        } else err = esp_wifi_get_bandwidth(interface, &value.bandwidths.ghz_2g);
    }
    if (err != ESP_OK) goto done;
    *stage = "decode";
    for (unsigned band = 1; band <= 2; band <<= 1) {
        if (!(value.bands & band)) continue;
        uint16_t bits = band == 1 ? value.protocols.ghz_2g : value.protocols.ghz_5g;
        wifi_bandwidth_t width = band == 1 ? value.bandwidths.ghz_2g : value.bandwidths.ghz_5g;
        if ((protocol && (bits & ~(WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N |
                                  WIFI_PROTOCOL_11A | WIFI_PROTOCOL_11AC | WIFI_PROTOCOL_11AX | WIFI_PROTOCOL_LR))) ||
            (!protocol && width != WIFI_BW20 && width != WIFI_BW40)) {
            err = ESP_ERR_INVALID_RESPONSE;
            goto done;
        }
    }
    /* Ignore SDK storage for unrequested bands; never expose zero-fill as BW20. */
    if (!(value.bands & 1U)) { value.protocols.ghz_2g = 0; value.bandwidths.ghz_2g = 0; }
    if (!(value.bands & 2U)) { value.protocols.ghz_5g = 0; value.bandwidths.ghz_5g = 0; }
    *output = value;
    *stage = NULL;
done:
    wifi_radio_operation_unlock();
    return err;
}

static bool wifi_radio_phy_equal(uint8_t bands, const wifi_protocols_t *a,
    const wifi_bandwidths_t *ab, const wifi_protocols_t *b, const wifi_bandwidths_t *bb)
{
    return (!(bands & 1) || (a->ghz_2g == b->ghz_2g && ab->ghz_2g == bb->ghz_2g)) &&
        (!(bands & 2) || (a->ghz_5g == b->ghz_5g && ab->ghz_5g == bb->ghz_5g));
}

