99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
static esp_err_t wifi_radio_write_phy(wifi_interface_t iface,
    const wifi_protocols_t *protocols, const wifi_bandwidths_t *bandwidths)
{
    /* A previous HT40 configuration cannot be carried through an AX/AC
     * protocol write. Establish HT20 first, then restore the requested width. */
#if CONFIG_SOC_WIFI_SUPPORT_5G
    wifi_bandwidths_t narrow = {.ghz_2g = WIFI_BW20, .ghz_5g = WIFI_BW20};
    wifi_protocols_t protocol_copy = *protocols;
    wifi_bandwidths_t bandwidth_copy = *bandwidths;
    esp_err_t err = esp_wifi_set_bandwidths(iface, &narrow);
    if (err == ESP_OK) err = esp_wifi_set_protocols(iface, &protocol_copy);
    if (err == ESP_OK) err = esp_wifi_set_bandwidths(iface, &bandwidth_copy);
#else
    esp_err_t err = esp_wifi_set_bandwidth(iface, WIFI_BW20);
    if (err == ESP_OK) err = esp_wifi_set_protocol(iface, (uint8_t)protocols->ghz_2g);
    if (err == ESP_OK) err = esp_wifi_set_bandwidth(iface, bandwidths->ghz_2g);
#endif
    return err;
}

static esp_err_t wifi_radio_snapshot_controls(
    const esp32_mquickjs_wifi_radio_config_controls_t *controls,
    wifi_radio_controls_snapshot_t *snapshot, esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (controls == NULL) return ESP_OK;
    esp_err_t err;
    if (controls->country_set) {
        result->stage = "country-snapshot";
        err = esp_wifi_get_country(&snapshot->country);
        if (err != ESP_OK) return err;
    }
    bool phy = controls->protocol_bands[0] || controls->protocol_bands[1] ||
        controls->bandwidth_bands[0] || controls->bandwidth_bands[1];
    snapshot->active_bands = 1;
#if CONFIG_SOC_WIFI_SUPPORT_5G
    if (phy) {
        wifi_band_mode_t band;
        result->stage = "band-mode-snapshot";
        err = esp_wifi_get_band_mode(&band);
        if (err != ESP_OK) return err;
        if (band == WIFI_BAND_MODE_2G_ONLY) snapshot->active_bands = 1;
        else if (band == WIFI_BAND_MODE_5G_ONLY) snapshot->active_bands = 2;
        else if (band == WIFI_BAND_MODE_AUTO) snapshot->active_bands = 3;
        else return ESP_ERR_INVALID_RESPONSE;
    }
#else
    (void)phy;
#endif
    for (size_t i = 0; i < 2; ++i) {
        unsigned bands = controls->protocol_bands[i] | controls->bandwidth_bands[i];
        if (!bands) continue;
        result->stage = i == 0 ? "station-phy-snapshot" : "ap-phy-snapshot";
        /* The SDK silently ignores inactive bands. Refuse before any write. */
        if (bands & ~snapshot->active_bands) return ESP_ERR_INVALID_STATE;
        err = wifi_radio_read_phy(i == 0 ? WIFI_IF_STA : WIFI_IF_AP,
            &snapshot->protocols[i], &snapshot->bandwidths[i]);
        if (err != ESP_OK) return err;
        snapshot->desired_protocols[i] = snapshot->protocols[i];
        snapshot->desired_bandwidths[i] = snapshot->bandwidths[i];
        for (unsigned band = 1; band <= 2; band <<= 1) {
            uint16_t *p = band == 1 ? &snapshot->desired_protocols[i].ghz_2g : &snapshot->desired_protocols[i].ghz_5g;
            wifi_bandwidth_t *bw = band == 1 ? &snapshot->desired_bandwidths[i].ghz_2g : &snapshot->desired_bandwidths[i].ghz_5g;
            if (controls->protocol_bands[i] & band) *p = band == 1 ? controls->protocols[i].ghz_2g : controls->protocols[i].ghz_5g;
            if (controls->bandwidth_bands[i] & band) *bw = band == 1 ? controls->bandwidths[i].ghz_2g : controls->bandwidths[i].ghz_5g;
            if (!(snapshot->active_bands & band)) continue;
            if ((*bw != WIFI_BW20 && *bw != WIFI_BW40) ||
                (*bw == WIFI_BW40 && (!(*p & WIFI_PROTOCOL_11N) || (*p & (WIFI_PROTOCOL_11AC | WIFI_PROTOCOL_11AX)))))
                return ESP_ERR_INVALID_ARG;
        }
    }
    if (controls->power_save_set) {
        result->stage = "power-save-snapshot";
        err = esp_wifi_get_ps(&snapshot->power_save);
        if (err != ESP_OK) return err;
    }
    return ESP_OK;
}

static esp_err_t wifi_radio_apply_country(
    const esp32_mquickjs_wifi_radio_config_controls_t *controls,
    wifi_radio_controls_snapshot_t *snapshot, esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (controls == NULL || !controls->country_set) return ESP_OK;
    result->stage = "country-config";
    snapshot->country_touched = true;
    /* Both country setters persist independently of WIFI_STORAGE_RAM. */
    result->persistent_mutation_possible = true;
    esp_err_t err = controls->country_by_code ?
        esp_wifi_set_country_code(controls->country.cc, controls->country.policy == WIFI_COUNTRY_POLICY_AUTO) :
        esp_wifi_set_country(&controls->country);
    if (err != ESP_OK) return err;
    result->stage = "country-config-readback";
    wifi_country_t actual = {0};
    err = esp_wifi_get_country(&actual);
    if (err != ESP_OK) return err;
    if (controls->country_by_code) {
        if (actual.cc[0] != controls->country.cc[0] || actual.cc[1] != controls->country.cc[1] ||
            actual.policy != controls->country.policy) return ESP_ERR_INVALID_RESPONSE;
    } else if (!wifi_radio_country_equal(&controls->country, &actual, false)) return ESP_ERR_INVALID_RESPONSE;
    return ESP_OK;
}

static esp_err_t wifi_radio_apply_controls(
    const esp32_mquickjs_wifi_radio_config_controls_t *controls,
    wifi_radio_controls_snapshot_t *snapshot, esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (controls == NULL) return ESP_OK;
    for (size_t i = 0; i < 2; ++i) {
        if (!(controls->protocol_bands[i] | controls->bandwidth_bands[i])) continue;
        wifi_interface_t iface = i == 0 ? WIFI_IF_STA : WIFI_IF_AP;
        result->stage = i == 0 ? "station-phy-config" : "ap-phy-config";
        snapshot->phy_touched[i] = true;
        esp_err_t err = wifi_radio_write_phy(iface, &snapshot->desired_protocols[i], &snapshot->desired_bandwidths[i]);
        if (err != ESP_OK) return err;
        result->stage = i == 0 ? "station-phy-readback" : "ap-phy-readback";
        wifi_protocols_t actual;
        wifi_bandwidths_t bandwidths;
        err = wifi_radio_read_phy(iface, &actual, &bandwidths);
        if (err != ESP_OK) return err;
        if (!wifi_radio_phy_equal(snapshot->active_bands, &snapshot->desired_protocols[i],
            &snapshot->desired_bandwidths[i], &actual, &bandwidths)) return ESP_ERR_INVALID_RESPONSE;
    }
    if (controls->power_save_set) {
        result->stage = "power-save-config";
        snapshot->power_save_touched = true;
        esp_err_t err = esp_wifi_set_ps(controls->power_save);
        if (err != ESP_OK) return err;
        result->stage = "power-save-readback";
        wifi_ps_type_t actual;
        err = esp_wifi_get_ps(&actual);
        if (err != ESP_OK) return err;
        if (actual != controls->power_save) return ESP_ERR_INVALID_RESPONSE;
    }
    return ESP_OK;
}

static esp_err_t wifi_radio_restore_controls(wifi_radio_controls_snapshot_t *snapshot,
    esp32_mquickjs_wifi_radio_config_result_t *result, bool country_only)
{
    esp_err_t err;
    if (country_only) {
        if (!snapshot->country_touched) return ESP_OK;
        result->rollback_stage = "rollback-country";
        err = esp_wifi_set_country(&snapshot->country);
        if (err != ESP_OK) return err;
        result->rollback_stage = "rollback-country-readback";
        wifi_country_t actual = {0};
        err = esp_wifi_get_country(&actual);
        if (err != ESP_OK) return err;
        /* max_tx_power is read-only. If country/PHY changes it, a stopped
         * transaction cannot prove restoration; retain the fault. */
        return wifi_radio_country_equal(&snapshot->country, &actual, true) ? ESP_OK : ESP_ERR_INVALID_RESPONSE;
    }
    for (int i = 1; i >= 0; --i) {
        if (!snapshot->phy_touched[i]) continue;
        wifi_interface_t iface = i == 0 ? WIFI_IF_STA : WIFI_IF_AP;
        result->rollback_stage = i == 0 ? "rollback-station-phy" : "rollback-ap-phy";
        err = wifi_radio_write_phy(iface, &snapshot->protocols[i], &snapshot->bandwidths[i]);
        if (err != ESP_OK) return err;
        result->rollback_stage = i == 0 ? "rollback-station-phy-readback" : "rollback-ap-phy-readback";
        wifi_protocols_t actual;
        wifi_bandwidths_t bandwidths;
        err = wifi_radio_read_phy(iface, &actual, &bandwidths);
        if (err != ESP_OK) return err;
        if (!wifi_radio_phy_equal(snapshot->active_bands, &snapshot->protocols[i], &snapshot->bandwidths[i],
            &actual, &bandwidths)) return ESP_ERR_INVALID_RESPONSE;
    }
    if (snapshot->power_save_touched) {
        result->rollback_stage = "rollback-power-save";
        err = esp_wifi_set_ps(snapshot->power_save);
        if (err != ESP_OK) return err;
        result->rollback_stage = "rollback-power-save-readback";
        wifi_ps_type_t actual;
        err = esp_wifi_get_ps(&actual);
        if (err != ESP_OK) return err;
        if (actual != snapshot->power_save) return ESP_ERR_INVALID_RESPONSE;
    }
    return ESP_OK;
}

esp_err_t esp32_mquickjs_wifi_radio_write_phy(wifi_interface_t interface,
    esp32_mquickjs_wifi_phy_query_t query, const esp32_mquickjs_wifi_phy_readback_t *requested,
    esp32_mquickjs_wifi_phy_readback_t *output, esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "phy-admission", .error = ESP_ERR_INVALID_ARG};
    if (requested == NULL || output == NULL || requested == output) return ESP_ERR_INVALID_ARG;
    memset(output, 0, sizeof(*output));
    if ((interface != WIFI_IF_STA && interface != WIFI_IF_AP) ||
        (query != ESP32_MQUICKJS_WIFI_PHY_PROTOCOL && query != ESP32_MQUICKJS_WIFI_PHY_PROTOCOLS &&
         query != ESP32_MQUICKJS_WIFI_PHY_BANDWIDTH && query != ESP32_MQUICKJS_WIFI_PHY_BANDWIDTHS))
        return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (interface == WIFI_IF_AP) { result->error = ESP_ERR_NOT_SUPPORTED; return result->error; }
#endif
    bool plural = query == ESP32_MQUICKJS_WIFI_PHY_PROTOCOLS || query == ESP32_MQUICKJS_WIFI_PHY_BANDWIDTHS;
    bool protocol = query == ESP32_MQUICKJS_WIFI_PHY_PROTOCOL || query == ESP32_MQUICKJS_WIFI_PHY_PROTOCOLS;
    if (requested->bands == 0U || (requested->bands & ~3U) || (!plural && requested->bands != 1U))
        return ESP_ERR_INVALID_ARG;
    esp32_mquickjs_wifi_radio_config_controls_t controls = {0};
    wifi_radio_controls_snapshot_t snapshot = {0};
    unsigned index = interface == WIFI_IF_STA ? 0 : 1;
    uint8_t bands = requested->bands;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (!s_radio.storage_configured || s_radio.started || s_radio.stop_required ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED ||
        s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required ||
        s_radio.wake_locks != 0U || s_radio.promiscuous_claimed || s_tx_rate_lease.identity != 0U ||
        !(s_radio.effective_mode & (interface == WIFI_IF_STA ? WIFI_MODE_STA : WIFI_MODE_AP))) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
    controls.protocols[index] = requested->protocols;
    controls.bandwidths[index] = requested->bandwidths;
#if CONFIG_SOC_WIFI_SUPPORT_5G
    if (!plural) {
        wifi_band_mode_t mode;
        result->stage = "band-mode-snapshot";
        err = esp_wifi_get_band_mode(&mode);
        if (err != ESP_OK) goto done;
        if (mode == WIFI_BAND_MODE_AUTO) { err = ESP_ERR_NOT_SUPPORTED; goto done; }
        if (mode == WIFI_BAND_MODE_5G_ONLY) {
            bands = 2U;
            controls.protocols[index].ghz_5g = requested->protocols.ghz_2g;
            controls.bandwidths[index].ghz_5g = requested->bandwidths.ghz_2g;
        } else if (mode != WIFI_BAND_MODE_2G_ONLY) { err = ESP_ERR_INVALID_RESPONSE; goto done; }
    }
#endif
    if (protocol) controls.protocol_bands[index] = bands;
    else controls.bandwidth_bands[index] = bands;
    result->stage = "phy-validate";
    err = esp32_mquickjs_wifi_radio_validate_config_controls(s_radio.effective_mode, &controls);
    if (err != ESP_OK) goto done;
    err = wifi_radio_snapshot_controls(&controls, &snapshot, result);
    if (err != ESP_OK) goto done;
    /* Rollback must be able to reproduce every active band, including a band
     * omitted by the request. Do not replay unknown/normalized protocol bits. */
    result->stage = "phy-predecessor";
    for (unsigned band = 1; band <= 2; band <<= 1) {
        if (!(snapshot.active_bands & band)) continue;
        uint16_t previous = band == 1 ? snapshot.protocols[index].ghz_2g : snapshot.protocols[index].ghz_5g;
        wifi_bandwidth_t width = band == 1 ? snapshot.bandwidths[index].ghz_2g : snapshot.bandwidths[index].ghz_5g;
        err = wifi_radio_validate_protocol(previous, band == 2);
        if (err != ESP_OK) goto done;
        if ((width != WIFI_BW20 && width != WIFI_BW40) ||
            (width == WIFI_BW40 && (!(previous & WIFI_PROTOCOL_11N) || (previous & (WIFI_PROTOCOL_11AC | WIFI_PROTOCOL_11AX))))) {
            err = ESP_ERR_INVALID_RESPONSE;
            goto done;
        }
    }
    result->mutation_attempted = true;
    result->persistent_mutation_possible = s_radio.storage == WIFI_STORAGE_FLASH;
    err = wifi_radio_apply_controls(&controls, &snapshot, result);
    if (err != ESP_OK) {
        result->rollback_attempted = true;
        result->rollback_error = wifi_radio_restore_controls(&snapshot, result, false);
        result->rollback_complete = result->rollback_error == ESP_OK;
        if (result->rollback_complete) result->rollback_stage = NULL;
        if (!result->rollback_complete || result->persistent_mutation_possible)
            (void)wifi_radio_record_fault(result->stage, err);
        if (!result->rollback_complete)
            (void)wifi_radio_cleanup_fault("phy-rollback", result->rollback_error);
        goto done;
    }
    output->bands = plural ? snapshot.active_bands : 1U;
    output->protocols = snapshot.desired_protocols[index];
    output->bandwidths = snapshot.desired_bandwidths[index];
    if (!plural && bands == 2U) {
        output->protocols.ghz_2g = output->protocols.ghz_5g;
        output->bandwidths.ghz_2g = output->bandwidths.ghz_5g;
    }
    if (!(output->bands & 1U)) { output->protocols.ghz_2g = 0; output->bandwidths.ghz_2g = 0; }
    if (!(output->bands & 2U)) { output->protocols.ghz_5g = 0; output->bandwidths.ghz_5g = 0; }
    result->stage = "complete";
done:
    result->error = err;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.configuration = *result;
    taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return err;
}

/* Caller has already validated the input and reserved the stopped driver.
 * All temporary config/credential storage is allocated before the first SDK
 * mutation and securely wiped on every exit. No callbacks acquire this mutex. */
static esp_err_t wifi_radio_configure_locked(wifi_mode_t mode, wifi_storage_t storage,
    wifi_config_t *station, esp32_mquickjs_wifi_config_accept_fn accept_station,
    wifi_config_t *access_point, esp32_mquickjs_wifi_config_accept_fn accept_access_point,
    const esp32_mquickjs_wifi_radio_config_controls_t *controls,
    esp32_mquickjs_wifi_radio_config_result_t *result)
{
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "config-admission"};
    esp_err_t err = ESP_ERR_INVALID_ARG;
    if ((mode != WIFI_MODE_STA && mode != WIFI_MODE_AP && mode != WIFI_MODE_APSTA) ||
        (storage != WIFI_STORAGE_RAM && storage != WIFI_STORAGE_FLASH) ||
        (station != NULL && (!(mode & WIFI_MODE_STA) || accept_station == NULL)) ||
        (access_point != NULL && (!(mode & WIFI_MODE_AP) || accept_access_point == NULL))) goto record;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if ((mode & WIFI_MODE_AP) || access_point != NULL) { err = ESP_ERR_NOT_SUPPORTED; goto record; }
#endif
    err = esp32_mquickjs_wifi_radio_validate_config_controls(mode, controls);
    if (err != ESP_OK) goto record;
    if (station != NULL && !station->sta.pmf_cfg.capable &&
        (station->sta.pmf_cfg.required || !esp32_mquickjs_wifi_radio_pmf_disable_allowed(WIFI_IF_STA, station))) {
        result->stage = "station-pmf-security";
        err = ESP_ERR_INVALID_ARG;
        goto record;
    }
    if (access_point != NULL && !access_point->ap.pmf_cfg.capable &&
        (access_point->ap.pmf_cfg.required || !esp32_mquickjs_wifi_radio_pmf_disable_allowed(WIFI_IF_AP, access_point))) {
        result->stage = "ap-pmf-security";
        err = ESP_ERR_INVALID_ARG;
        goto record;
    }
    err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned || !s_radio.storage_configured || s_radio.started ||
        s_radio.stop_required || s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED) goto record;
    if (access_point != NULL && access_point->ap.channel != 0 &&
        (controls == NULL || !controls->country_set)) {
        result->stage = "ap-regulatory";
        err = wifi_radio_validate_regulatory_channel(access_point->ap.channel);
        if (err != ESP_OK) goto record;
    }
    struct {
        wifi_config_t before[2];
        wifi_config_t actual[2];
        wifi_radio_controls_snapshot_t controls;
    } *snapshots = esp32_mquickjs_memory_wireless_calloc("wifi.radio", 1, sizeof(*snapshots), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (snapshots == NULL) { result->stage = "config-allocate"; err = ESP_ERR_NO_MEM; goto record; }
    wifi_config_t *requested[2] = {station, access_point};
    esp32_mquickjs_wifi_config_accept_fn accept[2] = {accept_station, accept_access_point};
    const wifi_interface_t interfaces[2] = {WIFI_IF_STA, WIFI_IF_AP};
    const char *snapshot_stages[2] = {"station-snapshot", "ap-snapshot"};
    const char *write_stages[2] = {"station-config", "ap-config"};
    const char *read_stages[2] = {"station-config-readback", "ap-config-readback"};
    bool touched[2] = {false, false};
    wifi_storage_t old_storage = s_radio.storage;
    wifi_mode_t old_mode, actual_mode;
    result->stage = "mode-snapshot";
    err = esp_wifi_get_mode(&old_mode);
    if (err != ESP_OK) goto free_snapshots;
    if (old_mode != WIFI_MODE_NULL && old_mode != WIFI_MODE_STA &&
        old_mode != WIFI_MODE_AP && old_mode != WIFI_MODE_APSTA) {
        err = ESP_ERR_INVALID_RESPONSE;
        goto free_snapshots;
    }
    for (size_t i = 0; i < 2; ++i) {
        if (requested[i] == NULL) continue;
        result->stage = snapshot_stages[i];
        err = esp_wifi_get_config(interfaces[i], &snapshots->before[i]);
        if (err != ESP_OK) goto free_snapshots;
    }
    err = wifi_radio_snapshot_controls(controls, &snapshots->controls, result);
    if (err != ESP_OK) goto free_snapshots;
    result->mutation_attempted = true;
    result->stage = "config-storage";
    err = esp_wifi_set_storage(storage);
    if (err != ESP_OK) goto rollback;
    /* A native failure can follow a partial persistent write. RAM readback
     * cannot establish what the previous NVS image contained. */
    result->persistent_mutation_possible = storage == WIFI_STORAGE_FLASH;
    err = wifi_radio_apply_country(controls, &snapshots->controls, result);
    if (err != ESP_OK) goto rollback;
    if (access_point != NULL && access_point->ap.channel != 0 && controls != NULL && controls->country_set) {
        result->stage = "ap-regulatory";
        err = wifi_radio_validate_regulatory_channel(access_point->ap.channel);
        if (err != ESP_OK) goto rollback;
    }
    result->stage = "config-mode";
    err = esp_wifi_set_mode(mode);
    if (err != ESP_OK) goto rollback;
    result->stage = "config-mode-readback";
    err = esp_wifi_get_mode(&actual_mode);
    if (err == ESP_OK && actual_mode != mode) err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) goto rollback;
    for (size_t i = 0; i < 2; ++i) {
        if (requested[i] == NULL) continue;
        result->stage = write_stages[i];
        snapshots->actual[i] = *requested[i];
        touched[i] = true;
        err = esp_wifi_set_config(interfaces[i], &snapshots->actual[i]);
        if (err != ESP_OK) goto rollback;
        if (!(interfaces[i] == WIFI_IF_AP ? requested[i]->ap.pmf_cfg.capable : requested[i]->sta.pmf_cfg.capable)) {
            /* Captured input uses capable=false only for an explicit
             * disable. The dedicated SDK call must precede readback/START. */
            result->stage = interfaces[i] == WIFI_IF_AP ? "ap-pmf-config" : "station-pmf-config";
            err = esp_wifi_disable_pmf_config(interfaces[i]);
            if (err != ESP_OK) goto rollback;
        }
        result->stage = read_stages[i];
        memset(&snapshots->actual[i], 0, sizeof(snapshots->actual[i]));
        err = esp_wifi_get_config(interfaces[i], &snapshots->actual[i]);
        if (err == ESP_OK && !accept[i](requested[i], &snapshots->actual[i]))
            err = ESP_ERR_INVALID_RESPONSE;
        if (err != ESP_OK) goto rollback;
    }
    err = wifi_radio_apply_controls(controls, &snapshots->controls, result);
    if (err != ESP_OK) goto rollback;
    /* Later interface-global settings must not silently weaken a previously
     * accepted interface config. Publish only the final native readback. */
    if (controls != NULL) {
        for (size_t i = 0; i < 2; ++i) {
            if (requested[i] == NULL) continue;
            result->stage = read_stages[i];
            memset(&snapshots->actual[i], 0, sizeof(snapshots->actual[i]));
            err = esp_wifi_get_config(interfaces[i], &snapshots->actual[i]);
            if (err == ESP_OK && !accept[i](requested[i], &snapshots->actual[i]))
                err = ESP_ERR_INVALID_RESPONSE;
            if (err != ESP_OK) goto rollback;
        }
    }
    for (size_t i = 0; i < 2; ++i)
        if (requested[i] != NULL) *requested[i] = snapshots->actual[i];
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.effective_mode = mode;
    s_radio.storage = storage;
    taskEXIT_CRITICAL(&s_radio.lock);
    result->stage = "complete";
    goto free_snapshots;

