99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
rollback:
    result->rollback_attempted = true;
    result->rollback_stage = "rollback-storage-ram";
    result->rollback_error = esp_wifi_set_storage(WIFI_STORAGE_RAM);
    if (result->rollback_error != ESP_OK) goto rollback_failed;
    result->rollback_error = wifi_radio_restore_controls(&snapshots->controls, result, true);
    if (result->rollback_error != ESP_OK) goto rollback_failed;
    /* Enable every interface that might need restoration, even if it was
     * disabled in the old mode. Stay stopped throughout this sequence. */
    result->rollback_stage = "rollback-mode-enable";
    result->rollback_error = esp_wifi_set_mode((wifi_mode_t)(old_mode | mode));
    if (result->rollback_error != ESP_OK) goto rollback_failed;
    for (size_t i = 0; i < 2; ++i) {
        if (!touched[i]) continue;
        result->rollback_stage = i == 0 ? "rollback-station" : "rollback-ap";
        snapshots->actual[i] = snapshots->before[i];
        result->rollback_error = esp_wifi_set_config(interfaces[i], &snapshots->actual[i]);
        if (result->rollback_error != ESP_OK) goto rollback_failed;
        result->rollback_stage = i == 0 ? "rollback-station-pmf" : "rollback-ap-pmf";
        result->rollback_error = wifi_radio_restore_disabled_pmf(interfaces[i], &snapshots->before[i]);
        if (result->rollback_error != ESP_OK) goto rollback_failed;
        result->rollback_stage = i == 0 ? "rollback-station-readback" : "rollback-ap-readback";
        memset(&snapshots->actual[i], 0, sizeof(snapshots->actual[i]));
        result->rollback_error = esp_wifi_get_config(interfaces[i], &snapshots->actual[i]);
        if (result->rollback_error == ESP_OK &&
            !wifi_radio_config_equal(interfaces[i], &snapshots->before[i], &snapshots->actual[i]))
            result->rollback_error = ESP_ERR_INVALID_RESPONSE;
        if (result->rollback_error != ESP_OK) goto rollback_failed;
    }
    result->rollback_error = wifi_radio_restore_controls(&snapshots->controls, result, false);
    if (result->rollback_error != ESP_OK) goto rollback_failed;
    result->rollback_stage = "rollback-mode";
    result->rollback_error = esp_wifi_set_mode(old_mode);
    if (result->rollback_error != ESP_OK) goto rollback_failed;
    result->rollback_stage = "rollback-mode-readback";
    result->rollback_error = esp_wifi_get_mode(&actual_mode);
    if (result->rollback_error == ESP_OK && actual_mode != old_mode)
        result->rollback_error = ESP_ERR_INVALID_RESPONSE;
    if (result->rollback_error != ESP_OK) goto rollback_failed;
    result->rollback_stage = "rollback-storage";
    result->rollback_error = esp_wifi_set_storage(old_storage);
    if (result->rollback_error != ESP_OK) goto rollback_failed;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.effective_mode = old_mode;
    s_radio.storage = old_storage;
    taskEXIT_CRITICAL(&s_radio.lock);
    result->rollback_complete = true; /* Runtime config only, not NVS history. */
    result->rollback_stage = NULL;
    if (result->persistent_mutation_possible)
        (void)wifi_radio_record_fault(result->stage, err);
    goto free_snapshots;
rollback_failed:
    /* Temporary credentials are not retained to retry a partly known config.
     * Keep the lifecycle reservation faulted; explicit shutdown is required. */
    (void)wifi_radio_record_fault(result->stage, err);
    (void)wifi_radio_cleanup_fault("configuration-rollback", result->rollback_error);
free_snapshots:
    esp32_mquickjs_wireless_secure_zero(snapshots, sizeof(*snapshots));
    esp32_mquickjs_memory_payload_free(snapshots);
record:
    result->error = err;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.configuration = *result;
    taskEXIT_CRITICAL(&s_radio.lock);
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_read_interface_config(wifi_interface_t interface,
    bool include_secrets, wifi_config_t *config, const char **stage)
{
    if (config != NULL) esp32_mquickjs_wireless_secure_zero(config, sizeof(*config));
    if (stage != NULL) *stage = "admission";
    if (config == NULL || stage == NULL || (interface != WIFI_IF_STA && interface != WIFI_IF_AP))
        return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (interface == WIFI_IF_AP) return ESP_ERR_NOT_SUPPORTED;
#endif
#if !CONFIG_ESP32_MQUICKJS_WIFI_ALLOW_SECRET_READBACK
    if (include_secrets) { *stage = "secret-readback"; return ESP_ERR_NOT_ALLOWED; }
#endif
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (!s_radio.storage_configured || s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED)) goto done;
    *stage = "interface-config";
    err = esp_wifi_get_config(interface, config);
    if (err != ESP_OK) goto done;
    if (!include_secrets) {
        if (interface == WIFI_IF_STA) {
            esp32_mquickjs_wireless_secure_zero(config->sta.password, sizeof(config->sta.password));
            esp32_mquickjs_wireless_secure_zero(config->sta.sae_h2e_identifier, sizeof(config->sta.sae_h2e_identifier));
        } else esp32_mquickjs_wireless_secure_zero(config->ap.password, sizeof(config->ap.password));
    }
    *stage = NULL;
done:
    if (err != ESP_OK) esp32_mquickjs_wireless_secure_zero(config, sizeof(*config));
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_write_interface_config(wifi_interface_t interface,
    wifi_config_t *config, esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "config-admission", .error = ESP_ERR_INVALID_ARG};
    if (config == NULL || (interface != WIFI_IF_STA && interface != WIFI_IF_AP)) return result->error;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (interface == WIFI_IF_AP) { result->error = ESP_ERR_NOT_SUPPORTED; return result->error; }
#endif
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (!s_radio.storage_configured || s_radio.started || s_radio.stop_required || s_radio.restart_required ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED || s_radio.lifecycle.identity != 0U ||
        s_radio.operation.identity != 0U || s_radio.wake_locks != 0U || s_radio.promiscuous_claimed ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL ||
        s_tx_rate_lease.identity != 0U || s_tx_rate_lease.restore_pending ||
        !(s_radio.effective_mode & (interface == WIFI_IF_STA ? WIFI_MODE_STA : WIFI_MODE_AP))) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
    err = wifi_radio_configure_locked(s_radio.effective_mode, s_radio.storage,
        interface == WIFI_IF_STA ? config : NULL, esp32_mquickjs_wifi_radio_accept_station_config,
        interface == WIFI_IF_AP ? config : NULL, esp32_mquickjs_wifi_radio_accept_ap_config, NULL, result);
done:
    result->error = err;
    taskENTER_CRITICAL(&s_radio.lock); s_radio.configuration = *result; taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_initialize_lifecycle(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (token == NULL || token->identity == 0U) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (token->identity != s_radio.lifecycle.identity || token->generation != s_radio.lifecycle.generation ||
        s_radio.started || s_radio.stop_required || s_radio.operation.identity != 0U ||
        s_radio.wake_locks != 0 || s_radio.promiscuous_claimed || s_radio.restart_required ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED)) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
    err = wifi_radio_initialize();
done:
    wifi_radio_operation_unlock();
    return err;
}

