99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_configure_lifecycle(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token,
    wifi_mode_t mode, wifi_storage_t storage,
    wifi_config_t *station, esp32_mquickjs_wifi_config_accept_fn accept_station,
    wifi_config_t *access_point, esp32_mquickjs_wifi_config_accept_fn accept_access_point,
    const esp32_mquickjs_wifi_radio_config_controls_t *controls,
    esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "config-admission", .error = ESP_ERR_INVALID_STATE};
    if (token == NULL || token->identity == 0U) {
        result->error = ESP_ERR_INVALID_ARG;
        return ESP_ERR_INVALID_ARG;
    }
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (token->identity != s_radio.lifecycle.identity || token->generation != s_radio.lifecycle.generation ||
        s_radio.operation.identity != 0 || s_radio.wake_locks != 0 || s_radio.promiscuous_claimed) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    if (s_vendor_ie.start_owner.identity != 0U) {
        if (!wifi_radio_vendor_ie_start_matches(token) || mode != s_vendor_ie.start_mode ||
            storage != s_vendor_ie.start_storage || station != NULL || access_point != NULL ||
            accept_station != NULL || accept_access_point != NULL || controls != NULL ||
            !s_radio.driver_owned || !s_radio.storage_configured || s_radio.started || s_radio.stop_required ||
            s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED || s_radio.restart_required ||
            s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL) goto done;
        wifi_mode_t observed = WIFI_MODE_NULL;
        result->stage = "vendor-ie-start-mode";
        err = esp_wifi_get_mode(&observed);
        if (err == ESP_OK && observed != mode) err = ESP_ERR_INVALID_RESPONSE;
        result->error = err;
        if (err == ESP_OK) result->stage = "complete";
        taskENTER_CRITICAL(&s_radio.lock); s_radio.configuration = *result; taskEXIT_CRITICAL(&s_radio.lock);
        goto done;
    }
#endif
    err = wifi_radio_configure_locked(mode, storage, station, accept_station,
        access_point, accept_access_point, controls, result);
done:
    wifi_radio_operation_unlock();
    return err;
}

bool esp32_mquickjs_wifi_radio_accept_ap_config(const wifi_config_t *requested, const wifi_config_t *actual)
{
    size_t password_length = strnlen((const char *)requested->ap.password, sizeof(requested->ap.password));
    return actual->ap.ssid_len == requested->ap.ssid_len &&
        memcmp(actual->ap.ssid, requested->ap.ssid, requested->ap.ssid_len) == 0 &&
        strnlen((const char *)actual->ap.password, sizeof(actual->ap.password)) == password_length &&
        memcmp(actual->ap.password, requested->ap.password, password_length) == 0 &&
        actual->ap.authmode == (requested->ap.wpa3_compatible_mode ? WIFI_AUTH_WPA2_PSK : requested->ap.authmode) &&
        actual->ap.sae_ext == requested->ap.sae_ext &&
        actual->ap.wpa3_compatible_mode == requested->ap.wpa3_compatible_mode &&
        actual->ap.bss_max_idle_cfg.period == requested->ap.bss_max_idle_cfg.period &&
        actual->ap.bss_max_idle_cfg.protected_keep_alive == requested->ap.bss_max_idle_cfg.protected_keep_alive &&
        (requested->ap.pmf_cfg.capable ?
            ((actual->ap.pmf_cfg.capable || requested->ap.authmode == WIFI_AUTH_OPEN || requested->ap.authmode == WIFI_AUTH_WPA_PSK) &&
             (actual->ap.pmf_cfg.required || !requested->ap.pmf_cfg.required)) :
            (!actual->ap.pmf_cfg.capable && !actual->ap.pmf_cfg.required)) &&
        (actual->ap.transition_disable || !requested->ap.transition_disable) &&
        (requested->ap.sae_pwe_h2e == WPA3_SAE_PWE_UNSPECIFIED || actual->ap.sae_pwe_h2e == requested->ap.sae_pwe_h2e) &&
        (requested->ap.gtk_rekey_interval == 0 || actual->ap.gtk_rekey_interval == requested->ap.gtk_rekey_interval) &&
        (requested->ap.authmode == WIFI_AUTH_OPEN || actual->ap.pairwise_cipher == requested->ap.pairwise_cipher);
}
#endif


#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
static int wifi_radio_wake_slot(const esp32_mquickjs_wifi_wake_token_t *token)
{
    if (token == NULL || token->identity == 0) return -1;
    for (size_t i = 0; i < ESP32_MQUICKJS_WIFI_MAX_WAKE_LOCKS; ++i)
        if (s_wake_tokens[i].identity == token->identity &&
            s_wake_tokens[i].generation == token->generation) return (int)i;
    return -1;
}

esp_err_t esp32_mquickjs_wifi_radio_wake_acquire(esp32_mquickjs_wifi_wake_token_t *token)
{
    if (token == NULL || token->identity != 0) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
#if CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
    if (WIFI_RADIO_SMARTCONFIG_PENDING || WIFI_RADIO_WPS_PENDING) goto done;
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_DPP_SUPPORT
    if (WIFI_RADIO_DPP_PENDING) goto done;
#endif
    if (s_tx_rate_lease.identity != 0U || !s_radio.started || s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED ||
        s_radio.lifecycle.identity != 0 || s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL) goto done;
    if (s_interval.owner.identity != 0U || s_interval.uncertain) goto done;
    size_t slot;
    for (slot = 0; slot < ESP32_MQUICKJS_WIFI_MAX_WAKE_LOCKS; ++slot)
        if (s_wake_tokens[slot].identity == 0) break;
    if (slot == ESP32_MQUICKJS_WIFI_MAX_WAKE_LOCKS || s_next_wake_identity == 0) { err = ESP_ERR_NO_MEM; goto done; }
    uint32_t identity = s_next_wake_identity++;
    err = esp_wifi_force_wakeup_acquire();
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.wake_lock_error = err;
    if (err == ESP_OK) {
        *token = (esp32_mquickjs_wifi_wake_token_t){.generation = s_radio.generation, .identity = identity};
        s_wake_tokens[slot] = *token;
        s_radio.wake_locks++;
    }
    taskEXIT_CRITICAL(&s_radio.lock);
done:
    wifi_radio_operation_unlock();
    return err;
}

static esp_err_t wifi_radio_wake_release_locked(esp32_mquickjs_wifi_wake_token_t *token)
{
    int slot = wifi_radio_wake_slot(token);
    if (slot < 0) { memset(token, 0, sizeof(*token)); return ESP_OK; }
    esp_err_t err = esp_wifi_force_wakeup_release();
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.wake_lock_error = err;
    if (err == ESP_OK) {
        memset(&s_wake_tokens[slot], 0, sizeof(s_wake_tokens[slot]));
        s_radio.wake_locks--;
        memset(token, 0, sizeof(*token));
    }
    taskEXIT_CRITICAL(&s_radio.lock);
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_wake_release(esp32_mquickjs_wifi_wake_token_t *token)
{
    if (token == NULL) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_wake_release_locked(token);
    wifi_radio_operation_unlock();
    return err;
}

bool esp32_mquickjs_wifi_radio_wake_active(const esp32_mquickjs_wifi_wake_token_t *token)
{
    wifi_radio_operation_lock();
    bool active = wifi_radio_wake_slot(token) >= 0;
    wifi_radio_operation_unlock();
    return active;
}

esp_err_t esp32_mquickjs_wifi_radio_wake_release_all(void)
{
    wifi_radio_operation_lock();
    esp_err_t result = ESP_OK;
    for (size_t i = 0; i < ESP32_MQUICKJS_WIFI_MAX_WAKE_LOCKS; ++i) {
        esp32_mquickjs_wifi_wake_token_t token = s_wake_tokens[i];
        if (token.identity == 0) continue;
        esp_err_t err = wifi_radio_wake_release_locked(&token);
        if (result == ESP_OK && err != ESP_OK) result = err;
    }
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.wake_lock_error = result;
    taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return result;
}

