99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_set_country_details(const wifi_country_t *country,
    wifi_country_t *actual, esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "country-admission", .error = ESP_ERR_INVALID_ARG};
    if (country == NULL || actual == NULL || country == actual) return ESP_ERR_INVALID_ARG;
    memset(actual, 0, sizeof(*actual));
    esp32_mquickjs_wifi_radio_config_controls_t controls = {.country_set = true, .country = *country};
    esp_err_t err = esp32_mquickjs_wifi_radio_validate_config_controls(WIFI_MODE_STA, &controls);
    if (err != ESP_OK) { result->error = err; return err; }
    wifi_radio_operation_lock();
    err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (!s_radio.storage_configured || s_radio.started || s_radio.stop_required || s_radio.restart_required ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED || s_radio.fault_stage != NULL ||
        s_radio.cleanup_stage != NULL || s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U ||
        s_radio.wake_locks != 0U || s_radio.promiscuous_claimed ||
        s_tx_rate_lease.identity != 0U || s_tx_rate_lease.restore_pending) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
    wifi_radio_controls_snapshot_t before = {0};
    err = wifi_radio_snapshot_controls(&controls, &before, result);
    if (err != ESP_OK) goto done;
    if (!wifi_radio_country_valid(&before.country)) { err = ESP_ERR_INVALID_RESPONSE; goto done; }
    if (wifi_radio_country_equal(country, &before.country, false)) {
        *actual = before.country; result->stage = "complete"; goto done;
    }
    result->mutation_attempted = true;
    err = wifi_radio_apply_country(&controls, &before, result);
    if (err == ESP_OK) {
        result->stage = "country-result-readback";
        wifi_country_t observed = {0};
        err = esp_wifi_get_country(&observed);
        if (err == ESP_OK && (!wifi_radio_country_valid(&observed) ||
            !wifi_radio_country_equal(country, &observed, false))) err = ESP_ERR_INVALID_RESPONSE;
        if (err == ESP_OK) { *actual = observed; result->stage = "complete"; goto done; }
    }
    result->rollback_attempted = true;
    result->rollback_error = wifi_radio_restore_controls(&before, result, true);
    result->rollback_complete = result->rollback_error == ESP_OK;
    if (result->rollback_complete) result->rollback_stage = NULL;
    else {
        (void)wifi_radio_record_fault(result->stage, err);
        (void)wifi_radio_cleanup_fault("country-rollback", result->rollback_error);
    }
done:
    result->error = err;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.configuration = *result;
    taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_set_country_code(
    const esp32_mquickjs_wifi_radio_lease_t *lease, const char code[3], bool ieee80211d,
    wifi_country_t *actual, esp32_mquickjs_wifi_radio_mutation_t *mutation)
{
    if (mutation == NULL) return ESP_ERR_INVALID_ARG;
    *mutation = (esp32_mquickjs_wifi_radio_mutation_t){.stage = "admission"};
    if (code == NULL || actual == NULL || code[2] != '\0' ||
        !((code[0] >= 'A' && code[0] <= 'Z' && code[1] >= 'A' && code[1] <= 'Z') ||
          (code[0] == '0' && code[1] == '1'))) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp32_mquickjs_wifi_radio_config_result_t result = {.stage = "admission"};
    esp_err_t err = wifi_radio_configuration_owner_locked(lease);
    if (err != ESP_OK) goto done;
    if (lease->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA ||
        s_radio.effective_mode != WIFI_MODE_STA || !s_radio.driver_owned || !s_radio.storage_configured ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED || s_radio.restart_required ||
        s_radio.cleanup_stage != NULL || s_radio.wake_locks != 0U ||
        s_tx_rate_lease.identity != 0U || s_tx_rate_lease.restore_pending) {
        err = ESP_ERR_INVALID_STATE; goto done;
    }
    wifi_ap_record_t ap;
    err = esp_wifi_sta_get_ap_info(&ap);
    if (err == ESP_OK) { err = ESP_ERR_INVALID_STATE; goto done; }
    if (err != ESP_ERR_WIFI_NOT_CONNECT) goto done;
    wifi_radio_controls_snapshot_t before = {0};
    result.stage = "country-snapshot";
    err = esp_wifi_get_country(&before.country);
    if (err != ESP_OK) goto done;
    if (!wifi_radio_country_valid(&before.country)) { err = ESP_ERR_INVALID_RESPONSE; goto done; }
    result.stage = "country-set";
    result.mutation_attempted = before.country_touched = true;
    /* The SDK can change RAM/NVS before returning an error, independently of
     * the selected Station/AP storage policy. Never auto-repeat that write. */
    result.persistent_mutation_possible = true;
    err = esp_wifi_set_country_code(code, ieee80211d);
    if (err != ESP_OK) goto rollback;
    mutation->driver_accepted = true;
    result.stage = "country-readback";
    wifi_country_t country = {0};
    err = esp_wifi_get_country(&country);
    if (err == ESP_OK && (!wifi_radio_country_valid(&country) ||
        country.cc[0] != code[0] || country.cc[1] != code[1] ||
        country.policy != (ieee80211d ? WIFI_COUNTRY_POLICY_AUTO : WIFI_COUNTRY_POLICY_MANUAL)))
        err = ESP_ERR_INVALID_RESPONSE;
    if (err == ESP_OK) { *actual = country; result.stage = "complete"; goto done; }
rollback:
    result.rollback_attempted = true;
    result.rollback_error = wifi_radio_restore_controls(&before, &result, true);
    result.rollback_complete = result.rollback_error == ESP_OK;
    if (result.rollback_complete) result.rollback_stage = NULL;
    else {
        (void)wifi_radio_record_fault(result.stage, err);
        (void)wifi_radio_cleanup_fault("country-rollback", result.rollback_error);
    }
done:
    result.error = err;
    mutation->stage = err == ESP_OK ? NULL : result.stage;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.configuration = result;
    taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_change_channel(
    const esp32_mquickjs_wifi_radio_lease_t *lease, uint8_t primary, wifi_second_chan_t secondary,
    uint8_t *actual_primary, wifi_second_chan_t *actual_secondary, uint32_t *generation,
    esp32_mquickjs_wifi_radio_mutation_t *mutation)
{
    if (mutation == NULL) return ESP_ERR_INVALID_ARG;
    *mutation = (esp32_mquickjs_wifi_radio_mutation_t){.stage = "admission"};
    if (primary == 0 || actual_primary == NULL || actual_secondary == NULL || generation == NULL ||
        (secondary != WIFI_SECOND_CHAN_NONE && secondary != WIFI_SECOND_CHAN_ABOVE && secondary != WIFI_SECOND_CHAN_BELOW) ||
        (primary > 14 && (secondary != WIFI_SECOND_CHAN_NONE ||
            esp32_mquickjs_wifi_radio_5ghz_channel_bit(primary) == 0))) return ESP_ERR_INVALID_ARG;
#if !CONFIG_SOC_WIFI_SUPPORT_5G
    if (primary > 14) return ESP_ERR_NOT_SUPPORTED;
#endif
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_configuration_owner_locked(lease);
    if (err != ESP_OK) goto done;
    if ((lease->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA &&
         lease->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP) ||
        (s_radio.effective_mode != WIFI_MODE_STA && s_radio.effective_mode != WIFI_MODE_AP)) {
        err = ESP_ERR_INVALID_STATE;
        goto done;
    }
    mutation->stage = "channel-validate";
    err = wifi_radio_validate_regulatory_channel(primary);
    if (err != ESP_OK) goto done;
    if (primary <= 14 && secondary != WIFI_SECOND_CHAN_NONE) {
        int extension = (int)primary + (secondary == WIFI_SECOND_CHAN_ABOVE ? 4 : -4);
        if (extension < 1 || extension > 14) { err = ESP_ERR_INVALID_ARG; goto done; }
        err = wifi_radio_validate_regulatory_channel((uint8_t)extension);
        if (err != ESP_OK) goto done;
    }
    uint8_t current_primary;
    wifi_second_chan_t current_secondary;
    uint32_t current_generation;
    mutation->stage = "channel-readback";
    err = wifi_radio_get_channel_locked(&current_primary, &current_secondary, &current_generation);
    if (err != ESP_OK) goto done;
    if (s_radio.effective_mode == WIFI_MODE_STA) {
        wifi_ap_record_t ap;
        err = esp_wifi_sta_get_ap_info(&ap);
        if (err == ESP_OK) {
            /* A no-op read is allowed on an established link; no channel write. */
            if (current_primary != primary || (primary <= 14 && current_secondary != secondary)) {
                mutation->stage = "admission";
                err = ESP_ERR_INVALID_STATE;
                goto done;
            }
            *actual_primary = current_primary;
            *actual_secondary = current_secondary;
            *generation = current_generation;
            mutation->stage = NULL;
            goto done;
        }
        if (err != ESP_ERR_WIFI_NOT_CONNECT) goto done;
    }
    mutation->stage = "channel-set";
    err = esp_wifi_set_channel(primary, secondary);
    if (err != ESP_OK) goto done;
    mutation->driver_accepted = true;
    mutation->stage = "channel-readback";
    err = wifi_radio_get_channel_locked(actual_primary, actual_secondary, generation);
    if (err == ESP_OK) mutation->stage = NULL;
    /* No fixed-channel lease is created: a later scan/connect may change home.
     * An AP channel switch may finish asynchronously after this readback. */
done:
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_validate_scan_channels(
    const esp32_mquickjs_wifi_radio_operation_t *operation,
    const wifi_scan_config_t *config)
{
    if (operation == NULL || config == NULL) return ESP_ERR_INVALID_ARG;
    uint32_t ghz2 = config->channel_bitmap.ghz_2_channels;
    uint32_t ghz5 = config->channel_bitmap.ghz_5_channels;
    bool all_channels = ghz2 == 0 && ghz5 == 0 && config->channel == 0;
    if (config->channel != 0) {
        if (ghz2 != 0 || ghz5 != 0) return ESP_ERR_INVALID_ARG;
        if (config->channel <= 14) ghz2 = 1UL << config->channel;
        else {
            ghz5 = esp32_mquickjs_wifi_radio_5ghz_channel_bit(config->channel);
            if (ghz5 == 0) return ESP_ERR_INVALID_ARG;
        }
    } else if ((ghz2 & ~0x7fffUL) != 0 || (ghz5 & ~0x1fffffffUL) != 0 ||
               ((ghz2 & 1U) && ghz2 != 1U) || ((ghz5 & 1U) && ghz5 != 1U)) {
        return ESP_ERR_INVALID_ARG;
    }
    ghz2 &= ~1UL;
    ghz5 &= ~1UL;
    if (!all_channels && ghz2 == 0 && ghz5 == 0) return ESP_ERR_INVALID_ARG;
#if !CONFIG_SOC_WIFI_SUPPORT_5G
    if (ghz5 != 0) return ESP_ERR_NOT_SUPPORTED;
#endif
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (operation->identity == 0 || operation->identity != s_radio.operation.identity ||
        operation->generation != s_radio.operation.generation ||
        operation->lease_identity != s_radio.operation.lease_identity ||
        operation->kind != ESP32_MQUICKJS_WIFI_RADIO_OPERATION_SCAN ||
        s_radio.operation.kind != operation->kind || !s_radio.started ||
        s_radio.lifecycle.identity != 0 || s_radio.fault_stage != NULL) goto done;
    if (all_channels) { err = ESP_OK; goto done; }
    wifi_country_t country = {0};
    err = esp_wifi_get_country(&country);
    if (err != ESP_OK) goto done;
    uint32_t allowed2 = 0;
    uint16_t end = (uint16_t)country.schan + country.nchan;
    for (uint16_t channel = country.schan; channel < end && channel <= 14; ++channel)
        if (channel != 0) allowed2 |= 1UL << channel;
    if ((ghz2 & ~allowed2) != 0) { err = ESP_ERR_NOT_ALLOWED; goto done; }
#if CONFIG_SOC_WIFI_SUPPORT_5G
    wifi_band_mode_t band;
    err = esp_wifi_get_band_mode(&band);
    if (err != ESP_OK) goto done;
    if ((ghz2 && band == WIFI_BAND_MODE_5G_ONLY) ||
        (ghz5 && band == WIFI_BAND_MODE_2G_ONLY)) { err = ESP_ERR_NOT_ALLOWED; goto done; }
    if (band != WIFI_BAND_MODE_2G_ONLY && band != WIFI_BAND_MODE_5G_ONLY &&
        band != WIFI_BAND_MODE_AUTO) { err = ESP_ERR_NOT_SUPPORTED; goto done; }
    if (ghz5 != 0) {
        /* AUTO ignores the configured mask; a zero mask delegates to the SDK's
         * regulatory table even under MANUAL. Submit the original scan request
         * in either case and let the SDK select permitted channels/scan modes.
         * Only a MANUAL, nonzero mask is an explicit preflight restriction. */
        if (country.policy != WIFI_COUNTRY_POLICY_AUTO && country.policy != WIFI_COUNTRY_POLICY_MANUAL) {
            err = ESP_ERR_NOT_SUPPORTED;
            goto done;
        }
        if (country.policy == WIFI_COUNTRY_POLICY_MANUAL && country.wifi_5g_channel_mask != 0 &&
            (ghz5 & ~country.wifi_5g_channel_mask) != 0) { err = ESP_ERR_NOT_ALLOWED; goto done; }
    }
#endif
    err = ESP_OK;
done:
    wifi_radio_operation_unlock();
    return err;
}

/* Advisory samples: the SDK has no atomic multi-get link snapshot. Guard
 * both ends against a different AP/channel; never use these getters as the
 * identity of a completed connect operation. */
esp_err_t esp32_mquickjs_wifi_radio_sample_station_link(
    const esp32_mquickjs_wifi_radio_lease_t *lease,
    const uint8_t bssid[6], uint8_t channel,
    esp32_mquickjs_wifi_link_sample_t *sample)
{
    if (sample == NULL) return ESP_ERR_INVALID_ARG;
    memset(sample, 0, sizeof(*sample));
    if (bssid == NULL || channel == 0) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    wifi_ap_record_t ap;
    if (!wifi_radio_lease_valid(lease) ||
        lease->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA ||
        !s_radio.started || (s_radio.effective_mode != WIFI_MODE_STA && s_radio.effective_mode != WIFI_MODE_APSTA) ||
        s_radio.lifecycle.identity != 0U || s_radio.fault_stage != NULL ||
        s_radio.cleanup_stage != NULL) goto done;
    err = esp_wifi_sta_get_ap_info(&ap);
    if (err != ESP_OK) goto done;
    if (ap.primary != channel || memcmp(ap.bssid, bssid, 6) != 0) {
        err = ESP_ERR_INVALID_STATE;
        goto done;
    }
    sample->rssi_valid = esp_wifi_sta_get_rssi(&sample->rssi) == ESP_OK;
    sample->phy_valid = esp_wifi_sta_get_negotiated_phymode(&sample->phy) == ESP_OK;
    err = esp_wifi_sta_get_ap_info(&ap);
    if (err == ESP_OK && (ap.primary != channel || memcmp(ap.bssid, bssid, 6) != 0))
        err = ESP_ERR_INVALID_STATE;
done:
    wifi_radio_operation_unlock();
    if (err != ESP_OK) memset(sample, 0, sizeof(*sample));
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_get_country(wifi_country_t *country)
{
    if (country == NULL) return ESP_ERR_INVALID_ARG;
    memset(country, 0, sizeof(*country));
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (s_radio.driver_owned && s_radio.lifecycle.identity == 0U &&
        s_radio.fault_stage == NULL && s_radio.cleanup_stage == NULL &&
        (s_radio.driver_state == ESP32_MQUICKJS_WIFI_RADIO_STOPPED ||
         s_radio.driver_state == ESP32_MQUICKJS_WIFI_RADIO_STARTED)) {
        err = esp_wifi_get_country(country);
    }
    wifi_radio_operation_unlock();
    if (err != ESP_OK) memset(country, 0, sizeof(*country));
    return err;
}

#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI_CSI
esp_err_t esp32_mquickjs_wifi_radio_read_csi_config(
    const esp32_mquickjs_wifi_radio_lease_t *lease, wifi_csi_config_t *config,
    uint32_t *generation)
{
    if (!config || !generation) return ESP_ERR_INVALID_ARG;
    memset(config, 0, sizeof(*config));
    *generation = 0;
    wifi_csi_config_t observed = {0};
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_lease_valid(lease) || lease->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_CSI ||
        !s_radio.driver_owned || !s_radio.storage_configured || !s_radio.started ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED || s_radio.lifecycle.identity ||
        s_radio.operation.identity || s_radio.fault_stage || s_radio.cleanup_stage || s_radio.restart_required)
        goto done;
#if CONFIG_SOC_WIFI_HE_SUPPORT
    error = esp_wifi_get_csi_config(&observed);
#else
    /* The fixed legacy target libraries declare this API but do not define it. */
    error = ESP_ERR_NOT_SUPPORTED;
#endif
    if (error == ESP_OK) {
        *config = observed;
        *generation = s_radio.generation;
    }
done:
    wifi_radio_operation_unlock();
    return error;
}
#endif

