99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
static esp_err_t wifi_radio_write_tx_rate(void *opaque, wifi_interface_t interface,
    const wifi_tx_rate_config_t *config)
{
    (void)opaque;
    wifi_tx_rate_config_t value = *config;
    return esp_wifi_config_80211_tx(interface, &value);
}

/* Own the exact Radio lease until stop and restore are both complete. A failed
 * restore is retried against the captured predecessor, never against a guessed
 * default; generic release is blocked while this record exists. */
static esp_err_t wifi_radio_restore_tx_rate_locked(const esp32_mquickjs_wifi_radio_lease_t *lease)
{
    if (!wifi_radio_lease_valid(lease) || s_tx_rate_lease.identity != lease->identity ||
        s_tx_rate_lease.generation != lease->generation || !s_radio.driver_owned ||
        !s_radio.storage_configured) return ESP_ERR_INVALID_STATE;
    s_tx_rate_lease.restore_pending = true;
    esp_err_t err = wifi_radio_stop_lease_locked(lease, false);
    if (err != ESP_OK) { s_tx_rate_lease.restore_error = err; return err; }
    err = esp32_mquickjs_wifi_tx_rate_restore(&s_tx_rates, lease->generation, lease->identity,
        &s_tx_rate_lease, wifi_radio_write_tx_rate, NULL);
    if (err != ESP_OK) return wifi_radio_cleanup_fault(s_tx_rate_restore_fault, err);
    /* Successful restore settled the rate obligation. Other lifecycle faults
     * remain diagnostic and require their own cleanup. */
    taskENTER_CRITICAL(&s_radio.lock);
    if (s_radio.cleanup_stage == s_tx_rate_restore_fault) {
        s_radio.cleanup_stage = NULL; s_radio.cleanup_error = ESP_OK;
    }
    if (s_radio.fault_stage == s_tx_rate_restore_fault) {
        s_radio.fault_stage = NULL; s_radio.fault_error = ESP_OK;
    }
    s_radio.driver_state = s_radio.fault_stage == NULL && s_radio.cleanup_stage == NULL
        ? ESP32_MQUICKJS_WIFI_RADIO_STOPPED : ESP32_MQUICKJS_WIFI_RADIO_CLEANUP_PENDING;
    taskEXIT_CRITICAL(&s_radio.lock);
    return ESP_OK;
}

esp_err_t esp32_mquickjs_wifi_radio_tx_rate_status(wifi_interface_t interface,
    esp32_mquickjs_wifi_tx_rate_record_t *record, uint32_t *generation,
    esp32_mquickjs_wifi_tx_rate_lease_t *temporary)
{
    if (record == NULL || generation == NULL ||
        (interface != WIFI_IF_STA && interface != WIFI_IF_AP)) return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (interface == WIFI_IF_AP) return ESP_ERR_NOT_SUPPORTED;
#endif
    wifi_radio_operation_lock();
    *record = s_tx_rates.records[interface == WIFI_IF_STA ? 0 : 1];
    *generation = s_radio.generation;
    if (temporary != NULL) *temporary = s_tx_rate_lease.identity != 0U && s_tx_rate_lease.interface == interface
        ? s_tx_rate_lease : (esp32_mquickjs_wifi_tx_rate_lease_t){0};
    wifi_radio_operation_unlock();
    return ESP_OK;
}

esp_err_t esp32_mquickjs_wifi_radio_configure_tx_rate(wifi_interface_t interface,
    const wifi_tx_rate_config_t *config, esp32_mquickjs_wifi_tx_rate_write_t *write,
    esp32_mquickjs_wifi_tx_rate_record_t *record, uint32_t *generation,
    esp32_mquickjs_wifi_tx_rate_lease_t *temporary)
{
    if (temporary != NULL) *temporary = (esp32_mquickjs_wifi_tx_rate_lease_t){0};
    if (write == NULL || record == NULL || generation == NULL) return ESP_ERR_INVALID_ARG;
    *write = (esp32_mquickjs_wifi_tx_rate_write_t){0};
    *record = (esp32_mquickjs_wifi_tx_rate_record_t){0};
    *generation = 0;
    if ((interface != WIFI_IF_STA && interface != WIFI_IF_AP) ||
        !esp32_mquickjs_wifi_tx_rate_valid(config)) return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (interface == WIFI_IF_AP) return ESP_ERR_NOT_SUPPORTED;
#endif
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    bool repairing = s_radio.fault_stage == s_tx_rate_fault &&
        s_radio.cleanup_stage == s_tx_rate_fault &&
        s_radio.driver_state == ESP32_MQUICKJS_WIFI_RADIO_CLEANUP_PENDING;
    if (!s_radio.driver_owned || !s_radio.storage_configured || s_radio.started ||
        s_radio.stop_required || s_radio.restart_required || s_radio.wake_locks != 0 ||
        s_radio.lifecycle.identity != 0 || s_radio.operation.identity != 0 ||
        s_radio.promiscuous_claimed || (!repairing &&
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED ||
         s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL))) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0) goto done;
    err = esp32_mquickjs_wifi_tx_rate_apply(&s_tx_rates, s_radio.generation,
        interface, config, wifi_radio_write_tx_rate, NULL, write);
    if (write->attempted && esp32_mquickjs_wifi_tx_rate_uncertain(&s_tx_rates)) {
        /* Preserve the original failed write in the record; a failed restore
         * separately explains why new owners cannot safely enter. */
        if (write->uncertain) wifi_radio_cleanup_fault(s_tx_rate_fault,
            write->rollback_error != ESP_OK ? write->rollback_error : write->error);
    } else if (write->accepted && repairing) {
        taskENTER_CRITICAL(&s_radio.lock);
        s_radio.fault_stage = s_radio.cleanup_stage = NULL;
        s_radio.fault_error = s_radio.cleanup_error = ESP_OK;
        s_radio.driver_state = ESP32_MQUICKJS_WIFI_RADIO_STOPPED;
        taskEXIT_CRITICAL(&s_radio.lock);
    }
done:
    *record = s_tx_rates.records[interface == WIFI_IF_STA ? 0 : 1];
    *generation = s_radio.generation;
    if (temporary != NULL) *temporary = s_tx_rate_lease.identity != 0U && s_tx_rate_lease.interface == interface
        ? s_tx_rate_lease : (esp32_mquickjs_wifi_tx_rate_lease_t){0};
    wifi_radio_operation_unlock();
    return err;
}

static esp_err_t wifi_radio_connection_owner_locked(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    wifi_interface_t interface, bool observer)
{
#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    if (WIFI_RADIO_EAP_PENDING && !s_eap_radio.ready && !observer) return ESP_ERR_INVALID_STATE;
#endif
    if (!s_radio.driver_owned) return ESP_ERR_WIFI_NOT_INIT;
    if (!s_radio.storage_configured || s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED && s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED) ||
        !(s_radio.effective_mode & (interface == WIFI_IF_STA ? WIFI_MODE_STA : WIFI_MODE_AP))) return ESP_ERR_INVALID_STATE;
    if (!observer && !s_radio.started) return ESP_ERR_WIFI_NOT_STARTED;
    if (!observer && (s_radio.wake_locks != 0U || s_radio.promiscuous_claimed || s_tx_rate_lease.identity != 0U))
        return ESP_ERR_INVALID_STATE;
    const esp32_mquickjs_wifi_radio_lease_t *owners[3] = {application, station, access_point};
    const esp32_mquickjs_wifi_radio_client_t roles[3] = {ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION,
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA, ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP};
    uint32_t identities[3] = {0};
    for (size_t i = 0; i < 3; ++i) {
        if (owners[i] == NULL || !owners[i]->acquired) continue;
        if (owners[i]->client != roles[i] || !wifi_radio_lease_valid(owners[i])) return ESP_ERR_INVALID_STATE;
        identities[i] = owners[i]->identity;
    }
    /* A running interface belongs to its helper. Stopped RSSI configuration is
     * also legal without helpers; no default owner is manufactured. */
    if (s_radio.started && identities[interface == WIFI_IF_STA ? 1 : 2] == 0U) return ESP_ERR_INVALID_STATE;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        const wifi_radio_live_lease_t *owner = &s_radio.leases[i];
        if (owner->identity == 0U || owner->identity == identities[0] ||
            owner->identity == identities[1] || owner->identity == identities[2]) continue;
        if (!observer || owner->client == roles[0] || owner->client == roles[1] || owner->client == roles[2])
            return ESP_ERR_INVALID_STATE;
    }
    return ESP_OK;
}

#if CONFIG_ESP_WIFI_DPP_SUPPORT
#include "esp32_mquickjs_wifi_dpp_radio.inc"
#endif

#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE || CONFIG_ESP_WIFI_NAN_USD_ENABLE
#include "esp32_mquickjs_wifi_nan_radio.inc"
#endif
#if ESP32_MQUICKJS_WIFI_MESH_AVAILABLE
#include "esp32_mquickjs_wifi_mesh_radio.inc"
#endif

