99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
#if CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
#include "esp32_mquickjs_wifi_wps_radio.inc"
#if CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR
#include "esp32_mquickjs_wifi_wps_ap_radio.inc"
#endif

static bool wifi_radio_smartconfig_exact_locked(const esp32_mquickjs_wifi_radio_operation_t *token)
{
    return token && token->identity && s_sc_radio &&
        token->kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_SMARTCONFIG &&
        token->identity == s_radio.operation.identity && token->generation == s_radio.generation &&
        token->generation == s_radio.operation.generation && token->lease_identity == s_radio.operation.lease_identity &&
        token->kind == s_radio.operation.kind && s_radio.driver_owned;
}

static esp_err_t wifi_radio_smartconfig_snapshot_locked(const esp32_mquickjs_wifi_radio_operation_t *token,
    esp32_mquickjs_wifi_smartconfig_radio_status_t *status)
{
    *status = (esp32_mquickjs_wifi_smartconfig_radio_status_t){.error = ESP_ERR_INVALID_STATE,
        .stage = "smartconfig-radio-identity"};
    if (!wifi_radio_smartconfig_exact_locked(token)) return ESP_ERR_INVALID_STATE;
    status->operation = *token;
    status->home_primary = s_sc_radio->home_primary;
    status->home_secondary = s_sc_radio->home_secondary;
    status->channel_restored = s_sc_radio->channel_restored;
    taskENTER_CRITICAL(&s_radio.lock);
    status->event_fenced = s_sc_fence_seen == token->identity;
    taskEXIT_CRITICAL(&s_radio.lock);
    esp_err_t error = esp32_mquickjs_wifi_smartconfig_decoder_status(s_sc_radio->decoder, &status->decoder);
    if (error == ESP_OK && status->decoder.token.identity)
        error = esp32_mquickjs_wifi_smartconfig_events_status(&status->decoder.token, &status->events);
    status->error = error;
    status->stage = status->decoder.stage;
    return error;
}

static esp_err_t wifi_radio_smartconfig_restore_locked(void)
{
    if (s_sc_radio->channel_restored) return ESP_OK;
    esp32_mquickjs_wifi_smartconfig_decoder_status_t decoder;
    esp_err_t error = esp32_mquickjs_wifi_smartconfig_decoder_status(s_sc_radio->decoder, &decoder);
    if (error != ESP_OK) return error;
    if (decoder.handoff_unknown || !decoder.capture_stopped) return ESP_ERR_INVALID_STATE;
    /* Rejected foreign decoder preflight performed no RF mutation. In that
     * case even a seemingly helpful set_channel would affect someone else. */
    if (!decoder.mutation_attempted) { s_sc_radio->channel_restored = true; return ESP_OK; }
    if (!s_radio.started || s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED)
        return ESP_ERR_INVALID_STATE;
    wifi_ap_record_t ap = {0};
    error = esp_wifi_sta_get_ap_info(&ap);
    esp32_mquickjs_wireless_secure_zero(&ap, sizeof(ap));
    if (error != ESP_ERR_WIFI_NOT_CONNECT) return error == ESP_OK ? ESP_ERR_INVALID_STATE : error;
    uint8_t primary;
    wifi_second_chan_t secondary;
    uint32_t generation;
    error = wifi_radio_get_channel_locked(&primary, &secondary, &generation);
    if (error != ESP_OK) return error;
    if (primary != s_sc_radio->home_primary || secondary != s_sc_radio->home_secondary) {
        error = wifi_radio_validate_regulatory_channel(s_sc_radio->home_primary);
        if (error == ESP_OK) error = esp_wifi_set_channel(s_sc_radio->home_primary, s_sc_radio->home_secondary);
        if (error == ESP_OK) error = wifi_radio_get_channel_locked(&primary, &secondary, &generation);
        if (error != ESP_OK) return error;
        if (primary != s_sc_radio->home_primary || secondary != s_sc_radio->home_secondary)
            return ESP_ERR_INVALID_RESPONSE;
    }
    s_sc_radio->channel_restored = true;
    return ESP_OK;
}

esp_err_t esp32_mquickjs_wifi_radio_smartconfig_begin(
    const esp32_mquickjs_wifi_radio_lease_t owners[3], bool allow_ap_channel_change,
    const esp32_mquickjs_wifi_smartconfig_decoder_options_t *options,
    esp32_mquickjs_wifi_radio_operation_t *token,
    esp32_mquickjs_wifi_smartconfig_radio_status_t *status)
{
    if (!owners || !options || !token || !status || token->identity || token->generation || token->lease_identity || token->kind)
        return ESP_ERR_INVALID_ARG;
    *status = (esp32_mquickjs_wifi_smartconfig_radio_status_t){.stage = "smartconfig-radio-admission"};
    esp_err_t input_error = esp32_mquickjs_wifi_smartconfig_decoder_validate_options(options);
    if (input_error != ESP_OK) {
        status->error = input_error; status->stage = "smartconfig-options";
        return input_error;
    }
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (s_sc_radio || WIFI_RADIO_EAP_PENDING) goto done;
    error = wifi_radio_connection_owner_locked(&owners[0], &owners[1], &owners[2], WIFI_IF_STA, false);
    if (error != ESP_OK) goto done;
    if ((s_radio.effective_mode & WIFI_MODE_AP) && (!allow_ap_channel_change || !owners[2].acquired)) {
        error = ESP_ERR_INVALID_STATE; goto done;
    }
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity && s_radio.leases[i].fixed_channel) { error = ESP_ERR_INVALID_STATE; goto done; }
    wifi_ap_record_t ap = {0};
    error = esp_wifi_sta_get_ap_info(&ap);
    esp32_mquickjs_wireless_secure_zero(&ap, sizeof(ap));
    if (error != ESP_ERR_WIFI_NOT_CONNECT) { if (error == ESP_OK) error = ESP_ERR_INVALID_STATE; goto done; }
    uint8_t primary;
    wifi_second_chan_t secondary;
    uint32_t generation;
    error = wifi_radio_get_channel_locked(&primary, &secondary, &generation);
    if (error != ESP_OK) goto done;
    if (primary < 1 || primary > 14 || (secondary != WIFI_SECOND_CHAN_NONE &&
        secondary != WIFI_SECOND_CHAN_ABOVE && secondary != WIFI_SECOND_CHAN_BELOW)) {
        error = ESP_ERR_INVALID_STATE; goto done;
    }
    if (!s_radio.next_operation_identity) { error = ESP_ERR_NO_MEM; goto done; }
    wifi_radio_smartconfig_t *binding = esp32_mquickjs_memory_wireless_calloc("wifi.radio", 1, sizeof(*binding), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (!binding) { error = ESP_ERR_NO_MEM; goto done; }
    error = esp32_mquickjs_wifi_smartconfig_decoder_create(s_radio.generation, options, &binding->decoder);
    if (error != ESP_OK) { esp32_mquickjs_memory_payload_free(binding); goto done; }
    for (unsigned i = 0; i < 3; ++i) binding->owners[i] = owners[i].acquired ? owners[i].identity : 0;
    binding->home_primary = primary; binding->home_secondary = secondary;
    s_sc_radio = binding;
    taskENTER_CRITICAL(&s_radio.lock);
    s_sc_fence_posted = s_sc_fence_seen = 0;
    s_radio.operation = (esp32_mquickjs_wifi_radio_operation_t){.generation = s_radio.generation,
        .identity = s_radio.next_operation_identity++, .lease_identity = owners[1].identity,
        .kind = ESP32_MQUICKJS_WIFI_RADIO_OPERATION_SMARTCONFIG};
    *token = s_radio.operation;
    taskEXIT_CRITICAL(&s_radio.lock);
    error = esp32_mquickjs_wifi_smartconfig_decoder_start(binding->decoder);
    (void)wifi_radio_smartconfig_snapshot_locked(token, status);
done:
    status->error = error;
    wifi_radio_operation_unlock();
    return error;
}

esp_err_t esp32_mquickjs_wifi_radio_smartconfig_status(const esp32_mquickjs_wifi_radio_operation_t *token,
    esp32_mquickjs_wifi_smartconfig_radio_status_t *status)
{
    if (!status) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t error = wifi_radio_smartconfig_snapshot_locked(token, status);
    wifi_radio_operation_unlock();
    return error;
}

static esp_err_t wifi_radio_smartconfig_fence_locked(const esp32_mquickjs_wifi_radio_operation_t *token)
{
    taskENTER_CRITICAL(&s_radio.lock);
    bool ready = s_sc_fence_seen == token->identity;
    bool post = !ready && s_sc_fence_posted != token->identity;
    if (post) s_sc_fence_posted = token->identity;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (post) {
        esp_err_t error = esp_event_post(ESP32QJS_WIFI_RADIO_CONTROL_EVENT, WIFI_RADIO_SMARTCONFIG_FENCE_EVENT,
            token, sizeof(*token), 0);
        if (error != ESP_OK) {
            taskENTER_CRITICAL(&s_radio.lock);
            s_sc_fence_posted = 0;
            taskEXIT_CRITICAL(&s_radio.lock);
            return error;
        }
    }
    return ready ? ESP_OK : ESP_ERR_NOT_FINISHED;
}

esp_err_t esp32_mquickjs_wifi_radio_smartconfig_finish_capture(const esp32_mquickjs_wifi_radio_operation_t *token,
    esp32_mquickjs_wifi_smartconfig_radio_status_t *status)
{
    if (!status) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    const char *stage = NULL;
    if (wifi_radio_smartconfig_exact_locked(token)) {
        error = esp32_mquickjs_wifi_smartconfig_decoder_finish_capture(s_sc_radio->decoder);
        if (error == ESP_OK) { stage = "smartconfig-channel-restore"; error = wifi_radio_smartconfig_restore_locked(); }
        if (error == ESP_OK) { stage = "smartconfig-event-fence"; error = wifi_radio_smartconfig_fence_locked(token); }
    }
    (void)wifi_radio_smartconfig_snapshot_locked(token, status);
    status->error = error;
    if (error != ESP_OK && stage) status->stage = stage;
    wifi_radio_operation_unlock();
    return error != ESP_OK && stage && strcmp(stage, "smartconfig-event-fence") == 0 ? ESP_ERR_NOT_FINISHED : error;
}

esp_err_t esp32_mquickjs_wifi_radio_smartconfig_connection_begin(const esp32_mquickjs_wifi_radio_operation_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    taskENTER_CRITICAL(&s_radio.lock);
    bool fenced = token && token->identity && s_sc_fence_seen == token->identity;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (wifi_radio_smartconfig_exact_locked(token) && s_sc_radio->channel_restored &&
        fenced && !s_sc_radio->connection_used && s_radio.started &&
        s_radio.driver_state == ESP32_MQUICKJS_WIFI_RADIO_STARTED && !s_radio.fault_stage) {
        esp32_mquickjs_wifi_smartconfig_decoder_status_t decoder;
        error = esp32_mquickjs_wifi_smartconfig_decoder_status(s_sc_radio->decoder, &decoder);
        if (error == ESP_OK && (!decoder.capture_stopped || decoder.closing || decoder.handoff_unknown))
            error = ESP_ERR_INVALID_STATE;
        if (error == ESP_OK) {
            wifi_ap_record_t ap = {0};
            error = esp_wifi_sta_get_ap_info(&ap);
            esp32_mquickjs_wireless_secure_zero(&ap, sizeof(ap));
            error = error == ESP_ERR_WIFI_NOT_CONNECT ? ESP_OK : error == ESP_OK ? ESP_ERR_INVALID_STATE : error;
        }
        if (error == ESP_OK) s_sc_radio->connection_borrowed = s_sc_radio->connection_used = true;
    }
    wifi_radio_operation_unlock();
    return error;
}

esp_err_t esp32_mquickjs_wifi_radio_smartconfig_connection_end(const esp32_mquickjs_wifi_radio_operation_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (wifi_radio_smartconfig_exact_locked(token) && s_sc_radio->connection_borrowed) {
        s_sc_radio->connection_borrowed = false;
        error = ESP_OK;
    }
    wifi_radio_operation_unlock();
    return error;
}

esp_err_t esp32_mquickjs_wifi_radio_smartconfig_ack(const esp32_mquickjs_wifi_radio_operation_t *token,
    esp32_mquickjs_wifi_smartconfig_radio_status_t *status)
{
    if (!status) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (wifi_radio_smartconfig_exact_locked(token) && s_sc_radio->channel_restored)
        error = esp32_mquickjs_wifi_smartconfig_decoder_ack(s_sc_radio->decoder);
    (void)wifi_radio_smartconfig_snapshot_locked(token, status);
    status->error = error;
    wifi_radio_operation_unlock();
    return error;
}

esp_err_t esp32_mquickjs_wifi_radio_smartconfig_credentials(const esp32_mquickjs_wifi_radio_operation_t *token,
    esp32_mquickjs_wifi_smartconfig_credentials_t *credentials, bool commit)
{
    if ((!commit && !credentials) || (commit && credentials)) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    esp32_mquickjs_wifi_smartconfig_decoder_status_t decoder;
    if (wifi_radio_smartconfig_exact_locked(token) && s_sc_radio->channel_restored) {
        error = esp32_mquickjs_wifi_smartconfig_decoder_status(s_sc_radio->decoder, &decoder);
        if (error == ESP_OK && (decoder.handoff_unknown || !decoder.capture_stopped || decoder.closing))
            error = ESP_ERR_INVALID_STATE;
        if (error == ESP_OK) error = esp32_mquickjs_wifi_smartconfig_decoder_credentials(
            s_sc_radio->decoder, credentials, commit);
    }
    wifi_radio_operation_unlock();
    return error;
}

