99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_smartconfig_close(esp32_mquickjs_wifi_radio_operation_t *token,
    esp32_mquickjs_wifi_smartconfig_radio_status_t *status)
{
    if (!status || !token) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    const char *stage = NULL;
    if (wifi_radio_smartconfig_exact_locked(token)) {
        if (s_sc_radio->connection_borrowed) {
            (void)wifi_radio_smartconfig_snapshot_locked(token, status);
            status->error = ESP_ERR_NOT_FINISHED;
            status->stage = "smartconfig-connection-drain";
            wifi_radio_operation_unlock();
            return ESP_ERR_NOT_FINISHED;
        }
        error = esp32_mquickjs_wifi_smartconfig_decoder_close(s_sc_radio->decoder);
        if (error == ESP_OK) { stage = "smartconfig-channel-restore"; error = wifi_radio_smartconfig_restore_locked(); }
        if (error == ESP_OK) { stage = "smartconfig-event-fence"; error = wifi_radio_smartconfig_fence_locked(token); }
        (void)wifi_radio_smartconfig_snapshot_locked(token, status);
        if (error == ESP_OK) {
            stage = "smartconfig-decoder-release";
            error = esp32_mquickjs_wifi_smartconfig_decoder_release(&s_sc_radio->decoder);
            if (error == ESP_OK) {
                esp32_mquickjs_memory_payload_free(s_sc_radio); s_sc_radio = NULL;
                taskENTER_CRITICAL(&s_radio.lock);
                memset(&s_radio.operation, 0, sizeof(s_radio.operation));
                memset(token, 0, sizeof(*token));
                taskEXIT_CRITICAL(&s_radio.lock);
            }
        }
    } else (void)wifi_radio_smartconfig_snapshot_locked(token, status);
    status->error = error;
    if (error != ESP_OK && stage) status->stage = stage;
    wifi_radio_operation_unlock();
    return error;
}
#endif

#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
static bool wifi_radio_eap_exact_locked(uint64_t identity)
{
    if (!identity || identity != s_eap_radio.identity || s_eap_radio.generation != s_radio.generation)
        return false;
    const esp32_mquickjs_wifi_radio_client_t roles[3] = {ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION,
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA, ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP};
    for (unsigned i = 0; i < 3; ++i) {
        if (!s_eap_radio.owners[i]) continue;
        esp32_mquickjs_wifi_radio_lease_t lease = {.identity = s_eap_radio.owners[i],
            .generation = s_eap_radio.generation, .client = roles[i], .acquired = true};
        if (!wifi_radio_lease_valid(&lease)) return false;
    }
    return true;
}

static esp_err_t wifi_radio_eap_disconnected_locked(void)
{
    wifi_ap_record_t ap;
    esp_err_t error = esp_wifi_sta_get_ap_info(&ap);
    esp32_mquickjs_wireless_secure_zero(&ap, sizeof(ap));
    return error == ESP_ERR_WIFI_NOT_CONNECT ? ESP_OK : error == ESP_OK ? ESP_ERR_INVALID_STATE : error;
}

esp_err_t esp32_mquickjs_wifi_radio_eap_install(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    esp32_mquickjs_wifi_eap_profile_t *profile,
    esp32_mquickjs_wifi_eap_install_result_t *result)
{
    if (!result || !profile) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_eap_install_result_t){.stage = "radio-admission", .error = ESP_ERR_INVALID_STATE};
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (WIFI_RADIO_EAP_PENDING) goto done;
    error = wifi_radio_connection_owner_locked(application, station, access_point, WIFI_IF_STA, false);
    if (error != ESP_OK) goto done;
    error = wifi_radio_eap_disconnected_locked();
    if (error != ESP_OK) goto done;
    error = esp32_mquickjs_wifi_eap_install(profile, result);
    if (result->retained && result->identity) {
        s_eap_radio.identity = result->identity;
        s_eap_radio.generation = s_radio.generation;
        const esp32_mquickjs_wifi_radio_lease_t *owners[3] = {application, station, access_point};
        for (unsigned i = 0; i < 3; ++i)
            s_eap_radio.owners[i] = owners[i] && owners[i]->acquired ? owners[i]->identity : 0;
        s_eap_radio.ready = error == ESP_OK && result->enabled;
    }
done:
    result->error = error;
    wifi_radio_operation_unlock();
    return error;
}

/* Stop admission is one lock interval: exact EAP pins plus the ordinary live
 * registry, wake/operation/promiscuous checks. It never clears credentials before
 * ownership has transferred to a lifecycle that survives cleanup failures. */
esp_err_t esp32_mquickjs_wifi_radio_eap_begin_stop(uint64_t identity,
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (!identity || !token || token->identity || token->generation) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t error = wifi_radio_eap_exact_locked(identity) ?
        wifi_radio_begin_lifecycle_with_dependents_locked(application, station, access_point, NULL, NULL, token, identity) : ESP_ERR_INVALID_STATE;
    wifi_radio_operation_unlock();
    return error;
}

esp_err_t esp32_mquickjs_wifi_radio_eap_begin_restart(uint64_t identity,
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    esp32_mquickjs_wifi_eap_profile_t *profile, bool allow_ap_restart,
    esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t *mode)
{
    if (!profile || !mode || !token || token->identity || token->generation) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_eap_exact_locked(identity) || !s_eap_radio.ready ||
        s_radio.generation == UINT32_MAX || s_radio.event_phase != RADIO_EVENTS_IDLE ||
        s_tx_rate_lease.identity || s_tx_rate_lease.restore_pending || s_interval.owner.identity || s_interval.restore_pending ||
        s_vendor_ie.start_owner.identity || s_config_restart.snapshot || s_policy_restart.owner.identity)
        goto done;
    error = wifi_radio_connection_owner_locked(application, station, access_point, WIFI_IF_STA, false);
    if (error != ESP_OK) goto done;
    wifi_mode_t actual;
    error = esp_wifi_get_mode(&actual);
    if (error != ESP_OK) goto done;
    if ((actual != WIFI_MODE_STA && actual != WIFI_MODE_APSTA) || actual != s_radio.effective_mode ||
        (actual == WIFI_MODE_APSTA && !allow_ap_restart)) { error = ESP_ERR_INVALID_STATE; goto done; }
    /* This source is running. START observations must match its interfaces;
     * requiring zero would only admit a stopped/inconsistent source. */
    taskENTER_CRITICAL(&s_radio.lock);
    bool live = s_radio.event_live == actual;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (!live) { error = ESP_ERR_INVALID_STATE; goto done; }
    unsigned owners = actual == WIFI_MODE_APSTA ? 3U : 2U;
    if (!s_radio.next_lease_identity || owners - 1 > UINT32_MAX - s_radio.next_lease_identity) {
        error = ESP_ERR_NO_MEM;
        goto done;
    }
    error = wifi_radio_eap_disconnected_locked();
    if (error != ESP_OK) goto done;
    esp32_mquickjs_wifi_eap_install_result_t source;
    error = esp32_mquickjs_wifi_eap_install_restart_source(identity, profile, &source);
    if (error != ESP_OK || !source.enabled || !source.retained) {
        if (error == ESP_OK) error = ESP_ERR_INVALID_STATE;
        goto done;
    }
    error = wifi_radio_begin_lifecycle_with_dependents_locked(application, station, access_point, NULL, NULL, token, identity);
    if (error == ESP_OK) *mode = actual;
done:
    wifi_radio_operation_unlock();
    return error;
}

static esp_err_t wifi_radio_eap_restart_install_locked(esp32_mquickjs_wifi_eap_profile_t *profile,
    const esp32_mquickjs_wifi_radio_lease_t owners[3])
{
    if (WIFI_RADIO_EAP_PENDING) return ESP_ERR_INVALID_STATE;
    esp32_mquickjs_wifi_eap_install_result_t result;
    esp_err_t error = wifi_radio_eap_disconnected_locked();
    if (error != ESP_OK) return error;
    error = esp32_mquickjs_wifi_eap_install(profile, &result);
    if (result.retained && result.identity) {
        s_eap_radio.identity = result.identity;
        s_eap_radio.generation = s_radio.generation;
        s_eap_radio.ready = error == ESP_OK && result.enabled;
        /* Failed installation is pinned by the still-live lifecycle, not by
         * unpublished staged leases. Clear must precede STOP/deinit on retry. */
        for (unsigned i = 0; i < 3; ++i)
            s_eap_radio.owners[i] = s_eap_radio.ready ? owners[i].identity : 0;
    }
    if (error == ESP_OK && (!result.retained || !result.identity || !result.enabled)) error = ESP_ERR_INVALID_RESPONSE;
    if (error != ESP_OK) {
        taskENTER_CRITICAL(&s_radio.lock);
        s_radio.configuration = (esp32_mquickjs_wifi_radio_config_result_t){
            .stage = "restart-enterprise-install", .error = error, .mutation_attempted = true};
        taskEXIT_CRITICAL(&s_radio.lock);
        (void)wifi_radio_record_fault("restart-enterprise-install", error);
    }
    return error;
}

esp_err_t esp32_mquickjs_wifi_radio_eap_resume_restart(
    esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode,
    esp32_mquickjs_wifi_radio_lease_t *application,
    esp32_mquickjs_wifi_radio_lease_t *station,
    esp32_mquickjs_wifi_radio_lease_t *access_point,
    esp32_mquickjs_wifi_eap_profile_t *profile)
{
    if (!profile) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (!WIFI_RADIO_EAP_PENDING && wifi_radio_restart_checkpoint_matches_locked(token, mode))
        error = wifi_radio_resume_lifecycle_locked(token, mode, true, application, station, access_point, NULL, false, profile);
    wifi_radio_operation_unlock();
    return error;
}

static esp_err_t wifi_radio_eap_clear_locked(uint64_t identity,
    const esp32_mquickjs_wifi_radio_lifecycle_t *token,
    esp32_mquickjs_wifi_eap_install_result_t *result)
{
    if (!result) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_eap_install_result_t){.stage = "radio-clear", .error = ESP_ERR_INVALID_STATE};
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (token) {
        if (!token->identity || token->identity != s_radio.lifecycle.identity ||
            token->generation != s_radio.lifecycle.generation)
            goto done;
        /* A restart retains the original lifecycle across physical driver
         * generations; the binding below must still name the current driver. */
        /* This lifecycle excludes installation of a successor binding. A prior
         * successful clear is a completed prefix, not a reason to call SDK again. */
        if (!s_eap_radio.identity) { error = ESP_OK; goto done; }
    } else if (s_radio.lifecycle.identity) goto done;
    if (!wifi_radio_eap_exact_locked(identity) || s_radio.operation.identity) goto done;
    error = wifi_radio_eap_disconnected_locked();
    if (error != ESP_OK) goto done;
    s_eap_radio.ready = false;
    error = esp32_mquickjs_wifi_eap_install_clear(identity, result);
    if (error == ESP_OK && result->entered && !result->retained && !result->identity &&
        result->sdk.entered && !result->sdk.resources) memset(&s_eap_radio, 0, sizeof(s_eap_radio));
done:
    if (identity && identity == s_eap_radio.identity) {
        result->identity = identity;
        result->retained = true;
        if (error == ESP_OK) error = ESP_ERR_INVALID_STATE;
    }
    result->error = error;
    return error;
}

