99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_eap_clear(uint64_t identity,
    esp32_mquickjs_wifi_eap_install_result_t *result)
{
    wifi_radio_operation_lock();
    esp_err_t error = wifi_radio_eap_clear_locked(identity, NULL, result);
    wifi_radio_operation_unlock();
    return error;
}

esp_err_t esp32_mquickjs_wifi_radio_eap_clear_lifecycle(uint64_t identity,
    const esp32_mquickjs_wifi_radio_lifecycle_t *token,
    esp32_mquickjs_wifi_eap_install_result_t *result)
{
    if (!identity || !token) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t error = wifi_radio_eap_clear_locked(identity, token, result);
    wifi_radio_operation_unlock();
    return error;
}

esp_err_t esp32_mquickjs_wifi_radio_eap_status(uint64_t identity,
    esp32_mquickjs_wifi_eap_install_result_t *result)
{
    if (!result) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_eap_install_result_t){.stage = "radio-status", .error = ESP_ERR_INVALID_STATE};
    wifi_radio_operation_lock();
    esp_err_t error = wifi_radio_eap_exact_locked(identity)
        ? esp32_mquickjs_wifi_eap_install_status(identity, result) : ESP_ERR_INVALID_STATE;
    if (identity && identity == s_eap_radio.identity) {
        result->identity = identity;
        result->retained = true;
    }
    result->error = error;
    wifi_radio_operation_unlock();
    return error;
}

uint64_t esp32_mquickjs_wifi_radio_eap_identity(void)
{
    wifi_radio_operation_lock();
    uint64_t identity = s_eap_radio.identity;
    wifi_radio_operation_unlock();
    return identity;
}

bool esp32_mquickjs_wifi_radio_eap_ready(void)
{
    wifi_radio_operation_lock();
    bool ready = s_eap_radio.identity && s_eap_radio.ready;
    wifi_radio_operation_unlock();
    return ready;
}
#endif

#if CONFIG_ESP_WIFI_RRM_SUPPORT
static bool wifi_radio_rrm_exact_locked(const esp32_mquickjs_wifi_radio_operation_t *token)
{
    return token != NULL && token->identity != 0U &&
        token->kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_RRM &&
        token->identity == s_radio.operation.identity && token->generation == s_radio.operation.generation &&
        token->lease_identity == s_radio.operation.lease_identity && token->kind == s_radio.operation.kind &&
        token->generation == s_radio.generation && s_radio.driver_owned;
}

esp_err_t esp32_mquickjs_wifi_radio_rrm_reserve(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    esp32_mquickjs_wifi_radio_operation_t *token)
{
    if (token == NULL || token->identity || token->generation || token->lease_identity || token->kind)
        return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_connection_owner_locked(application, station, access_point, WIFI_IF_STA, false);
    if (err != ESP_OK) goto done;
    if (s_radio.next_operation_identity == 0U) { err = ESP_ERR_NO_MEM; goto done; }
    wifi_config_t config;
    err = esp_wifi_get_config(WIFI_IF_STA, &config);
    bool enabled = err == ESP_OK && config.sta.rm_enabled;
    esp32_mquickjs_wireless_secure_zero(&config, sizeof(config));
    if (err != ESP_OK) goto done;
    if (!enabled) { err = ESP_ERR_INVALID_STATE; goto done; }
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.operation = (esp32_mquickjs_wifi_radio_operation_t){
        .generation = s_radio.generation, .lease_identity = station->identity,
        .identity = s_radio.next_operation_identity++, .kind = ESP32_MQUICKJS_WIFI_RADIO_OPERATION_RRM,
    };
    *token = s_radio.operation;
    taskEXIT_CRITICAL(&s_radio.lock);
done:
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_rrm_command(
    const esp32_mquickjs_wifi_radio_operation_t *token, esp32_mquickjs_wifi_rrm_command_t command,
    esp32_mquickjs_wifi_rrm_callback_t callback, esp32_mquickjs_wifi_rrm_sdk_result_t *result)
{
    if (result == NULL || callback == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_rrm_sdk_result_t){.ownership = -1};
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (wifi_radio_rrm_exact_locked(token))
        err = esp32_mquickjs_wifi_rrm_sdk_command(command, callback, (void *)(uintptr_t)token->identity, result);
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_rrm_retire(
    esp32_mquickjs_wifi_radio_operation_t *token, esp32_mquickjs_wifi_rrm_callback_t callback,
    esp32_mquickjs_wifi_rrm_sdk_result_t *result)
{
    if (result == NULL || callback == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_rrm_sdk_result_t){.ownership = -1};
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_rrm_exact_locked(token)) goto done;
    err = esp32_mquickjs_wifi_rrm_sdk_command(ESP32_MQUICKJS_WIFI_RRM_QUERY,
        callback, (void *)(uintptr_t)token->identity, result);
    if (err != ESP_OK) goto done;
    if (result->ownership != 0) { err = ESP_ERR_INVALID_STATE; goto done; }
    taskENTER_CRITICAL(&s_radio.lock);
    memset(&s_radio.operation, 0, sizeof(s_radio.operation));
    memset(token, 0, sizeof(*token));
    taskEXIT_CRITICAL(&s_radio.lock);
done:
    wifi_radio_operation_unlock();
    return err;
}
#endif

#if CONFIG_ESP_WIFI_RRM_SUPPORT || CONFIG_ESP_WIFI_WNM_SUPPORT
esp_err_t esp32_mquickjs_wifi_radio_roaming(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    const esp32_mquickjs_wifi_btm_query_t *query, esp32_mquickjs_wifi_roaming_result_t *result)
{
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_roaming_result_t){.stage = "radio-admission"};
    wifi_radio_operation_lock();
    esp_err_t err = ESP_OK;
    result->radio_generation = s_radio.driver_owned ? s_radio.generation : 0;
    if (query != NULL) {
        err = wifi_radio_connection_owner_locked(application, station, access_point, WIFI_IF_STA, false);
        if (err != ESP_OK) goto done;
        if ((s_radio.effective_mode & WIFI_MODE_AP) && !query->allow_ap_channel_change) {
            result->stage = "ap-channel-permission"; err = ESP_ERR_INVALID_STATE; goto done;
        }
        taskENTER_CRITICAL(&s_radio.lock);
        bool pinned = false;
        for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
            const wifi_radio_live_lease_t *owner = &s_radio.leases[i];
            if (owner->identity && (owner->fixed_channel || owner->channel_conflict || owner->raw_tx_identity)) pinned = true;
        }
        taskEXIT_CRITICAL(&s_radio.lock);
        if (pinned) { result->stage = "fixed-channel-owner"; err = ESP_ERR_INVALID_STATE; goto done; }
        /* A query may lead to later autonomous channel movement. Invalidate any
         * saved STOP observation before dispatch, including failed attempts. */
        wifi_radio_invalidate_stop_snapshot_locked();
    } else {
        if (s_radio.lifecycle.identity || s_radio.operation.identity || s_radio.fault_stage ||
            s_radio.cleanup_stage || s_radio.restart_required) { err = ESP_ERR_INVALID_STATE; goto done; }
        if (!s_radio.driver_owned || !s_radio.started || !(s_radio.effective_mode & WIFI_MODE_STA)) goto done;
        if (!s_radio.storage_configured || s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED) {
            err = ESP_ERR_INVALID_STATE; goto done;
        }
    }
    err = esp32_mquickjs_wifi_roaming_sdk(query, result);
done:
    result->error = err;
    wifi_radio_operation_unlock();
    return err;
}
#endif

