99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_write_interval(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point, uint16_t milliseconds,
    esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "interval-admission", .error = ESP_ERR_INVALID_STATE};
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (!s_radio.storage_configured || s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required ||
        s_interval.owner.identity != 0U) goto done;
    if (s_radio.started) {
        wifi_interface_t interface = (s_radio.effective_mode & WIFI_MODE_STA) ? WIFI_IF_STA : WIFI_IF_AP;
        err = wifi_radio_connection_owner_locked(application, station, access_point, interface, false);
        if (err != ESP_OK) goto done;
    } else {
        if (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED || s_radio.stop_required ||
            s_radio.wake_locks != 0U || s_radio.promiscuous_claimed || s_tx_rate_lease.identity != 0U) goto done;
        for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
            if (s_radio.leases[i].identity != 0U) goto done;
    }
    result->stage = "interval-write";
    esp32_mquickjs_wifi_interval_result_t write;
    err = esp32_mquickjs_wifi_interval_write(&s_interval, s_radio.generation,
        milliseconds, wifi_radio_interval_writer, NULL, &write);
    result->mutation_attempted = write.attempted;
    if (err == ESP_OK) result->stage = "complete";
    /* A failed write quarantines interval knowledge. Explicit replacement or
     * physical deinit can clear it; never invent readback or replay zero. */
done:
    result->error = err;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.configuration = *result;
    taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return err;
}

#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_RESPONDER_SUPPORT && CONFIG_ESP_WIFI_SOFTAP_SUPPORT
static esp_err_t wifi_radio_ftm_offset_writer(void *opaque, int16_t centimeters)
{
    (void)opaque;
    return esp_wifi_ftm_resp_set_offset(centimeters);
}

void esp32_mquickjs_wifi_radio_ftm_offset_status(esp32_mquickjs_wifi_ftm_offset_state_t *record)
{
    if (record == NULL) return;
    wifi_radio_operation_lock();
    *record = s_ftm_offset;
    wifi_radio_operation_unlock();
}

esp_err_t esp32_mquickjs_wifi_radio_write_ftm_offset(int32_t centimeters,
    esp32_mquickjs_wifi_ftm_offset_state_t *record, esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (record != NULL) *record = (esp32_mquickjs_wifi_ftm_offset_state_t){0};
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "ftm-offset-admission", .error = ESP_ERR_INVALID_ARG};
    if (record == NULL || centimeters < INT16_MIN || centimeters > INT16_MAX) return result->error;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (!s_radio.storage_configured || s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED ||
        s_radio.started || s_radio.stop_required || s_radio.lifecycle.identity != 0U ||
        s_radio.operation.identity != 0U || s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL ||
        s_radio.restart_required || s_radio.wake_locks != 0U || s_radio.promiscuous_claimed ||
        s_tx_rate_lease.identity != 0U || !(s_radio.effective_mode & WIFI_MODE_AP)) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
    wifi_mode_t mode;
    result->stage = "ftm-offset-mode";
    err = esp_wifi_get_mode(&mode);
    if (err != ESP_OK) goto done;
    if (mode != s_radio.effective_mode) { err = ESP_ERR_INVALID_STATE; goto done; }
    result->stage = "ftm-offset-write";
    err = esp32_mquickjs_wifi_ftm_offset_apply(&s_ftm_offset, s_radio.generation,
        (int16_t)centimeters, wifi_radio_ftm_offset_writer, NULL, &result->mutation_attempted);
    if (err == ESP_OK) result->stage = "complete";
    else if (!result->mutation_attempted) result->stage = "ftm-offset-revision";
done:
    *record = s_ftm_offset;
    result->error = err;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.configuration = *result;
    taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return err;
}
#endif

static esp_err_t wifi_radio_policy_writer(void *opaque,
    esp32_mquickjs_wifi_policy_slot_t slot, bool requested)
{
    (void)opaque;
    switch (slot) {
    case ESP32_MQUICKJS_WIFI_POLICY_SLOT_DYNAMIC_CS:
        return esp_wifi_set_dynamic_cs(requested);
    case ESP32_MQUICKJS_WIFI_POLICY_SLOT_STA_11B:
        return esp_wifi_config_11b_rate(WIFI_IF_STA, requested);
    case ESP32_MQUICKJS_WIFI_POLICY_SLOT_AP_11B:
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
        return esp_wifi_config_11b_rate(WIFI_IF_AP, requested);
#else
        return ESP_ERR_NOT_SUPPORTED;
#endif
    case ESP32_MQUICKJS_WIFI_POLICY_SLOT_COEX_POWER:
#if CONFIG_ESP_COEX_POWER_MANAGEMENT
        return esp_wifi_coex_pwr_configure(requested);
#else
        return ESP_ERR_NOT_SUPPORTED;
#endif
#if CONFIG_SOC_WIFI_HE_SUPPORT
    case ESP32_MQUICKJS_WIFI_POLICY_SLOT_BSS_COLOR:
        return esp_wifi_enable_bsscolor_collision_detection(WIFI_IF_STA, requested);
#endif
    default:
        return ESP_ERR_INVALID_ARG;
    }
}

static esp_err_t wifi_radio_policy_restart_prepare_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    if (token == NULL || token->identity == 0U || token->identity != s_radio.lifecycle.identity ||
        token->generation != s_radio.lifecycle.generation) return ESP_ERR_INVALID_STATE;
    if (s_policy_restart.owner.identity != 0U)
        return s_policy_restart.owner.identity == token->identity &&
            s_policy_restart.owner.generation == token->generation && s_policy_restart.mode == mode
            ? ESP_OK : ESP_ERR_INVALID_STATE;
    esp32_mquickjs_wifi_policy_snapshot_t snapshot;
    esp_err_t err = esp32_mquickjs_wifi_policy_capture(&s_policies, s_radio.generation, &snapshot);
    if (err != ESP_OK) return err;
    if (((snapshot.mask & (1U << ESP32_MQUICKJS_WIFI_POLICY_SLOT_STA_11B)) && !(mode & WIFI_MODE_STA)) ||
        ((snapshot.mask & (1U << ESP32_MQUICKJS_WIFI_POLICY_SLOT_AP_11B)) && !(mode & WIFI_MODE_AP)))
        return ESP_ERR_INVALID_STATE;
#if CONFIG_SOC_WIFI_HE_SUPPORT
    if ((snapshot.mask & (1U << ESP32_MQUICKJS_WIFI_POLICY_SLOT_BSS_COLOR)) && !(mode & WIFI_MODE_STA))
        return ESP_ERR_INVALID_STATE;
#endif
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_RESPONDER_SUPPORT && CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    esp32_mquickjs_wifi_ftm_offset_snapshot_t offset;
    err = esp32_mquickjs_wifi_ftm_offset_capture(&s_ftm_offset, s_radio.generation, &offset);
    if (err != ESP_OK) return err;
    if (offset.configured && !(mode & WIFI_MODE_AP)) return ESP_ERR_INVALID_STATE;
    s_policy_restart.ftm_offset = offset;
#endif
    s_policy_restart.owner = *token;
    s_policy_restart.snapshot = snapshot;
    s_policy_restart.mode = mode;
    return ESP_OK;
}

static esp_err_t wifi_radio_policy_restart_replay_locked(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, bool after_start)
{
    if (token == NULL || token->identity == 0U || token->identity != s_radio.lifecycle.identity ||
        token->generation != s_radio.lifecycle.generation || s_policy_restart.owner.identity != token->identity ||
        s_policy_restart.owner.generation != token->generation || !s_radio.driver_owned || !s_radio.storage_configured ||
        s_radio.effective_mode != s_policy_restart.mode || s_radio.started != after_start ||
        s_radio.driver_state != (after_start ? ESP32_MQUICKJS_WIFI_RADIO_STARTED : ESP32_MQUICKJS_WIFI_RADIO_STOPPED))
        return ESP_ERR_INVALID_STATE;
    if (s_policy_restart.replay_generation != s_radio.generation) {
        /* A fresh physical generation must replay every setting. Never skip a
         * prior generation's writes after cleanup/retry rebuilt the driver. */
        s_policy_restart.replay_generation = s_radio.generation;
        s_policy_restart.completed = 0;
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_RESPONDER_SUPPORT && CONFIG_ESP_WIFI_SOFTAP_SUPPORT
        s_policy_restart.ftm_offset_completed = false;
#endif
    }
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_RESPONDER_SUPPORT && CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    /* Never defer an offset write until an AP can already accept FTM requests. */
    if (after_start && !s_policy_restart.ftm_offset_completed) return ESP_ERR_INVALID_STATE;
    if (!after_start) {
        esp_err_t offset_error = esp32_mquickjs_wifi_ftm_offset_replay(&s_ftm_offset,
            s_radio.generation, &s_policy_restart.ftm_offset, &s_policy_restart.ftm_offset_completed,
            wifi_radio_ftm_offset_writer, NULL);
        if (offset_error != ESP_OK) return wifi_radio_record_fault("restart-ftm-offset", offset_error);
    }
#endif
    esp32_mquickjs_wifi_policy_write_t write;
    esp_err_t err = esp32_mquickjs_wifi_policy_replay(&s_policies, s_radio.generation,
        &s_policy_restart.snapshot, after_start, &s_policy_restart.completed,
        wifi_radio_policy_writer, NULL, &write);
    if (err != ESP_OK) (void)wifi_radio_record_fault(
        after_start ? "restart-policy-post-start" : "restart-policy-pre-start", err);
    return err;
}

void esp32_mquickjs_wifi_radio_policy_status(esp32_mquickjs_wifi_policy_state_t *status)
{
    if (status == NULL) return;
    wifi_radio_operation_lock();
    *status = s_policies;
    wifi_radio_operation_unlock();
}

