99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_write_policy(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    esp32_mquickjs_wifi_policy_control_t control, wifi_interface_t interface,
    bool requested, bool *accepted, esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (accepted != NULL) *accepted = false;
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "policy-admission", .error = ESP_ERR_INVALID_ARG};
    bool by_interface = control == ESP32_MQUICKJS_WIFI_POLICY_11B_RATE;
    if (accepted == NULL || (unsigned)control > ESP32_MQUICKJS_WIFI_POLICY_BSS_COLOR ||
        (by_interface ? interface != WIFI_IF_STA && interface != WIFI_IF_AP : interface != WIFI_IF_MAX))
        return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (by_interface && interface == WIFI_IF_AP) { result->error = ESP_ERR_NOT_SUPPORTED; return result->error; }
#endif
#if !CONFIG_ESP_COEX_POWER_MANAGEMENT
    if (control == ESP32_MQUICKJS_WIFI_POLICY_COEX_POWER) { result->error = ESP_ERR_NOT_SUPPORTED; return result->error; }
#endif
#if !CONFIG_SOC_WIFI_HE_SUPPORT
    if (control == ESP32_MQUICKJS_WIFI_POLICY_BSS_COLOR) { result->error = ESP_ERR_NOT_SUPPORTED; return result->error; }
#endif
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (!s_radio.storage_configured || s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED)) goto done;
    if (by_interface && !(s_radio.effective_mode & (interface == WIFI_IF_STA ? WIFI_MODE_STA : WIFI_MODE_AP))) goto done;
    if (control == ESP32_MQUICKJS_WIFI_POLICY_BSS_COLOR && !(s_radio.effective_mode & WIFI_MODE_STA)) goto done;
    if (s_radio.started) {
        if (by_interface) goto done; /* SDK 11b rate is pre-start only. */
        wifi_interface_t owner_interface = (s_radio.effective_mode & WIFI_MODE_STA) ? WIFI_IF_STA : WIFI_IF_AP;
        err = wifi_radio_connection_owner_locked(application, station, access_point, owner_interface, false);
        if (err != ESP_OK) goto done;
    } else {
        if (control == ESP32_MQUICKJS_WIFI_POLICY_DYNAMIC_CS || control == ESP32_MQUICKJS_WIFI_POLICY_BSS_COLOR) { err = ESP_ERR_WIFI_NOT_STARTED; goto done; }
        if (s_radio.stop_required || s_radio.wake_locks != 0U || s_radio.promiscuous_claimed || s_tx_rate_lease.identity != 0U) goto done;
        for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
            if (s_radio.leases[i].identity != 0U) goto done;
    }
    esp32_mquickjs_wifi_policy_slot_t slot;
    switch (control) {
    case ESP32_MQUICKJS_WIFI_POLICY_DYNAMIC_CS:
        slot = ESP32_MQUICKJS_WIFI_POLICY_SLOT_DYNAMIC_CS;
        result->stage = "dynamic-cs-write";
        break;
    case ESP32_MQUICKJS_WIFI_POLICY_11B_RATE:
        slot = interface == WIFI_IF_STA ? ESP32_MQUICKJS_WIFI_POLICY_SLOT_STA_11B : ESP32_MQUICKJS_WIFI_POLICY_SLOT_AP_11B;
        result->stage = "11b-rate-write";
        break;
    case ESP32_MQUICKJS_WIFI_POLICY_COEX_POWER:
        slot = ESP32_MQUICKJS_WIFI_POLICY_SLOT_COEX_POWER;
        result->stage = "coexistence-power-write";
        break;
#if CONFIG_SOC_WIFI_HE_SUPPORT
    case ESP32_MQUICKJS_WIFI_POLICY_BSS_COLOR:
        slot = ESP32_MQUICKJS_WIFI_POLICY_SLOT_BSS_COLOR;
        result->stage = "bss-color-reporting-write";
        break;
#endif
    default:
        err = ESP_ERR_INVALID_ARG;
        goto done;
    }
    esp32_mquickjs_wifi_policy_write_t write;
    err = esp32_mquickjs_wifi_policy_apply(&s_policies, s_radio.generation, slot,
        requested, wifi_radio_policy_writer, NULL, &write);
    result->mutation_attempted = write.attempted;
    if (err == ESP_OK) { *accepted = requested; result->stage = "complete"; }
    else if (write.attempted) {
        /* The retained accepted value is history after a failed SDK call, not
         * proof of the driver's current policy. No guessed rollback or replay. */
        (void)wifi_radio_record_fault(result->stage, err);
    } else {
        result->stage = "policy-record-admission";
    }

done:
    result->error = err;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.configuration = *result;
    taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return err;
}

static esp_err_t wifi_radio_band_snapshot(wifi_band_mode_t *mode, wifi_band_t *band)
{
    esp_err_t err = esp_wifi_get_band_mode(mode);
    if (err != ESP_OK) return err;
    if (*mode != WIFI_BAND_MODE_2G_ONLY && *mode != WIFI_BAND_MODE_5G_ONLY && *mode != WIFI_BAND_MODE_AUTO)
        return ESP_ERR_INVALID_RESPONSE;
    err = esp_wifi_get_band(band);
    if (err != ESP_OK) return err;
    if ((*band != WIFI_BAND_2G && *band != WIFI_BAND_5G) ||
        (*mode == WIFI_BAND_MODE_2G_ONLY && *band != WIFI_BAND_2G) ||
        (*mode == WIFI_BAND_MODE_5G_ONLY && *band != WIFI_BAND_5G)) return ESP_ERR_INVALID_RESPONSE;
#if !CONFIG_SOC_WIFI_SUPPORT_5G
    if (*mode != WIFI_BAND_MODE_2G_ONLY || *band != WIFI_BAND_2G) return ESP_ERR_INVALID_RESPONSE;
#endif
    return ESP_OK;
}

esp_err_t esp32_mquickjs_wifi_radio_change_band(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    bool band_mode, int32_t requested, int32_t *actual,
    esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (actual != NULL) *actual = 0;
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "band-admission", .error = ESP_ERR_INVALID_ARG};
    if (actual == NULL || (band_mode ? (requested != WIFI_BAND_MODE_2G_ONLY && requested != WIFI_BAND_MODE_5G_ONLY && requested != WIFI_BAND_MODE_AUTO)
        : (requested != WIFI_BAND_2G && requested != WIFI_BAND_5G))) return ESP_ERR_INVALID_ARG;
#if !CONFIG_SOC_WIFI_SUPPORT_5G
    if (band_mode ? requested != WIFI_BAND_MODE_2G_ONLY : requested != WIFI_BAND_2G) {
        result->error = ESP_ERR_NOT_SUPPORTED;
        return result->error;
    }
#endif
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_connection_owner_locked(application, station, access_point, WIFI_IF_STA, false);
    if (err != ESP_OK) goto done;
    /* Checking an AP client list cannot prevent a new association between the
     * check and the SDK mutation. Caller must explicitly close AP first. */
    if (s_radio.effective_mode != WIFI_MODE_STA) { err = ESP_ERR_INVALID_STATE; goto done; }
    bool pinned = false;
    taskENTER_CRITICAL(&s_radio.lock);
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        const wifi_radio_live_lease_t *owner = &s_radio.leases[i];
        if (owner->identity != 0U && (owner->fixed_channel || owner->channel_conflict || owner->raw_tx_identity != 0U))
            pinned = true;
    }
    taskEXIT_CRITICAL(&s_radio.lock);
    if (pinned) { err = ESP_ERR_INVALID_STATE; goto done; }
    wifi_band_mode_t before_mode;
    wifi_band_t before_band;
    result->stage = "band-snapshot";
    err = wifi_radio_band_snapshot(&before_mode, &before_band);
    if (err != ESP_OK) goto done;
    if (!band_mode && before_mode != WIFI_BAND_MODE_AUTO) { err = ESP_ERR_NOT_SUPPORTED; goto done; }
    /* No mutation is needed, even on an associated Station. */
    if ((band_mode ? (int32_t)before_mode : (int32_t)before_band) == requested) {
        *actual = requested;
        result->stage = "complete";
        goto done;
    }
    result->stage = "band-station-link";
    wifi_ap_record_t ap;
    err = esp_wifi_sta_get_ap_info(&ap);
    if (err == ESP_OK) { err = ESP_ERR_INVALID_STATE; goto done; }
    if (err != ESP_ERR_WIFI_NOT_CONNECT) goto done;
    result->stage = band_mode ? "band-mode-write" : "band-write";
    result->mutation_attempted = true;
    result->persistent_mutation_possible = s_radio.storage == WIFI_STORAGE_FLASH;
    err = band_mode ? esp_wifi_set_band_mode((wifi_band_mode_t)requested) : esp_wifi_set_band((wifi_band_t)requested);
    if (err != ESP_OK) goto uncertain;
    result->stage = "band-readback";
    wifi_band_mode_t mode;
    wifi_band_t band;
    err = wifi_radio_band_snapshot(&mode, &band);
    if (err == ESP_OK && (band_mode ? (int32_t)mode != requested : ((int32_t)band != requested || mode != before_mode)))
        err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) goto uncertain;
    result->stage = "band-channel-readback";
    uint8_t primary;
    wifi_second_chan_t secondary;
    uint32_t generation;
    err = wifi_radio_get_channel_locked(&primary, &secondary, &generation);
    if (err != ESP_OK) goto uncertain;
    if ((secondary != WIFI_SECOND_CHAN_NONE && secondary != WIFI_SECOND_CHAN_ABOVE && secondary != WIFI_SECOND_CHAN_BELOW) ||
        (band == WIFI_BAND_2G ? primary < 1 || primary > 14 : esp32_mquickjs_wifi_radio_5ghz_channel_bit(primary) == 0U)) {
        err = ESP_ERR_INVALID_RESPONSE;
        goto uncertain;
    }
    result->stage = "band-channel-regulatory";
    err = wifi_radio_validate_regulatory_channel(primary);
    if (err != ESP_OK) goto uncertain;
    *actual = band_mode ? (int32_t)mode : (int32_t)band;
    result->stage = "complete";
    goto done;
uncertain:
    /* Public getters cannot snapshot all hidden inactive-band state. A failed
     * call may have changed RF/home channel already; do not replay or invent a
     * rollback. Retain the original error and explicit physical-recovery need. */
    (void)wifi_radio_record_fault(result->stage, err);
done:
    result->error = err;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.configuration = *result;
    taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return err;
}

bool esp32_mquickjs_wifi_radio_rssi_request_status(esp32_mquickjs_wifi_rssi_request_t *status)
{
    if (status == NULL) return false;
    wifi_radio_operation_lock();
    *status = s_rssi_request;
    bool active = status->revision != 0U && s_radio.driver_owned && status->generation == s_radio.generation;
    wifi_radio_operation_unlock();
    return active;
}

#if ESP32_MQUICKJS_WIFI_HE_STATISTICS_AVAILABLE
static esp_err_t wifi_radio_he_statistics_admission_locked(void)
{
    if (!s_radio.driver_owned) return ESP_ERR_WIFI_NOT_INIT;
    if (!s_radio.started) return ESP_ERR_WIFI_NOT_STARTED;
    if (!s_radio.storage_configured || s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED ||
        s_radio.lifecycle.identity || s_radio.operation.identity || s_radio.fault_stage || s_radio.cleanup_stage ||
        s_radio.restart_required || s_he_statistics.pending ||
        (s_radio.effective_mode != WIFI_MODE_STA && s_radio.effective_mode != WIFI_MODE_AP &&
         s_radio.effective_mode != WIFI_MODE_APSTA)) return ESP_ERR_INVALID_STATE;
    return ESP_OK;
}
#endif

esp_err_t esp32_mquickjs_wifi_radio_read_he_statistics(esp32_mquickjs_wifi_he_statistics_t *actual,
    const char **stage)
{
    if (!actual || !stage) return ESP_ERR_INVALID_ARG;
    *actual = (esp32_mquickjs_wifi_he_statistics_t){0};
    *stage = "he-statistics-admission";
#if ESP32_MQUICKJS_WIFI_HE_STATISTICS_AVAILABLE
    wifi_radio_operation_lock();
    esp_err_t error = wifi_radio_he_statistics_admission_locked();
    if (error == ESP_OK) {
        *stage = "he-statistics-read";
        error = esp32_mquickjs_wifi_he_statistics_snapshot(actual, false);
        if (error == ESP_OK) { s_he_statistics.managed = true; *stage = NULL; }
    }
    wifi_radio_operation_unlock();
    return error;
#else
    return ESP_ERR_NOT_SUPPORTED;
#endif
}

esp_err_t esp32_mquickjs_wifi_radio_write_he_statistics(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    bool rx, uint8_t selection, bool enabled, esp32_mquickjs_wifi_he_statistics_t *actual,
    esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (!result) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "he-statistics-admission", .error = ESP_ERR_INVALID_ARG};
    if (!actual || selection > 3 || (rx && enabled)) return ESP_ERR_INVALID_ARG;
    *actual = (esp32_mquickjs_wifi_he_statistics_t){0};
#if ESP32_MQUICKJS_WIFI_HE_STATISTICS_AVAILABLE
    wifi_radio_operation_lock();
    esp_err_t error = wifi_radio_he_statistics_admission_locked();
    if (error != ESP_OK) goto done;
    wifi_interface_t interface = (s_radio.effective_mode & WIFI_MODE_STA) ? WIFI_IF_STA : WIFI_IF_AP;
    error = wifi_radio_connection_owner_locked(application, station, access_point, interface, false);
    if (error != ESP_OK) goto done;
    result->stage = "he-statistics-snapshot";
    esp32_mquickjs_wifi_he_statistics_t wanted;
    error = esp32_mquickjs_wifi_he_statistics_snapshot(&wanted, false);
    if (error != ESP_OK) goto done;
    if (rx) { wanted.ordinary = (selection & 1U) != 0; wanted.multi_user = (selection & 2U) != 0; }
    else if (enabled) wanted.tx_mask |= 1U << selection;
    else wanted.tx_mask &= ~(1U << selection);
    result->stage = rx ? "rx-statistics-write" : "tx-statistics-write";
    result->mutation_attempted = true;
    s_he_statistics.managed = true;
    error = rx ? esp_wifi_enable_rx_statistics(wanted.ordinary, wanted.multi_user) :
        esp_wifi_enable_tx_statistics((esp_wifi_aci_t)selection, enabled);
    esp_err_t observed = esp32_mquickjs_wifi_he_statistics_snapshot(actual, false);
    if (error == ESP_OK && observed == ESP_OK && !wifi_he_statistics_equal(actual, &wanted))
        observed = ESP_ERR_INVALID_RESPONSE;
    if (observed != ESP_OK) {
        /* Preserve a native submission error even if observation also fails.
         * A valid failed-write observation needs no speculative counter rollback. */
        if (error == ESP_OK) error = observed;
        result->stage = "he-statistics-readback";
        (void)wifi_radio_record_fault(result->stage, error);
    } else if (error == ESP_OK) result->stage = "complete";
done:
    result->error = error;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.configuration = *result;
    taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return error;
#else
    (void)application; (void)station; (void)access_point;
    result->error = ESP_ERR_NOT_SUPPORTED;
    return result->error;
#endif
}

esp_err_t esp32_mquickjs_wifi_radio_read_scan_parameters(wifi_scan_default_params_t *actual,
    const char **stage)
{
    if (actual == NULL || stage == NULL) return ESP_ERR_INVALID_ARG;
    memset(actual, 0, sizeof(*actual));
    *stage = "scan-parameters-admission";
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned || !s_radio.storage_configured || !s_radio.started ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED ||
        !(s_radio.effective_mode & WIFI_MODE_STA) || s_radio.lifecycle.identity || s_radio.operation.identity ||
        s_radio.fault_stage || s_radio.cleanup_stage || s_radio.restart_required) goto done;
    *stage = "scan-parameters-read";
    error = wifi_radio_scan_parameters_observe_locked(actual);
    if (error == ESP_OK) *stage = NULL;
done:
    wifi_radio_operation_unlock();
    return error;
}

esp_err_t esp32_mquickjs_wifi_radio_write_scan_parameters(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    const wifi_scan_default_params_t *requested, wifi_scan_default_params_t *actual,
    esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (actual != NULL) memset(actual, 0, sizeof(*actual));
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "scan-parameters-admission", .error = ESP_ERR_INVALID_ARG};
    if (actual == NULL || !wifi_scan_parameters_valid(requested)) return ESP_ERR_INVALID_ARG;
    wifi_scan_default_params_t wanted = wifi_scan_parameters_effective(requested), previous, observed;
    wifi_radio_operation_lock();
    esp_err_t error = wifi_radio_connection_owner_locked(application, station, access_point, WIFI_IF_STA, false);
    if (error != ESP_OK) goto done;
    result->stage = "scan-parameters-snapshot";
    error = wifi_radio_scan_parameters_observe_locked(&previous);
    if (error != ESP_OK) goto done;
    result->stage = "scan-parameters-write";
    result->mutation_attempted = true;
    wifi_radio_invalidate_stop_snapshot_locked();
    error = wifi_scan_parameters_set_native(requested);
    if (error == ESP_OK) {
        result->stage = "scan-parameters-readback";
        error = wifi_radio_scan_parameters_observe_locked(&observed);
        if (error == ESP_OK && !wifi_scan_parameters_equal(&observed, &wanted)) error = ESP_ERR_INVALID_RESPONSE;
    }
    if (error == ESP_OK) {
        s_scan_parameters.attempted = false;
        *actual = observed;
        result->stage = "complete";
        goto done;
    }
    /* OOM/busy/precondition rejection may leave the original value intact.
     * Read it first, so a second rejected setter cannot manufacture a fault.
     * Preserve the first operation's error even if cleanup succeeds. */
    result->rollback_stage = "scan-parameters-rollback-observation";
    result->rollback_error = wifi_radio_scan_parameters_observe_locked(&observed);
    if (result->rollback_error != ESP_OK || !wifi_scan_parameters_equal(&observed, &previous)) {
        result->rollback_attempted = true;
        result->rollback_stage = "scan-parameters-rollback-write";
        result->rollback_error = wifi_scan_parameters_set_native(&previous);
        if (result->rollback_error == ESP_OK) {
            result->rollback_stage = "scan-parameters-rollback-readback";
            result->rollback_error = wifi_radio_scan_parameters_observe_locked(&observed);
            if (result->rollback_error == ESP_OK && !wifi_scan_parameters_equal(&observed, &previous))
                result->rollback_error = ESP_ERR_INVALID_RESPONSE;
        }
    }
    result->rollback_complete = result->rollback_error == ESP_OK;
    if (result->rollback_complete) {
        s_scan_parameters.attempted = false;
        result->rollback_stage = NULL;
    } else {
        (void)wifi_radio_record_fault(result->stage, error);
        (void)wifi_radio_cleanup_fault("scan-parameters-rollback", result->rollback_error);
    }
done:
    result->error = error;
    taskENTER_CRITICAL(&s_radio.lock); s_radio.configuration = *result; taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return error;
}

