99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_connection_control(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    esp32_mquickjs_wifi_connection_control_t control, wifi_interface_t interface,
    int32_t requested, int32_t *actual, esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (actual != NULL) *actual = 0;
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "control-admission", .error = ESP_ERR_INVALID_ARG};
    bool observer = control == ESP32_MQUICKJS_WIFI_CONNECTION_RSSI_THRESHOLD;
    if (actual == NULL || (control != ESP32_MQUICKJS_WIFI_CONNECTION_INACTIVE_TIME && !observer) ||
        (interface != WIFI_IF_STA && interface != WIFI_IF_AP) ||
        (observer && (interface != WIFI_IF_STA || requested < -100 || requested > 10)) ||
        (!observer && (requested < (interface == WIFI_IF_STA ? 3 : 10) || requested > UINT16_MAX)))
        return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (interface == WIFI_IF_AP) { result->error = ESP_ERR_NOT_SUPPORTED; return result->error; }
#endif
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_connection_owner_locked(application, station, access_point, interface, observer);
    if (err != ESP_OK) goto done;
    if (observer) {
        if (s_rssi_request.revision == UINT32_MAX) {
            result->stage = "rssi-threshold-identity";
            err = ESP_ERR_NO_MEM;
            goto done;
        }
        result->stage = "rssi-threshold-write";
        result->mutation_attempted = true;
        s_rssi_request.generation = s_radio.generation;
        ++s_rssi_request.revision;
        s_rssi_request.requested_dbm = requested;
        err = esp_wifi_set_rssi_threshold(requested);
        s_rssi_request.error = err;
        /* No public getter or callback cookie. Do not replay, invent a rollback,
         * or equate write acceptance with a currently armed event subscription.
         * Keep this historical attempt across deinit; restart never replays it.
         * Only a new explicit setter requests another notification. */
        if (err == ESP_OK) { *actual = requested; result->stage = "complete"; }
        goto done;
    }
    uint16_t previous, observed;
    result->stage = "inactive-time-snapshot";
    err = esp_wifi_get_inactive_time(interface, &previous);
    if (err == ESP_OK && previous < (interface == WIFI_IF_STA ? 3 : 10)) err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) { wifi_radio_inactive_history_record(interface == WIFI_IF_STA ? 0 : 1, 0, err); goto done; }
    result->mutation_attempted = true;
    result->stage = "inactive-time-write";
    /* The pinned SDK routes this write through wifi_nvs_set when storage is
     * FLASH, despite esp_wifi.h describing the setting as non-persistent. */
    result->persistent_mutation_possible = s_radio.storage == WIFI_STORAGE_FLASH;
    err = esp_wifi_set_inactive_time(interface, (uint16_t)requested);
    if (err == ESP_OK) {
        result->stage = "inactive-time-readback";
        err = esp_wifi_get_inactive_time(interface, &observed);
        if (err == ESP_OK && observed != requested) err = ESP_ERR_INVALID_RESPONSE;
    }
    if (err == ESP_OK) {
        wifi_radio_inactive_history_record(interface == WIFI_IF_STA ? 0 : 1, observed, ESP_OK);
        uint8_t bit = interface == WIFI_IF_STA ? WIFI_MODE_STA : WIFI_MODE_AP;
        s_inactive_history.pending &= (uint8_t)~bit;
        s_inactive_history.attempted &= (uint8_t)~bit;
        s_inactive_history.persistent &= (uint8_t)~bit;
        s_inactive_history.pending_values[interface == WIFI_IF_STA ? 0 : 1] = 0;
        *actual = observed; result->stage = "complete"; goto done;
    }
    result->rollback_attempted = true;
    result->rollback_stage = "rollback-inactive-time";
    result->rollback_error = esp_wifi_set_inactive_time(interface, previous);
    if (result->rollback_error == ESP_OK) {
        result->rollback_stage = "rollback-inactive-time-readback";
        result->rollback_error = esp_wifi_get_inactive_time(interface, &observed);
        if (result->rollback_error == ESP_OK && observed != previous) result->rollback_error = ESP_ERR_INVALID_RESPONSE;
    }
    result->rollback_complete = result->rollback_error == ESP_OK;
    wifi_radio_inactive_history_record(interface == WIFI_IF_STA ? 0 : 1, previous, result->rollback_error);
    if (result->rollback_complete) result->rollback_stage = NULL;
    else {
        (void)wifi_radio_record_fault(result->stage, err);
        (void)wifi_radio_cleanup_fault("inactive-time-rollback", result->rollback_error);
    }
    /* Readback proves the running threshold only, not NVS restoration or the
     * reversal of a disconnect/deauth while a shorter threshold was active. */
done:
    result->error = err;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.configuration = *result;
    taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_write_antenna(bool gpio,
    const esp32_mquickjs_wifi_antenna_snapshot_t *requested,
    esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "antenna-admission", .error = ESP_ERR_INVALID_ARG};
    if (requested == NULL) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (!s_radio.storage_configured || s_radio.started || s_radio.stop_required || s_radio.restart_required ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED || s_radio.fault_stage != NULL ||
        s_radio.cleanup_stage != NULL || s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U ||
        s_radio.wake_locks != 0U || s_radio.promiscuous_claimed ||
        s_tx_rate_lease.identity != 0U || s_tx_rate_lease.restore_pending) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
    err = esp32_mquickjs_wifi_antenna_write(gpio, requested, result);
    if (esp32_mquickjs_wifi_antenna_fault() != ESP_OK) {
        (void)wifi_radio_record_fault("antenna-device-restart-required", err);
        taskENTER_CRITICAL(&s_radio.lock);
        s_radio.restart_required = true;
        taskEXIT_CRITICAL(&s_radio.lock);
    }
done:
    result->error = err;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.configuration = *result;
    taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_read_antenna(bool gpio,
    esp32_mquickjs_wifi_antenna_snapshot_t *output, const char **stage)
{
    if (output != NULL) memset(output, 0, sizeof(*output));
    if (stage != NULL) *stage = "admission";
    if (output == NULL || stage == NULL) return ESP_ERR_INVALID_ARG;
    esp32_mquickjs_wifi_antenna_snapshot_t snapshot = {0};
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (!s_radio.storage_configured || s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED)) goto done;
    *stage = gpio ? "antenna-gpio" : "antenna";
    err = gpio ? esp_phy_get_ant_gpio(&snapshot.gpio) : esp_phy_get_ant(&snapshot.config);
    if (err != ESP_OK) goto done;
    if (!gpio) {
        const esp_phy_ant_config_t *config = &snapshot.config;
        if ((config->rx_ant_mode != ESP_PHY_ANT_MODE_ANT0 && config->rx_ant_mode != ESP_PHY_ANT_MODE_ANT1 &&
             config->rx_ant_mode != ESP_PHY_ANT_MODE_AUTO) ||
            (config->tx_ant_mode != ESP_PHY_ANT_MODE_ANT0 && config->tx_ant_mode != ESP_PHY_ANT_MODE_ANT1 &&
             config->tx_ant_mode != ESP_PHY_ANT_MODE_AUTO) ||
            (config->rx_ant_default != ESP_PHY_ANT_ANT0 && config->rx_ant_default != ESP_PHY_ANT_ANT1) ||
            (config->tx_ant_mode == ESP_PHY_ANT_MODE_AUTO && config->rx_ant_mode != ESP_PHY_ANT_MODE_AUTO)) {
            *stage = "decode";
            err = ESP_ERR_INVALID_RESPONSE;
            goto done;
        }
    }
    /* GPIO fields and enabled_ant selectors retain their full SDK bit widths.
     * Stored GPIO numbers are not proof of available pins or physical wiring. */
    *output = snapshot;
done:
    wifi_radio_operation_unlock();
    return err;
}

