99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
typedef enum {
    WIFI_RADIO_RESTORE_DEFAULTS,
    WIFI_RADIO_RESTORE_MODE,
    WIFI_RADIO_RESTORE_STORAGE,
} wifi_radio_restore_phase_t;

static bool wifi_radio_restore_phase_locked(wifi_radio_restore_phase_t *phase)
{
    *phase = WIFI_RADIO_RESTORE_DEFAULTS;
    const char *fault = s_radio.fault_stage;
    const char *cleanup = s_radio.cleanup_stage;
    if (fault == NULL && cleanup == NULL)
        return s_radio.driver_state == ESP32_MQUICKJS_WIFI_RADIO_STOPPED;
    if (fault == NULL || (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_FAULTED &&
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_CLEANUP_PENDING)) return false;
    /* The SDK defaults contract covers mode/protocol/bandwidth. It does not
     * establish retirement of unrelated native owners or reset every policy.
     * Composite transactions retain their lifecycle/cleanup reservation. */
    bool mode = strcmp(fault, "mode-snapshot") == 0 || strcmp(fault, "mode-write") == 0 ||
        strcmp(fault, "mode-readback") == 0;
    bool phy = strcmp(fault, "station-phy-config") == 0 || strcmp(fault, "ap-phy-config") == 0 ||
        strcmp(fault, "station-phy-readback") == 0 || strcmp(fault, "ap-phy-readback") == 0;
    bool restore = strcmp(fault, "restore-defaults") == 0 || strcmp(fault, "restore-mode-readback") == 0 ||
        strcmp(fault, "restore-storage") == 0;
    if (!mode && !phy && !restore) return false;
    if (cleanup == NULL) return !restore;
    if (strcmp(cleanup, "restore-defaults") == 0) return true;
    if (strcmp(cleanup, "restore-mode-readback") == 0) {
        *phase = WIFI_RADIO_RESTORE_MODE;
        return true;
    }
    if (strcmp(cleanup, "restore-storage") == 0) {
        *phase = WIFI_RADIO_RESTORE_STORAGE;
        return true;
    }
    return (mode && strcmp(cleanup, "mode-rollback") == 0) ||
        (phy && strcmp(cleanup, "phy-rollback") == 0);
}

esp_err_t esp32_mquickjs_wifi_radio_restore(esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "restore-admission", .error = ESP_ERR_INVALID_STATE};
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    wifi_radio_restore_phase_t phase;
    wifi_mode_t observed = WIFI_MODE_NULL;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    /* esp_wifi_restore contains an implicit STOP. Require completed STOP and
     * event retirement before calling it, including owners that live outside
     * the lease registry. No child Session is closed on the caller's behalf. */
    if (!wifi_radio_restore_phase_locked(&phase) ||
        (!s_radio.storage_configured && phase != WIFI_RADIO_RESTORE_STORAGE) ||
        (s_radio.storage != WIFI_STORAGE_RAM && s_radio.storage != WIFI_STORAGE_FLASH) ||
        s_radio.started || s_radio.stop_required || s_radio.stop_submitted ||
        s_radio.restart_required || s_radio.lifecycle.identity != 0U ||
        s_radio.operation.identity != 0U || s_radio.event_phase != RADIO_EVENTS_IDLE || s_radio.event_live != 0U ||
        s_radio.wake_locks != 0U || s_radio.promiscuous_claimed ||
        s_tx_rate_lease.identity != 0U || s_tx_rate_lease.restore_pending ||
        s_interval.owner.identity != 0U || s_interval.restore_pending ||
        s_vendor_ie.start_owner.identity != 0U || s_config_restart.snapshot != NULL || s_policy_restart.owner.identity != 0U ||
        WIFI_RADIO_SMARTCONFIG_PENDING || WIFI_RADIO_WPS_PENDING || WIFI_RADIO_DPP_PENDING ||
        WIFI_RADIO_EAP_PENDING || WIFI_RADIO_NAN_PENDING || WIFI_RADIO_MESH_PENDING) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
    /* Only a failed suffix is retried. cleanup_stage is native progress, unlike
     * the per-call configuration result which rejected calls may overwrite. */
    if (phase == WIFI_RADIO_RESTORE_STORAGE) goto restore_storage;
    if (phase == WIFI_RADIO_RESTORE_MODE) goto restore_mode;
    result->stage = "restore-defaults";
    result->mutation_attempted = true;
    /* Restore writes defaults through the SDK NVS loader independently of the
     * selected future-write storage. It cannot restore the prior NVS contents. */
    result->persistent_mutation_possible = true;
    err = esp_wifi_restore();
    /* Even a failed default load may have changed part of the configuration.
     * Forget observations, keep identity/revision space and outstanding owners.
     * Never manufacture new policy/interval/rate defaults from SDK success. */
    (void)esp32_mquickjs_wifi_interval_invalidate(&s_interval, s_radio.generation);
    esp32_mquickjs_wifi_policy_invalidate(&s_policies);
    esp32_mquickjs_wifi_tx_rate_invalidate(&s_tx_rates);
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_RESPONDER_SUPPORT && CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    esp32_mquickjs_wifi_ftm_offset_invalidate(&s_ftm_offset);
#endif
    memset(&s_inactive_history, 0, sizeof(s_inactive_history));
    memset(&s_scan_parameters, 0, sizeof(s_scan_parameters));
#if ESP32_MQUICKJS_WIFI_HE_STATISTICS_AVAILABLE
    memset(&s_he_statistics, 0, sizeof(s_he_statistics));
#endif
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    memset(&s_twt_policy, 0, sizeof(s_twt_policy));
#endif
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.primary_channel = 0;
    s_radio.secondary_channel = WIFI_SECOND_CHAN_NONE;
    s_radio.channel_observation_error = ESP_ERR_INVALID_STATE;
    if (++s_radio.channel_generation == 0U) s_radio.channel_generation = 1U;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (err != ESP_OK) goto fault;
restore_mode:
    result->stage = "restore-mode-readback";
    err = esp_wifi_get_mode(&observed);
    if (err == ESP_OK && observed != WIFI_MODE_NULL && observed != WIFI_MODE_STA &&
        observed != WIFI_MODE_AP && observed != WIFI_MODE_APSTA) err = ESP_ERR_INVALID_RESPONSE;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (err == ESP_OK && (observed == WIFI_MODE_AP || observed == WIFI_MODE_APSTA)) err = ESP_ERR_NOT_SUPPORTED;
#endif
    if (err != ESP_OK) goto fault;
    taskENTER_CRITICAL(&s_radio.lock); s_radio.effective_mode = observed; taskEXIT_CRITICAL(&s_radio.lock);
    /* The SDK has no storage getter. Re-establish the caller's selected future
     * write policy explicitly, without rewriting credentials or starting RF. */
restore_storage:
    result->stage = "restore-storage";
    result->mutation_attempted = true;
    err = esp_wifi_set_storage(s_radio.storage);
    if (err != ESP_OK) {
        taskENTER_CRITICAL(&s_radio.lock); s_radio.storage_configured = false; taskEXIT_CRITICAL(&s_radio.lock);
        goto fault;
    }
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.storage_configured = true;
    s_radio.fault_stage = NULL;
    s_radio.fault_error = ESP_OK;
    s_radio.cleanup_stage = NULL;
    s_radio.cleanup_error = ESP_OK;
    s_radio.driver_state = ESP32_MQUICKJS_WIFI_RADIO_STOPPED;
    taskEXIT_CRITICAL(&s_radio.lock);
    result->stage = "restore-sdk-accepted";
    goto done;
fault:
    (void)wifi_radio_cleanup_fault(result->stage, err);
done:
    result->error = err;
    taskENTER_CRITICAL(&s_radio.lock); s_radio.configuration = *result; taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return err;
}

