99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_set_mode(wifi_mode_t mode,
    esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "mode-admission", .error = ESP_ERR_INVALID_ARG};
    if (mode != WIFI_MODE_NULL && mode != WIFI_MODE_STA && mode != WIFI_MODE_AP && mode != WIFI_MODE_APSTA)
        return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (mode == WIFI_MODE_AP || mode == WIFI_MODE_APSTA) {
        result->error = ESP_ERR_NOT_SUPPORTED;
        return result->error;
    }
#endif
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (!s_radio.storage_configured || (s_radio.storage != WIFI_STORAGE_RAM && s_radio.storage != WIFI_STORAGE_FLASH) ||
        s_radio.started || s_radio.stop_required || s_radio.restart_required ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED || s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL ||
        s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U || s_radio.wake_locks != 0U ||
        s_radio.promiscuous_claimed || s_tx_rate_lease.identity != 0U || s_tx_rate_lease.restore_pending) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
    wifi_mode_t previous, observed;
    result->stage = "mode-snapshot";
    err = esp_wifi_get_mode(&previous);
    if (err != ESP_OK) goto done;
    if ((previous != WIFI_MODE_NULL && previous != WIFI_MODE_STA && previous != WIFI_MODE_AP && previous != WIFI_MODE_APSTA) ||
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
        previous == WIFI_MODE_AP || previous == WIFI_MODE_APSTA ||
#endif
        previous != s_radio.effective_mode) {
        err = wifi_radio_record_fault(result->stage, ESP_ERR_INVALID_RESPONSE);
        goto done;
    }
    if (previous == mode) { result->stage = "complete"; goto done; }
    result->stage = "mode-write";
    result->mutation_attempted = true;
    result->persistent_mutation_possible = s_radio.storage == WIFI_STORAGE_FLASH;
    err = esp_wifi_set_mode(mode);
    if (err == ESP_OK) {
        result->stage = "mode-readback";
        err = esp_wifi_get_mode(&observed);
        if (err == ESP_OK && observed != mode) err = ESP_ERR_INVALID_RESPONSE;
    }
    if (err == ESP_OK) {
        taskENTER_CRITICAL(&s_radio.lock); s_radio.effective_mode = mode; taskEXIT_CRITICAL(&s_radio.lock);
        result->stage = "complete";
        goto done;
    }
    /* A failed write can already have changed mode. Restore only the verified
     * predecessor; even successful runtime rollback cannot prove NVS rollback. */
    result->rollback_attempted = true;
    result->rollback_stage = "rollback-mode";
    result->rollback_error = esp_wifi_set_mode(previous);
    if (result->rollback_error == ESP_OK) {
        result->rollback_stage = "rollback-mode-readback";
        result->rollback_error = esp_wifi_get_mode(&observed);
        if (result->rollback_error == ESP_OK && observed != previous)
            result->rollback_error = ESP_ERR_INVALID_RESPONSE;
    }
    result->rollback_complete = result->rollback_error == ESP_OK;
    if (result->rollback_complete) result->rollback_stage = NULL;
    if (!result->rollback_complete || result->persistent_mutation_possible)
        (void)wifi_radio_record_fault(result->stage, err);
    if (!result->rollback_complete) (void)wifi_radio_cleanup_fault("mode-rollback", result->rollback_error);
done:
    result->error = err;
    taskENTER_CRITICAL(&s_radio.lock); s_radio.configuration = *result; taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_set_storage(wifi_storage_t storage,
    esp32_mquickjs_wifi_radio_config_result_t *result)
{
    static const char storage_fault[] = "storage-write";
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "storage-admission", .error = ESP_ERR_INVALID_ARG};
    if (storage != WIFI_STORAGE_RAM && storage != WIFI_STORAGE_FLASH) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    bool repairing = s_radio.fault_stage == storage_fault && s_radio.cleanup_stage == NULL &&
        s_radio.driver_state == ESP32_MQUICKJS_WIFI_RADIO_FAULTED;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (s_radio.started || s_radio.stop_required || s_radio.restart_required ||
        s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U || s_radio.wake_locks != 0U ||
        s_radio.promiscuous_claimed || s_tx_rate_lease.identity != 0U || s_tx_rate_lease.restore_pending ||
        (!repairing && (!s_radio.storage_configured || s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED ||
            s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL))) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
    result->stage = storage_fault;
    result->mutation_attempted = true;
    err = esp_wifi_set_storage(storage);
    taskENTER_CRITICAL(&s_radio.lock);
    if (err == ESP_OK) {
        s_radio.storage = storage;
        s_radio.storage_configured = true;
        if (repairing) {
            s_radio.fault_stage = NULL;
            s_radio.fault_error = ESP_OK;
            s_radio.driver_state = ESP32_MQUICKJS_WIFI_RADIO_STOPPED;
        }
    } else {
        /* No getter exists. The previous enum is no longer known to describe
         * the SDK; block other mutations until explicit replacement/cleanup. */
        s_radio.storage_configured = false;
    }
    taskEXIT_CRITICAL(&s_radio.lock);
    if (err != ESP_OK) (void)wifi_radio_record_fault(storage_fault, err);
    else result->stage = "complete";
done:
    result->error = err;
    taskENTER_CRITICAL(&s_radio.lock); s_radio.configuration = *result; taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_disable_pmf(wifi_interface_t interface,
    esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "pmf-admission", .error = ESP_ERR_INVALID_ARG};
    if (interface != WIFI_IF_STA && interface != WIFI_IF_AP) return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (interface == WIFI_IF_AP) { result->error = ESP_ERR_NOT_SUPPORTED; return result->error; }
#endif
    wifi_config_t expected = {0}, actual = {0};
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (!s_radio.storage_configured || (s_radio.storage != WIFI_STORAGE_RAM && s_radio.storage != WIFI_STORAGE_FLASH) ||
        s_radio.started || s_radio.stop_required || s_radio.restart_required ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED || s_radio.fault_stage != NULL ||
        s_radio.cleanup_stage != NULL || s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U ||
        s_radio.wake_locks != 0U || s_radio.promiscuous_claimed ||
        s_tx_rate_lease.identity != 0U || s_tx_rate_lease.restore_pending) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
    result->stage = "pmf-snapshot";
    err = esp_wifi_get_config(interface, &expected);
    if (err != ESP_OK) goto done;
    result->stage = "pmf-security";
    if (!esp32_mquickjs_wifi_radio_pmf_disable_allowed(interface, &expected)) { err = ESP_ERR_NOT_SUPPORTED; goto done; }
    wifi_pmf_config_t *pmf = interface == WIFI_IF_STA ? &expected.sta.pmf_cfg : &expected.ap.pmf_cfg;
    if (!pmf->capable && !pmf->required) { result->stage = "complete"; goto done; }
    pmf->capable = false;
    pmf->required = false;
    result->stage = "pmf-write";
    result->mutation_attempted = true;
    result->persistent_mutation_possible = s_radio.storage == WIFI_STORAGE_FLASH;
    err = esp_wifi_disable_pmf_config(interface);
    if (err == ESP_OK) {
        result->stage = "pmf-readback";
        err = esp_wifi_get_config(interface, &actual);
        if (err == ESP_OK && !wifi_radio_config_equal(interface, &expected, &actual)) err = ESP_ERR_INVALID_RESPONSE;
    }
    /* SDK may have cleared one flag or persisted a prefix even on error. Do
     * not guess a rollback or automatically repeat a security mutation. */
    if (err != ESP_OK) (void)wifi_radio_record_fault(result->stage, err);
    else result->stage = "complete";
done:
    esp32_mquickjs_wireless_secure_zero(&actual, sizeof(actual));
    esp32_mquickjs_wireless_secure_zero(&expected, sizeof(expected));
    result->error = err;
    taskENTER_CRITICAL(&s_radio.lock); s_radio.configuration = *result; taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_operation_unlock();
    return err;
}

/* Radio mutex owns both slot history and exact persistent interface leases.
 * Driver copies the IE synchronously; no JS/storage pointer survives set(). */


static wifi_interface_t wifi_radio_vendor_ie_interface(wifi_vendor_ie_type_t frame)
{
    return frame == WIFI_VND_IE_TYPE_PROBE_REQ || frame == WIFI_VND_IE_TYPE_ASSOC_REQ ? WIFI_IF_STA : WIFI_IF_AP;
}

static void wifi_radio_vendor_ie_release_empty(wifi_interface_t interface)
{
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_VENDOR_IE_SLOTS; ++i) {
        if (wifi_radio_vendor_ie_interface((wifi_vendor_ie_type_t)(i / 2U)) == interface &&
            (s_vendor_ie.slots[i].length != 0U || s_vendor_ie.slots[i].pending)) return;
    }
    wifi_radio_release_locked(&s_vendor_ie.leases[interface]);
}

static esp_err_t wifi_radio_vendor_ie_remove(unsigned index, const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    esp32_mquickjs_wifi_vendor_ie_slot_t *slot = &s_vendor_ie.slots[index];
    if (slot->length == 0U && !slot->pending) return ESP_OK;
    wifi_vendor_ie_type_t frame = (wifi_vendor_ie_type_t)(index / 2U);
    if (!wifi_radio_lease_valid(&s_vendor_ie.leases[wifi_radio_vendor_ie_interface(frame)]) &&
        !wifi_radio_vendor_ie_start_matches(token))
        return ESP_ERR_INVALID_STATE;
    esp_err_t err = esp_wifi_set_vendor_ie(false, frame, (wifi_vendor_ie_id_t)(index % 2U), NULL);
    if (err == ESP_OK) memset(slot, 0, sizeof(*slot));
    else { slot->pending = true; slot->error = err; }
    return err;
}

/* The start token owns parked copies until resume restores exact registry
 * owners, or cleanup removes the copies. No identity is recycled. */
static bool wifi_radio_vendor_ie_start_matches(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    return token != NULL && token->identity != 0U &&
        token->identity == s_vendor_ie.start_owner.identity && token->generation == s_vendor_ie.start_owner.generation &&
        token->identity == s_radio.lifecycle.identity && token->generation == s_radio.lifecycle.generation &&
        token->generation == s_radio.generation;
}

static unsigned wifi_radio_vendor_ie_start_count(void)
{
    unsigned mask = 0;
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_VENDOR_IE_SLOTS; ++i)
        if (s_vendor_ie.slots[i].length != 0U || s_vendor_ie.slots[i].pending)
            mask |= 1U << wifi_radio_vendor_ie_interface((wifi_vendor_ie_type_t)(i / 2U));
    return (mask & 1U) + ((mask >> 1U) & 1U);
}

