99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
static void wifi_radio_vendor_ie_start_park(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (!wifi_radio_vendor_ie_start_matches(token)) return;
    for (unsigned i = 0; i < 2; ++i) wifi_radio_release_locked(&s_vendor_ie.leases[i]);
}

static esp_err_t wifi_radio_vendor_ie_begin_start_locked(
    const esp32_mquickjs_wifi_radio_lease_t *application, const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    const esp32_mquickjs_wifi_radio_configuration_selection_t *selection,
    esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (s_vendor_ie.start_owner.identity != 0U) return ESP_ERR_INVALID_STATE;
    if (wifi_radio_vendor_ie_start_count() == 0U)
        return wifi_radio_begin_lifecycle_locked(application, station, access_point, token);
    if (!s_radio.driver_owned || !s_radio.storage_configured || s_radio.started || s_radio.stop_required ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED ||
        selection->mode != s_radio.effective_mode || selection->storage != s_radio.storage ||
        s_interval.owner.identity != 0U || s_interval.uncertain || s_tx_rate_lease.identity != 0U)
        return ESP_ERR_INVALID_STATE;
    unsigned mask = 0;
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_VENDOR_IE_SLOTS; ++i) {
        if (s_vendor_ie.slots[i].pending) return ESP_ERR_INVALID_STATE;
        if (s_vendor_ie.slots[i].length != 0U)
            mask |= 1U << wifi_radio_vendor_ie_interface((wifi_vendor_ie_type_t)(i / 2U));
    }
    for (unsigned i = 0; i < 2; ++i) {
        const esp32_mquickjs_wifi_radio_lease_t *lease = &s_vendor_ie.leases[i];
        if (!!(mask & (1U << i)) != lease->acquired) return ESP_ERR_INVALID_STATE;
        if (!(mask & (1U << i))) continue;
        if (!wifi_radio_lease_valid(lease) || lease->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_VENDOR_IE)
            return ESP_ERR_INVALID_STATE;
        wifi_radio_live_lease_t *live = wifi_radio_promiscuous_owner(lease->identity);
        wifi_mode_t required = i == WIFI_IF_STA ? WIFI_MODE_STA : WIFI_MODE_AP;
        if (live == NULL || live->required_mode != required || (selection->mode & required) != required ||
            live->promiscuous_identity != 0U || live->raw_tx_identity != 0U || live->fixed_channel ||
            live->channel_conflict) return ESP_ERR_INVALID_STATE;
    }
    unsigned needed = wifi_radio_vendor_ie_start_count() + ((selection->mode & WIFI_MODE_STA) ? 2U : 0U) +
        ((selection->mode & WIFI_MODE_AP) ? 1U : 0U);
    if (needed > WIFI_RADIO_MAX_LEASES || s_radio.next_lease_identity == 0U ||
        needed - 1U > UINT32_MAX - s_radio.next_lease_identity) return ESP_ERR_NO_MEM;
    esp_err_t err = wifi_radio_begin_lifecycle_with_dependents_locked(application, station, access_point,
        &s_vendor_ie.leases[0], &s_vendor_ie.leases[1], token, 0);
    if (err != ESP_OK) return err;
    s_vendor_ie.start_owner = *token;
    s_vendor_ie.start_mode = selection->mode;
    s_vendor_ie.start_storage = selection->storage;
    wifi_radio_vendor_ie_start_park(token);
    return ESP_OK;
}

static esp_err_t wifi_radio_vendor_ie_start_attach(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (s_vendor_ie.start_owner.identity == 0U) return ESP_OK;
    if (!wifi_radio_vendor_ie_start_matches(token)) return ESP_ERR_INVALID_STATE;
    unsigned mask = 0;
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_VENDOR_IE_SLOTS; ++i) {
        if (s_vendor_ie.slots[i].pending) return ESP_ERR_INVALID_STATE;
        if (s_vendor_ie.slots[i].length != 0U)
            mask |= 1U << wifi_radio_vendor_ie_interface((wifi_vendor_ie_type_t)(i / 2U));
    }
    for (unsigned i = 0; i < 2; ++i) {
        if (!(mask & (1U << i))) continue;
        if (s_vendor_ie.leases[i].acquired) return ESP_ERR_INVALID_STATE;
        esp_err_t err = wifi_radio_acquire_locked(ESP32_MQUICKJS_WIFI_RADIO_CLIENT_VENDOR_IE,
            i == WIFI_IF_STA ? WIFI_MODE_STA : WIFI_MODE_AP, &s_vendor_ie.leases[i]);
        if (err != ESP_OK) return err;
    }
    return ESP_OK;
}

static void wifi_radio_vendor_ie_start_commit(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (!wifi_radio_vendor_ie_start_matches(token)) return;
    memset(&s_vendor_ie.start_owner, 0, sizeof(s_vendor_ie.start_owner));
    s_vendor_ie.start_mode = WIFI_MODE_NULL;
    s_vendor_ie.start_storage = WIFI_STORAGE_RAM;
}

esp_err_t esp32_mquickjs_wifi_radio_vendor_ie_clear_lifecycle(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_OK;
    if (s_vendor_ie.start_owner.identity == 0U) goto done;
    if (!wifi_radio_vendor_ie_start_matches(token) || !s_radio.driver_owned) {
        err = ESP_ERR_INVALID_STATE; goto done;
    }
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_VENDOR_IE_SLOTS; ++i) {
        esp_err_t removal = wifi_radio_vendor_ie_remove(i, token);
        if (err == ESP_OK && removal != ESP_OK) err = removal;
    }
    wifi_radio_vendor_ie_release_empty(WIFI_IF_STA);
    wifi_radio_vendor_ie_release_empty(WIFI_IF_AP);
    if (err == ESP_OK) wifi_radio_vendor_ie_start_commit(token);
done:
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_vendor_ie_set(wifi_interface_t interface,
    wifi_vendor_ie_type_t frame, unsigned index, bool enabled, const uint8_t *bytes, size_t length)
{
    if ((interface != WIFI_IF_STA && interface != WIFI_IF_AP) || (unsigned)frame > WIFI_VND_IE_TYPE_ASSOC_RESP ||
        index > 1U || wifi_radio_vendor_ie_interface(frame) != interface ||
        (enabled && (bytes == NULL || length < 6U || length > ESP32_MQUICKJS_WIFI_VENDOR_IE_MAX_BYTES ||
                     bytes[0] != WIFI_VENDOR_IE_ELEMENT_ID || (size_t)bytes[1] + 2U != length)) ||
        (!enabled && (bytes != NULL || length != 0U))) return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (interface == WIFI_IF_AP) return ESP_ERR_NOT_SUPPORTED;
#endif
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (s_radio.lifecycle.identity != 0U || s_vendor_ie.start_owner.identity != 0U) goto done;
    unsigned slot_index = (unsigned)frame * 2U + index;
    esp32_mquickjs_wifi_vendor_ie_slot_t *slot = &s_vendor_ie.slots[slot_index];
    if (!enabled) {
        err = wifi_radio_vendor_ie_remove(slot_index, NULL);
        wifi_radio_vendor_ie_release_empty(interface);
        goto done;
    }
    if (!s_radio.storage_configured || s_radio.operation.identity != 0U ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED) ||
        (!s_radio.started && s_radio.stop_required)) goto done;
    wifi_mode_t required = interface == WIFI_IF_STA ? WIFI_MODE_STA : WIFI_MODE_AP;
    if ((s_radio.effective_mode & required) != required || slot->length != 0U || slot->pending) goto done;
    esp32_mquickjs_wifi_radio_lease_t *lease = &s_vendor_ie.leases[interface];
    if (!lease->acquired) {
        err = wifi_radio_acquire_locked(ESP32_MQUICKJS_WIFI_RADIO_CLIENT_VENDOR_IE, required, lease);
        if (err != ESP_OK) goto done;
    } else if (!wifi_radio_lease_valid(lease)) goto done;
    /* Reserve the bounded cleanup obligation before a possibly partial write.
     * A failed call cannot free this owner or be silently resubmitted. */
    slot->pending = true;
    err = esp_wifi_set_vendor_ie(true, frame, (wifi_vendor_ie_id_t)index, bytes);
    slot->error = err;
    if (err == ESP_OK) { slot->length = (uint16_t)length; slot->pending = false; }
done:
    wifi_radio_operation_unlock();
    return err;
}

