99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_vendor_ie_clear(int interface)
{
    if (interface != -1 && interface != WIFI_IF_STA && interface != WIFI_IF_AP) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_OK;
    bool any = false;
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_VENDOR_IE_SLOTS; ++i)
        if ((interface == -1 || wifi_radio_vendor_ie_interface((wifi_vendor_ie_type_t)(i / 2U)) == interface) &&
            (s_vendor_ie.slots[i].length != 0U || s_vendor_ie.slots[i].pending)) any = true;
    if (!any) goto done;
    /* Explicit removal is allowed in a faulted driver; never clear its fault.
     * There is no callback or pending send identity to wait on for these copies. */
    if (!s_radio.driver_owned || s_radio.lifecycle.identity != 0U) { err = ESP_ERR_INVALID_STATE; goto done; }
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_VENDOR_IE_SLOTS; ++i) {
        wifi_interface_t selected = wifi_radio_vendor_ie_interface((wifi_vendor_ie_type_t)(i / 2U));
        if (interface != -1 && selected != interface) continue;
        esp_err_t removal = wifi_radio_vendor_ie_remove(i, NULL);
        if (err == ESP_OK && removal != ESP_OK) err = removal;
    }
    if (interface == -1 || interface == WIFI_IF_STA) wifi_radio_vendor_ie_release_empty(WIFI_IF_STA);
    if (interface == -1 || interface == WIFI_IF_AP) wifi_radio_vendor_ie_release_empty(WIFI_IF_AP);
done:
    wifi_radio_operation_unlock();
    return err;
}

void esp32_mquickjs_wifi_radio_vendor_ie_status(esp32_mquickjs_wifi_vendor_ie_status_t *status)
{
    if (status == NULL) return;
    wifi_radio_operation_lock();
    *status = (esp32_mquickjs_wifi_vendor_ie_status_t){.generation = s_radio.generation,
        .start_pending = s_vendor_ie.start_owner.identity != 0U};
    memcpy(status->slots, s_vendor_ie.slots, sizeof(status->slots));
    for (unsigned i = 0; i < 2U; ++i) if (s_vendor_ie.leases[i].acquired) ++status->owners;
    wifi_radio_operation_unlock();
}

esp_err_t esp32_mquickjs_wifi_radio_event_mask(bool write, uint32_t requested,
    uint32_t *actual, esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (actual != NULL) *actual = 0;
    if (result == NULL) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "admission", .error = ESP_ERR_INVALID_ARG};
    const uint32_t allowed = WIFI_EVENT_MASK_AP_PROBEREQRECVED;
    if (actual == NULL || (write && (requested & ~allowed) != 0U)) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (!s_radio.storage_configured || s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED)) goto done;
    uint32_t previous = 0, observed = 0;
    result->stage = "event-mask-read";
    err = esp_wifi_get_event_mask(&previous);
    if (err != ESP_OK) goto done;
    if (!write || previous == requested) {
        *actual = previous;
        result->stage = "complete";
        goto done;
    }
    result->stage = "event-mask-write";
    result->mutation_attempted = true;
    err = esp_wifi_set_event_mask(requested);
    if (err == ESP_OK) {
        result->stage = "event-mask-readback";
        err = esp_wifi_get_event_mask(&observed);
        if (err == ESP_OK && observed != requested) err = ESP_ERR_INVALID_RESPONSE;
    }
    if (err == ESP_OK) {
        *actual = observed;
        result->stage = "complete";
        goto done;
    }
    if ((previous & ~allowed) == 0U) {
        result->rollback_attempted = true;
        result->rollback_stage = "rollback-event-mask";
        result->rollback_error = esp_wifi_set_event_mask(previous);
        if (result->rollback_error == ESP_OK) {
            result->rollback_stage = "rollback-event-mask-readback";
            result->rollback_error = esp_wifi_get_event_mask(&observed);
            if (result->rollback_error == ESP_OK && observed != previous)
                result->rollback_error = ESP_ERR_INVALID_RESPONSE;
        }
        result->rollback_complete = result->rollback_error == ESP_OK;
        if (result->rollback_complete) result->rollback_stage = NULL;
    }
    /* A failed setter may already have taken effect. Never restore an unsafe
     * externally supplied mask just to make a transaction look reversible. */
    if (!result->rollback_complete) {
        (void)wifi_radio_record_fault(result->stage, err);
        if (result->rollback_attempted)
            (void)wifi_radio_cleanup_fault("event-mask-rollback", result->rollback_error);
    }
done:
    result->error = err;
    if (write) {
        taskENTER_CRITICAL(&s_radio.lock);
        s_radio.configuration = *result;
        taskEXIT_CRITICAL(&s_radio.lock);
    }
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_dump_stats(uint32_t mask, const char **stage)
{
    if (stage == NULL) return ESP_ERR_INVALID_ARG;
    *stage = "mask";
    const uint32_t bits = WIFI_STATIS_BUFFER | WIFI_STATIS_RXTX | WIFI_STATIS_HW |
        WIFI_STATIS_DIAG | WIFI_STATIS_PS;
    if (mask != (uint32_t)WIFI_STATIS_ALL && (mask & ~bits) != 0U) return ESP_ERR_INVALID_ARG;
    *stage = "admission";
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (!s_radio.storage_configured || s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED)) goto done;
    *stage = "driver-dump";
    err = esp_wifi_statis_dump(mask);
    if (err == ESP_OK) *stage = NULL;
done:
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_read_state(esp32_mquickjs_wifi_driver_state_query_t query,
    esp32_mquickjs_wifi_driver_state_readback_t *output, const char **stage)
{
    if (output != NULL) memset(output, 0, sizeof(*output));
    if (stage != NULL) *stage = "admission";
    if (output == NULL || stage == NULL || (unsigned)query > ESP32_MQUICKJS_WIFI_DRIVER_STATE_HOME_CHANNEL)
        return ESP_ERR_INVALID_ARG;
    esp32_mquickjs_wifi_driver_state_readback_t value = {0};
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (!s_radio.storage_configured || s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED)) goto done;
    switch (query) {
    case ESP32_MQUICKJS_WIFI_DRIVER_STATE_MODE:
        *stage = "mode";
        err = esp_wifi_get_mode(&value.mode);
        if (err != ESP_OK) goto done;
        if (value.mode != WIFI_MODE_NULL && value.mode != WIFI_MODE_STA &&
            value.mode != WIFI_MODE_AP && value.mode != WIFI_MODE_APSTA) goto invalid;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
        if (value.mode == WIFI_MODE_AP || value.mode == WIFI_MODE_APSTA) goto invalid;
#endif
        break;
    case ESP32_MQUICKJS_WIFI_DRIVER_STATE_COUNTRY: {
        *stage = "country";
        err = esp_wifi_get_country(&value.country);
        if (err != ESP_OK) goto done;
        const wifi_country_t *c = &value.country;
        if (!wifi_radio_country_valid(c)) goto invalid;
        /* Raw 5 GHz mask is reported without treating zero/automatic as an
         * authoritative channel allowlist. No regulatory reconfiguration. */
        break;
    }
    case ESP32_MQUICKJS_WIFI_DRIVER_STATE_CHANNEL:
    case ESP32_MQUICKJS_WIFI_DRIVER_STATE_HOME_CHANNEL:
        if (query == ESP32_MQUICKJS_WIFI_DRIVER_STATE_HOME_CHANNEL) {
            if (!s_radio.started) { err = ESP_ERR_WIFI_NOT_STARTED; goto done; }
            *stage = "home-channel";
            /* Home channel has no callback revision. Never write it into the
             * current-channel cache or attach that cache's generation to it. */
            err = esp_wifi_get_home_channel(&value.channel, &value.secondary);
        } else {
            *stage = "channel";
            err = wifi_radio_get_channel_locked(&value.channel, &value.secondary, &value.channel_generation);
        }
        if (err != ESP_OK) goto done;
        if (value.channel < 1 || (value.channel > 14 &&
#if CONFIG_SOC_WIFI_SUPPORT_5G
            esp32_mquickjs_wifi_radio_5ghz_channel_bit(value.channel) == 0U
#else
            true
#endif
            ) || (value.secondary != WIFI_SECOND_CHAN_NONE && value.secondary != WIFI_SECOND_CHAN_ABOVE &&
                  value.secondary != WIFI_SECOND_CHAN_BELOW)) goto invalid;
        break;
    }
    *output = value;
    *stage = NULL;
    goto done;
invalid:
    *stage = "decode";
    err = ESP_ERR_INVALID_RESPONSE;
done:
    wifi_radio_operation_unlock();
    return err;
}

