99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_read_driver(esp32_mquickjs_wifi_driver_query_t query,
    wifi_interface_t interface, int64_t *output, const char **stage)
{
    if (output != NULL) *output = 0;
    if (stage != NULL) *stage = "admission";
    if (output == NULL || stage == NULL ||
        (unsigned)query > ESP32_MQUICKJS_WIFI_DRIVER_INACTIVE_TIME ||
        (interface != WIFI_IF_STA && interface != WIFI_IF_AP)) return ESP_ERR_INVALID_ARG;
    bool station = query == ESP32_MQUICKJS_WIFI_DRIVER_RSSI || query == ESP32_MQUICKJS_WIFI_DRIVER_AID ||
                   query == ESP32_MQUICKJS_WIFI_DRIVER_NEGOTIATED_PHY;
    bool by_interface = query == ESP32_MQUICKJS_WIFI_DRIVER_TSF_TIME || query == ESP32_MQUICKJS_WIFI_DRIVER_INACTIVE_TIME;
    if ((!by_interface || station) && interface != WIFI_IF_STA) return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (interface == WIFI_IF_AP) return ESP_ERR_NOT_SUPPORTED;
#endif
    bool started = query == ESP32_MQUICKJS_WIFI_DRIVER_TX_POWER || query == ESP32_MQUICKJS_WIFI_DRIVER_RSSI ||
                   query == ESP32_MQUICKJS_WIFI_DRIVER_NEGOTIATED_PHY || by_interface;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    int64_t value = 0;
    if (!s_radio.driver_owned) { err = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (!s_radio.storage_configured || s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED)) goto done;
    if ((station || by_interface) && !(s_radio.effective_mode & (interface == WIFI_IF_STA ? WIFI_MODE_STA : WIFI_MODE_AP)))
        goto done;
    if (started && !s_radio.started) { err = ESP_ERR_WIFI_NOT_STARTED; goto done; }
    switch (query) {
    case ESP32_MQUICKJS_WIFI_DRIVER_BAND: {
        wifi_band_t band;
        *stage = "band";
        err = esp_wifi_get_band(&band);
        if (err != ESP_OK) goto done;
        value = band;
        if (band != WIFI_BAND_2G && band != WIFI_BAND_5G) goto invalid;
#if !CONFIG_SOC_WIFI_SUPPORT_5G
        if (band != WIFI_BAND_2G) goto invalid;
#endif
        break;
    }
    case ESP32_MQUICKJS_WIFI_DRIVER_BAND_MODE: {
        wifi_band_mode_t mode;
        *stage = "band-mode";
        err = esp_wifi_get_band_mode(&mode);
        if (err != ESP_OK) goto done;
        value = mode;
        if (mode != WIFI_BAND_MODE_2G_ONLY && mode != WIFI_BAND_MODE_5G_ONLY && mode != WIFI_BAND_MODE_AUTO) goto invalid;
#if !CONFIG_SOC_WIFI_SUPPORT_5G
        if (mode != WIFI_BAND_MODE_2G_ONLY) goto invalid;
#endif
        break;
    }
    case ESP32_MQUICKJS_WIFI_DRIVER_POWER_SAVE: {
        wifi_ps_type_t mode;
        *stage = "power-save";
        err = esp_wifi_get_ps(&mode);
        if (err != ESP_OK) goto done;
        value = mode;
        if (mode != WIFI_PS_NONE && mode != WIFI_PS_MIN_MODEM && mode != WIFI_PS_MAX_MODEM) goto invalid;
        break;
    }
    case ESP32_MQUICKJS_WIFI_DRIVER_TX_POWER: {
        int8_t power;
        *stage = "tx-power";
        err = esp_wifi_get_max_tx_power(&power);
        if (err != ESP_OK) goto done;
        value = power;
        break;
    }
    case ESP32_MQUICKJS_WIFI_DRIVER_RSSI: {
        int rssi;
        *stage = "rssi";
        err = esp_wifi_sta_get_rssi(&rssi);
        if (err != ESP_OK) goto done;
        value = rssi;
        break;
    }
    case ESP32_MQUICKJS_WIFI_DRIVER_AID: {
        uint16_t aid;
        *stage = "aid";
        err = esp_wifi_sta_get_aid(&aid);
        if (err != ESP_OK) goto done;
        value = aid; /* SDK reports zero when not associated. */
        break;
    }
    case ESP32_MQUICKJS_WIFI_DRIVER_NEGOTIATED_PHY: {
        wifi_phy_mode_t phy;
        *stage = "negotiated-phy";
        err = esp_wifi_sta_get_negotiated_phymode(&phy);
        if (err != ESP_OK) goto done;
        if (esp32_mquickjs_wifi_tx_phy_name(phy) == NULL) goto invalid;
        value = phy;
        break;
    }
    case ESP32_MQUICKJS_WIFI_DRIVER_TSF_TIME:
        *stage = "tsf-time";
        value = esp_wifi_get_tsf_time(interface);
        if (value < 0 || value > INT64_C(9007199254740991)) goto invalid;
        err = ESP_OK;
        break;
    case ESP32_MQUICKJS_WIFI_DRIVER_INACTIVE_TIME: {
        uint16_t seconds;
        *stage = "inactive-time";
        err = esp_wifi_get_inactive_time(interface, &seconds);
        if (err != ESP_OK) goto done;
        value = seconds;
        break;
    }
    default:
        err = ESP_ERR_INVALID_ARG;
        goto done;
    }
    *output = value;
    *stage = NULL;
    goto done;
invalid:
    *stage = "decode";
    err = ESP_ERR_INVALID_RESPONSE;
done:
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_get_mac(wifi_interface_t interface, uint8_t mac[6])
{
    if (mac == NULL || (interface != WIFI_IF_STA && interface != WIFI_IF_AP))
        return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (interface == WIFI_IF_AP) return ESP_ERR_NOT_SUPPORTED;
#endif
    uint8_t value[6];
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (s_radio.driver_owned && s_radio.lifecycle.identity == 0U &&
        s_radio.fault_stage == NULL && s_radio.cleanup_stage == NULL) {
        err = esp_wifi_get_mac(interface, value);
        if (err == ESP_OK) memcpy(mac, value, sizeof(value));
    }
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_set_mac(wifi_interface_t interface, const uint8_t requested[6],
    uint8_t actual[6], esp32_mquickjs_wifi_radio_mutation_t *mutation)
{
    if (mutation == NULL) return ESP_ERR_INVALID_ARG;
    *mutation = (esp32_mquickjs_wifi_radio_mutation_t){.stage = "admission"};
    if (requested == NULL || actual == NULL ||
        (interface != WIFI_IF_STA && interface != WIFI_IF_AP) ||
        (requested[0] & 1U) != 0 || memcmp(requested, "\0\0\0\0\0\0", 6) == 0)
        return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (interface == WIFI_IF_AP) return ESP_ERR_NOT_SUPPORTED;
#endif
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned || !s_radio.storage_configured || s_radio.started || s_radio.stop_required ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED ||
        s_radio.lifecycle.identity != 0 || s_radio.operation.identity != 0 ||
        s_radio.promiscuous_claimed || s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0) goto done;
    /* The SDK requires disabled interfaces and distinct interface addresses.
     * A fully stopped, owner-free driver excludes both activity and re-start. */
    static const wifi_interface_t interfaces[] = {
        WIFI_IF_STA,
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
        WIFI_IF_AP,
#endif
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE || CONFIG_ESP_WIFI_NAN_USD_ENABLE
        WIFI_IF_NAN,
#endif
    };
    mutation->stage = "mac-collision-check";
    for (size_t i = 0; i < sizeof(interfaces) / sizeof(*interfaces); ++i) {
        if (interfaces[i] == interface) continue;
        uint8_t other[6];
        err = esp_wifi_get_mac(interfaces[i], other);
        if (err != ESP_OK) goto done;
        if (memcmp(other, requested, 6) == 0) { err = ESP_ERR_INVALID_ARG; goto done; }
    }
    mutation->stage = "mac-set";
    err = esp_wifi_set_mac(interface, requested);
    if (err != ESP_OK) goto done;
    mutation->driver_accepted = true;
    mutation->stage = "mac-readback";
    uint8_t value[6];
    err = esp_wifi_get_mac(interface, value);
    if (err == ESP_OK) {
        if (memcmp(value, requested, 6) != 0) err = ESP_ERR_INVALID_RESPONSE;
        else { memcpy(actual, value, 6); mutation->stage = NULL; }
    }
done:
    wifi_radio_operation_unlock();
    return err;
}

#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
esp_err_t esp32_mquickjs_wifi_radio_sample_ap(
    const esp32_mquickjs_wifi_radio_lease_t *lease,
    esp32_mquickjs_wifi_ap_snapshot_t *snapshot, const char **stage)
{
    if (snapshot == NULL || stage == NULL) return ESP_ERR_INVALID_ARG;
    memset(snapshot, 0, sizeof(*snapshot));
    *stage = "admission";
    /* Keep the SDK config, including its password, off the runtime task stack.
     * Nothing from this temporary workspace escapes except whitelisted fields. */
    struct ap_query { wifi_config_t config; wifi_sta_list_t stations; } *query = NULL;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_lease_valid(lease) ||
        (lease->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP &&
         !(lease->client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_RAW_TX &&
           s_tx_rate_lease.interface == WIFI_IF_AP && s_tx_rate_lease.identity == lease->identity &&
           s_tx_rate_lease.generation == lease->generation)) ||
        !s_radio.started || s_radio.lifecycle.identity != 0U ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL) goto done;
    wifi_mode_t mode;
    *stage = "mode";
    err = esp_wifi_get_mode(&mode);
    if (err != ESP_OK) goto done;
    if ((mode & WIFI_MODE_AP) == 0) { err = ESP_ERR_INVALID_STATE; goto done; }
    *stage = "allocate";
    query = esp32_mquickjs_memory_wireless_calloc("wifi.radio", 1, sizeof(*query), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (query == NULL) { err = ESP_ERR_NO_MEM; goto done; }
    *stage = "config";
    err = esp_wifi_get_config(WIFI_IF_AP, &query->config);
    if (err != ESP_OK) goto done;
    size_t length = query->config.ap.ssid_len;
    if (length == 0) length = strnlen((const char *)query->config.ap.ssid, 32);
    if (length > sizeof(snapshot->ssid)) { err = ESP_ERR_INVALID_SIZE; goto done; }
    memcpy(snapshot->ssid, query->config.ap.ssid, length);
    snapshot->ssid_len = length;
    snapshot->hidden = query->config.ap.ssid_hidden;
    snapshot->authmode = query->config.ap.authmode;
    snapshot->max_connections = query->config.ap.max_connection;
    *stage = "mac";
    err = esp_wifi_get_mac(WIFI_IF_AP, snapshot->mac);
    if (err != ESP_OK) goto done;
    *stage = "clients";
    err = esp_wifi_ap_get_sta_list(&query->stations);
    if (err != ESP_OK) goto done;
    if (query->stations.num < 0 || query->stations.num > ESP_WIFI_MAX_CONN_NUM) {
        err = ESP_ERR_INVALID_SIZE;
        goto done;
    }
    snapshot->client_count = query->stations.num;
    *stage = "channel";
    wifi_second_chan_t secondary;
    err = esp_wifi_get_channel(&snapshot->channel, &secondary);
    if (err == ESP_OK) *stage = NULL;
done:
    if (query != NULL) {
        esp32_mquickjs_wireless_secure_zero(query, sizeof(*query));
        esp32_mquickjs_memory_payload_free(query);
    }
    taskENTER_CRITICAL(&s_radio.lock);
    bool started = (s_radio.event_live & WIFI_MODE_AP) != 0;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (err == ESP_OK && !started) { err = ESP_ERR_INVALID_STATE; *stage = "state"; }
    if (err != ESP_OK) memset(snapshot, 0, sizeof(*snapshot));
    snapshot->started = started;
    wifi_radio_operation_unlock();
    return err;
}

#include "esp32_mquickjs_wifi_ap_deauth.inc"

