99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_ap_clients(
    const esp32_mquickjs_wifi_radio_lease_t *lease,
    esp32_mquickjs_wifi_ap_clients_t *snapshot)
{
    if (snapshot == NULL) return ESP_ERR_INVALID_ARG;
    memset(snapshot, 0, sizeof(*snapshot));
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_lease_valid(lease) ||
        lease->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP ||
        !s_radio.started || s_radio.lifecycle.identity != 0U ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL) goto done;
    err = esp_wifi_ap_get_sta_list(&snapshot->stations);
    if (err != ESP_OK) goto done;
    if (snapshot->stations.num < 0 || snapshot->stations.num > ESP_WIFI_MAX_CONN_NUM) {
        err = ESP_ERR_INVALID_SIZE;
        goto done;
    }
    for (int i = 0; i < snapshot->stations.num; ++i) {
        err = esp_wifi_ap_get_sta_aid(snapshot->stations.sta[i].mac, &snapshot->aid[i]);
        if (err == ESP_ERR_NOT_FOUND) {
            snapshot->aid[i] = 0;
            err = ESP_OK;
        }
        if (err != ESP_OK) goto done;
    }
done:
    wifi_radio_operation_unlock();
    if (err != ESP_OK) memset(snapshot, 0, sizeof(*snapshot));
    return err;
}
#endif
#endif

esp_err_t esp32_mquickjs_wifi_radio_get_channel(
    uint8_t *primary, wifi_second_chan_t *secondary, uint32_t *generation)
{
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_get_channel_locked(primary, secondary, generation);
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_get_status(
    esp32_mquickjs_wifi_radio_status_t *status)
{
    if (status == NULL) return ESP_ERR_INVALID_ARG;
    memset(status, 0, sizeof(*status));
    wifi_radio_snapshot(status);
    if (status->lifecycle_active || status->driver_state == ESP32_MQUICKJS_WIFI_RADIO_INITIALIZING ||
        status->driver_state == ESP32_MQUICKJS_WIFI_RADIO_STARTING ||
        status->driver_state == ESP32_MQUICKJS_WIFI_RADIO_STOPPING ||
        status->driver_state == ESP32_MQUICKJS_WIFI_RADIO_CLEANUP_PENDING)
        return ESP_OK;
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_get_status_locked(status);
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_acquire(
    esp32_mquickjs_wifi_radio_client_t client, wifi_mode_t required_mode, esp32_mquickjs_wifi_radio_lease_t *out_lease)
{
    wifi_radio_operation_lock();
    esp_err_t err = client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP ? ESP_ERR_INVALID_ARG :
        s_radio.lifecycle.identity != 0U ? ESP_ERR_INVALID_STATE :
        wifi_radio_acquire_locked(client, required_mode, out_lease);
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_ensure_started(
    esp32_mquickjs_wifi_radio_lease_t *lease)
{
    wifi_radio_operation_lock();
    esp_err_t err = s_radio.lifecycle.identity != 0U ? ESP_ERR_INVALID_STATE :
        wifi_radio_ensure_started_locked(lease);
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_set_channel(
    esp32_mquickjs_wifi_radio_lease_t *lease, uint8_t primary, wifi_second_chan_t secondary)
{
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_set_channel_locked(lease, primary, secondary);
    wifi_radio_operation_unlock();
    return err;
}

void esp32_mquickjs_wifi_radio_release_channel(
    esp32_mquickjs_wifi_radio_lease_t *lease)
{
    wifi_radio_operation_lock();
    wifi_radio_release_channel_locked(lease);
    wifi_radio_operation_unlock();
}

esp_err_t esp32_mquickjs_wifi_radio_acquire_promiscuous(
    esp32_mquickjs_wifi_radio_lease_t *radio_lease, esp32_mquickjs_wifi_radio_promiscuous_lease_t *out_lease)
{
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_acquire_promiscuous_locked(radio_lease, out_lease, NULL, NULL, NULL, NULL);
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_subscribe_promiscuous(
    esp32_mquickjs_wifi_radio_lease_t *radio_lease,
    esp32_mquickjs_wifi_promiscuous_subscriber_t *subscriber,
    const esp32_mquickjs_wifi_rx_filter_t *filter,
    esp32_mquickjs_wifi_promiscuous_sink_t sink, void *context,
    esp32_mquickjs_wifi_radio_promiscuous_lease_t *out_lease)
{
    if (subscriber == NULL) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_acquire_promiscuous_locked(radio_lease, out_lease, subscriber, filter, sink, context);
    wifi_radio_operation_unlock();
    return err;
}

void esp32_mquickjs_wifi_radio_release_promiscuous(
    esp32_mquickjs_wifi_radio_promiscuous_lease_t *lease)
{
    wifi_radio_operation_lock();
    wifi_radio_release_promiscuous_locked(lease);
    wifi_radio_operation_unlock();
}

void esp32_mquickjs_wifi_radio_release(
    esp32_mquickjs_wifi_radio_lease_t *lease)
{
    wifi_radio_operation_lock();
    wifi_radio_release_locked(lease);
    wifi_radio_operation_unlock();
}

const void *
esp32_mquickjs_wifi_radio_channel_key(void)
{
    return &s_wifi_radio_channel_lane_key;
}

#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
esp_err_t esp32_mquickjs_wifi_radio_begin_raw_tx_ap_rate(
    const wifi_tx_rate_config_t *rate, esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t *mode)
{
    if (token == NULL || token->identity != 0U || token->generation != 0U || mode == NULL ||
        !esp32_mquickjs_wifi_tx_rate_valid(rate)) return ESP_ERR_INVALID_ARG;
    *mode = WIFI_MODE_NULL;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    return ESP_ERR_NOT_SUPPORTED;
#else
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned || !s_radio.storage_configured || s_radio.started || s_radio.stop_required ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED ||
        (s_radio.effective_mode != WIFI_MODE_AP && s_radio.effective_mode != WIFI_MODE_APSTA) ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required ||
        s_interval.owner.identity != 0U || s_interval.uncertain || s_interval.restore_pending ||
        s_vendor_ie.start_owner.identity != 0U || s_config_restart.snapshot != NULL ||
        s_policy_restart.owner.identity != 0U) goto done;
    err = esp32_mquickjs_wifi_tx_rate_borrow_admission(&s_tx_rates, s_radio.generation,
        WIFI_IF_AP, rate, &s_tx_rate_lease);
    if (err == ESP_OK) err = wifi_radio_begin_lifecycle_locked(NULL, NULL, NULL, token);
    if (err == ESP_OK) *mode = s_radio.effective_mode;
done:
    wifi_radio_operation_unlock();
    return err;
#endif
}

