99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_start_raw_tx_ap_rate(
    esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t requested_mode, const wifi_config_t *expected,
    const wifi_tx_rate_config_t *rate, esp32_mquickjs_wifi_radio_lease_t *lease,
    uint8_t *actual_channel)
{
    if (token == NULL || token->identity == 0U || expected == NULL || lease == NULL ||
        (requested_mode != WIFI_MODE_AP && requested_mode != WIFI_MODE_APSTA) ||
        lease->acquired || lease->identity != 0U || lease->generation != 0U || actual_channel == NULL ||
        !esp32_mquickjs_wifi_tx_rate_valid(rate)) return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    return ESP_ERR_NOT_SUPPORTED;
#else
    /* Reserve temporary credential storage before taking any native owner. */
    wifi_config_t *actual = esp32_mquickjs_memory_wireless_calloc("wifi.radio", 1, sizeof(*actual), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (actual == NULL) return ESP_ERR_NO_MEM;
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_check_stopped_lifecycle_locked(token, false);
    if (err != ESP_OK) goto done;
    if (!s_radio.driver_owned || !s_radio.storage_configured || s_radio.effective_mode != requested_mode ||
        s_vendor_ie.start_owner.identity != 0U || s_config_restart.snapshot != NULL ||
        s_policy_restart.owner.identity != 0U) { err = ESP_ERR_INVALID_STATE; goto done; }
    err = esp32_mquickjs_wifi_tx_rate_borrow_admission(&s_tx_rates, s_radio.generation,
        WIFI_IF_AP, rate, &s_tx_rate_lease);
    if (err != ESP_OK) goto done;
    *actual = *expected;
    err = wifi_radio_validate_saved_ap_config(actual);
    if (err != ESP_OK) goto done;
    if (expected->ap.channel != 0U) {
        err = wifi_radio_validate_regulatory_channel(expected->ap.channel);
        if (err != ESP_OK) goto done;
    }
    wifi_mode_t mode;
    err = esp_wifi_get_mode(&mode);
    if (err == ESP_OK && mode != requested_mode) err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) goto done;
    err = esp_wifi_get_config(WIFI_IF_AP, actual);
    if (err == ESP_OK && !wifi_radio_config_equal(WIFI_IF_AP, expected, actual)) err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) goto done;
    err = wifi_radio_acquire_locked(ESP32_MQUICKJS_WIFI_RADIO_CLIENT_RAW_TX, requested_mode, lease);
    if (err != ESP_OK) goto done;
    err = esp32_mquickjs_wifi_tx_rate_borrow(&s_tx_rates, lease->generation, lease->identity,
        WIFI_IF_AP, rate, &s_tx_rate_lease, wifi_radio_write_tx_rate, NULL);
    if (err != ESP_OK) {
        if (s_tx_rate_lease.restore_pending)
            wifi_radio_cleanup_fault(s_tx_rate_restore_fault, s_tx_rate_lease.restore_error);
        goto handoff;
    }
    err = wifi_radio_ensure_started_locked(lease);
    if (err != ESP_OK) goto handoff;
    err = esp_wifi_get_mode(&mode);
    if (err == ESP_OK && mode != requested_mode) err = ESP_ERR_INVALID_RESPONSE;
    if (err != ESP_OK) { wifi_radio_record_fault("raw-tx-ap-mode", err); goto handoff; }
    uint8_t primary;
    wifi_second_chan_t secondary;
    uint32_t revision;
    err = wifi_radio_get_channel_locked(&primary, &secondary, &revision);
    if (err == ESP_OK && (primary == 0U || (expected->ap.channel != 0U && primary != expected->ap.channel)))
        err = ESP_ERR_INVALID_RESPONSE;
    if (err == ESP_OK) *actual_channel = primary;
    else wifi_radio_record_fault("raw-tx-ap-channel", err);
handoff:
    /* A live temporary-rate record excludes every new Radio/wake owner, and
     * retains the real lease until STOP/restore. This remains true after failed
     * write/START. If rollback removed the record, retain lifecycle instead. */
    if (s_tx_rate_lease.identity == lease->identity && s_tx_rate_lease.generation == lease->generation) {
        taskENTER_CRITICAL(&s_radio.lock);
        memset(&s_radio.lifecycle, 0, sizeof(s_radio.lifecycle));
        taskEXIT_CRITICAL(&s_radio.lock);
        memset(token, 0, sizeof(*token));
    }
done:
    wifi_radio_operation_unlock();
    esp32_mquickjs_wireless_secure_zero(actual, sizeof(*actual));
    esp32_mquickjs_memory_payload_free(actual);
    return err;
#endif
}

esp_err_t esp32_mquickjs_wifi_radio_quiesce_raw_tx_ap_rate(
    esp32_mquickjs_wifi_radio_lease_t *lease, esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (lease == NULL || token == NULL || (token->identity == 0U && token->generation != 0U)) return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    return ESP_ERR_NOT_SUPPORTED;
#else
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    bool reserved = token->identity != 0U;
    if (reserved ? token->identity != s_radio.lifecycle.identity || token->generation != s_radio.lifecycle.generation
                 : s_radio.lifecycle.identity != 0U) goto done;
    if (s_radio.wake_locks != 0U || s_radio.operation.identity != 0U || s_radio.promiscuous_claimed) goto done;
    if (!reserved && s_radio.next_lifecycle_identity == 0U) { err = ESP_ERR_NO_MEM; goto done; }
    if (lease->acquired) {
        if (!wifi_radio_lease_valid(lease) || lease->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_RAW_TX) goto done;
        wifi_radio_live_lease_t *owner = wifi_radio_promiscuous_owner(lease->identity);
        if (owner == NULL || (owner->required_mode != WIFI_MODE_AP && owner->required_mode != WIFI_MODE_APSTA) ||
            owner->raw_tx_identity != 0U) goto done;
        for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
            if (s_radio.leases[i].identity != 0U && s_radio.leases[i].identity != lease->identity) goto done;
        if (s_tx_rate_lease.identity != 0U) {
            if (reserved || s_tx_rate_lease.interface != WIFI_IF_AP ||
                s_tx_rate_lease.identity != lease->identity || s_tx_rate_lease.generation != lease->generation) goto done;
            err = wifi_radio_restore_tx_rate_locked(lease);
            if (err != ESP_OK) goto done;
        } else if (!reserved || s_radio.started || s_radio.stop_required) goto done;
        wifi_radio_release_locked(lease);
        if (lease->acquired) { err = ESP_ERR_INVALID_STATE; goto done; }
    } else if (!reserved || lease->identity != 0U || lease->generation != 0U) goto done;
    /* The mutex spans final owner release and new reservation. AP helper
     * retirement therefore never observes an unprotected driver generation. */
    if (!reserved) {
        err = wifi_radio_begin_lifecycle_locked(NULL, NULL, NULL, token);
        if (err != ESP_OK) goto done;
    }
    err = wifi_radio_stop_locked();
done:
    wifi_radio_operation_unlock();
    return err;
#endif
}
#endif

