99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
esp_err_t esp32_mquickjs_wifi_radio_raw_tx_acquire(
    esp32_mquickjs_wifi_raw_tx_interface_t interface, uint8_t channel,
    const wifi_tx_rate_config_t *rate,
    esp32_mquickjs_wifi_radio_lease_t *lease, uint8_t *actual_channel)
{
    if (lease == NULL || lease->acquired || lease->identity != 0U || lease->generation != 0U ||
        actual_channel == NULL || (interface != ESP32_MQUICKJS_WIFI_RAW_TX_STATION &&
        interface != ESP32_MQUICKJS_WIFI_RAW_TX_ACCESS_POINT) ||
        (rate != NULL && !esp32_mquickjs_wifi_tx_rate_valid(rate))) return ESP_ERR_INVALID_ARG;
    wifi_mode_t required = interface == ESP32_MQUICKJS_WIFI_RAW_TX_STATION ? WIFI_MODE_STA : WIFI_MODE_AP;
    wifi_interface_t rate_interface = required == WIFI_MODE_STA ? WIFI_IF_STA : WIFI_IF_AP;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    uint8_t actual;
    wifi_second_chan_t secondary;
    uint32_t revision;
    if (s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U) goto done;
    if (rate != NULL) {
        /* Pre-start only. AP still requires an already running AP below, so it
         * cannot borrow a rate through this startup path. No implicit AP reset. */
        if (required != WIFI_MODE_STA) { err = ESP_ERR_NOT_SUPPORTED; goto done; }
        if (!s_radio.driver_owned || !s_radio.storage_configured || s_radio.started || s_radio.stop_required ||
            s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED || s_radio.restart_required ||
            s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.wake_locks != 0U ||
            s_radio.promiscuous_claimed) goto done;
        err = esp32_mquickjs_wifi_tx_rate_borrow_admission(&s_tx_rates, s_radio.generation,
            rate_interface, rate, &s_tx_rate_lease);
        if (err != ESP_OK) goto done;
        err = ESP_ERR_INVALID_STATE;
        for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
            if (s_radio.leases[i].identity != 0U) goto done;
    }
    /* AP startup is owned by the AP helper/configuration transaction. */
    if (required == WIFI_MODE_AP && (!s_radio.started || !(s_radio.effective_mode & WIFI_MODE_AP))) goto done;
    if (channel != 0U) {
        if (channel > 14U) {
#if CONFIG_SOC_WIFI_SUPPORT_5G
            if (esp32_mquickjs_wifi_radio_5ghz_channel_bit(channel) == 0U) { err = ESP_ERR_INVALID_ARG; goto done; }
#else
            err = ESP_ERR_INVALID_ARG; goto done;
#endif
        }
        if (s_radio.storage_configured) {
            err = wifi_radio_validate_regulatory_channel(channel);
            if (err != ESP_OK) goto done;
        }
    }
    err = wifi_radio_acquire_locked(ESP32_MQUICKJS_WIFI_RADIO_CLIENT_RAW_TX, required, lease);
    if (err != ESP_OK) goto done;
    if (rate != NULL) {
        err = esp32_mquickjs_wifi_tx_rate_borrow(&s_tx_rates, lease->generation, lease->identity,
            rate_interface, rate, &s_tx_rate_lease, wifi_radio_write_tx_rate, NULL);
        if (err != ESP_OK) {
            if (s_tx_rate_lease.restore_pending)
                wifi_radio_cleanup_fault(s_tx_rate_restore_fault, s_tx_rate_lease.restore_error);
            goto done;
        }
    }
    err = wifi_radio_ensure_started_locked(lease);
    if (err != ESP_OK) goto done;
    err = wifi_radio_get_channel_locked(&actual, &secondary, &revision);
    if (err != ESP_OK) goto done;
    if (channel != 0U) {
        err = wifi_radio_set_channel_locked(lease, channel, secondary);
        if (err != ESP_OK) goto done;
        actual = channel;
    }
    *actual_channel = actual;
done:
    /* Retain even a partially acquired lease on failure. The native caller
     * owns release/stop cleanup and must not lose a failed-start diagnostic. */
    wifi_radio_operation_unlock();
    return err;
}

static void wifi_radio_raw_tx_unpin(wifi_radio_live_lease_t *owner)
{
    taskENTER_CRITICAL(&s_radio.lock);
    owner->raw_tx_identity = 0;
    if (owner->raw_tx_channel_pinned) {
        owner->fixed_channel = false;
        owner->channel_conflict = false;
        owner->raw_tx_channel_pinned = false;
    }
    taskEXIT_CRITICAL(&s_radio.lock);
}

esp_err_t esp32_mquickjs_wifi_radio_raw_tx_submit(
    const esp32_mquickjs_wifi_radio_lease_t *lease,
    esp32_mquickjs_wifi_raw_tx_interface_t interface, bool driver_sequence,
    const uint8_t *bytes, size_t length, esp32_mquickjs_wifi_raw_tx_token_t *token,
    esp32_mquickjs_wifi_raw_tx_validation_t *validation, uint8_t *actual_channel)
{
    if (token == NULL || token->identity != 0U || token->generation != 0U || token->radio_lease_identity != 0U ||
        validation == NULL || actual_channel == NULL) return ESP_ERR_INVALID_ARG;
    esp32_mquickjs_wifi_raw_tx_validation_policy_t policy = {.interface = interface, .driver_sequence = driver_sequence};
    esp32_mquickjs_wifi_raw_tx_validated_frame_t frame;
    *validation = esp32_mquickjs_wifi_raw_tx_validate(bytes, length, &policy, &frame);
    if (*validation != ESP32_MQUICKJS_WIFI_RAW_TX_VALID) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    wifi_mode_t mode;
    uint8_t actual;
    wifi_second_chan_t secondary;
    uint32_t revision;
    if (!wifi_radio_lease_valid(lease) || lease->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_RAW_TX ||
        !s_radio.started || s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U) goto done;
    if (s_radio.fault_stage != NULL) { err = s_radio.fault_error; goto done; }
    wifi_radio_live_lease_t *owner = wifi_radio_promiscuous_owner(lease->identity);
    wifi_mode_t required = interface == ESP32_MQUICKJS_WIFI_RAW_TX_STATION ? WIFI_MODE_STA : WIFI_MODE_AP;
    if (owner == NULL || owner->required_mode != required) goto done;
    esp32_mquickjs_wifi_raw_tx_broker_status_t status;
    esp32_mquickjs_wifi_raw_tx_broker_status(&status);
    if (status.in_flight >= status.max_in_flight || status.registration_uncertain ||
        status.unregister_written || status.identity_exhausted) goto done;
    err = esp_wifi_get_mode(&mode);
    if (err != ESP_OK) goto done;
    if ((mode & required) != required || mode != s_radio.effective_mode) { err = ESP_ERR_INVALID_STATE; goto done; }
    /* The SDK evaluates association-dependent sequence/DS/flag constraints
     * using its live state; do not gate submission on a separate snapshot. */
    err = wifi_radio_get_channel_locked(&actual, &secondary, &revision);
    if (err != ESP_OK) goto done;
    taskENTER_CRITICAL(&s_radio.lock);
    bool conflict = owner->channel_conflict || (owner->fixed_channel &&
        (owner->primary_channel != actual || owner->secondary_channel != (uint8_t)secondary));
    taskEXIT_CRITICAL(&s_radio.lock);
    if (conflict) { err = ESP_ERR_INVALID_STATE; goto done; }
    err = esp32_mquickjs_wifi_raw_tx_broker_register(lease->generation);
    if (err != ESP_OK) goto done;
    taskENTER_CRITICAL(&s_radio.lock);
    if (owner->channel_conflict || s_radio.channel_observation_error != ESP_OK ||
        s_radio.primary_channel != actual || s_radio.secondary_channel != secondary) {
        taskEXIT_CRITICAL(&s_radio.lock);
        err = ESP_ERR_INVALID_STATE;
        goto done;
    }
    if (owner->raw_tx_identity == 0U) owner->raw_tx_channel_pinned = !owner->fixed_channel;
    owner->fixed_channel = true;
    owner->primary_channel = actual;
    owner->secondary_channel = (uint8_t)secondary;
    taskEXIT_CRITICAL(&s_radio.lock);
    err = esp32_mquickjs_wifi_raw_tx_broker_submit(lease->generation, lease->identity,
        bytes, length, &policy, token, validation);
    if (token->identity != 0U) {
        taskENTER_CRITICAL(&s_radio.lock);
        if (owner->raw_tx_identity == 0U) owner->raw_tx_identity = token->identity;
        taskEXIT_CRITICAL(&s_radio.lock);
        *actual_channel = actual;
    } else if (owner->raw_tx_identity == 0U) wifi_radio_raw_tx_unpin(owner);
done:
    wifi_radio_operation_unlock();
    return err;
}

