99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
bool esp32_mquickjs_wifi_radio_raw_tx_retire(
    const esp32_mquickjs_wifi_radio_lease_t *lease, esp32_mquickjs_wifi_raw_tx_token_t *token)
{
    if (token == NULL) return false;
    wifi_radio_operation_lock();
    bool retired = false;
    if (!wifi_radio_lease_valid(lease) || lease->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_RAW_TX ||
        token->generation != lease->generation || token->radio_lease_identity != lease->identity) goto done;
    wifi_radio_live_lease_t *owner = wifi_radio_promiscuous_owner(lease->identity);
    if (owner == NULL || owner->raw_tx_identity == 0U) goto done;
    if (wifi_radio_raw_tx_recovery_exact_locked(&s_radio.lifecycle) &&
        token->identity == s_raw_tx_recovery.operation.identity &&
        token->generation == s_raw_tx_recovery.operation.generation &&
        token->radio_lease_identity == s_raw_tx_recovery.operation.radio_lease_identity) {
        esp32_mquickjs_wifi_raw_tx_broker_status_t native;
        (void)esp32_mquickjs_wifi_raw_tx_broker_result(token, &native);
        if (!native.native_terminated) goto done;
    }
    retired = esp32_mquickjs_wifi_raw_tx_broker_retire(token);
    if (retired) {
        uint32_t remaining = esp32_mquickjs_wifi_raw_tx_broker_owner_identity(lease->identity);
        if (remaining == 0U) wifi_radio_raw_tx_unpin(owner);
        else {
            taskENTER_CRITICAL(&s_radio.lock);
            owner->raw_tx_identity = remaining;
            taskEXIT_CRITICAL(&s_radio.lock);
        }
    }
done:
    wifi_radio_operation_unlock();
    return retired;
}
static bool wifi_radio_raw_tx_recovery_exact_locked(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    return token != NULL && token->identity != 0U && token->identity == s_raw_tx_recovery.lifecycle.identity &&
        token->generation == s_raw_tx_recovery.lifecycle.generation && token->identity == s_radio.lifecycle.identity &&
        token->generation == s_radio.lifecycle.generation;
}

static bool wifi_radio_raw_tx_recovery_owner_locked(const esp32_mquickjs_wifi_radio_lease_t *lease)
{
    if (!wifi_radio_raw_tx_recovery_exact_locked(&s_radio.lifecycle) || !wifi_radio_lease_valid(lease) ||
        lease->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_RAW_TX ||
        lease->identity != s_raw_tx_recovery.operation.radio_lease_identity ||
        lease->generation != s_raw_tx_recovery.operation.generation) return false;
    wifi_radio_live_lease_t *owner = wifi_radio_promiscuous_owner(lease->identity);
    if (owner == NULL) return false;
    /* Physical termination covers every record for this exact lease/generation.
     * Its representative identity may advance as a Session retires its window. */
    if (!s_radio.driver_owned) return s_raw_tx_recovery.stopped && s_raw_tx_recovery.sdk_fenced;
    if (owner->raw_tx_identity != s_raw_tx_recovery.operation.identity) return false;
    esp32_mquickjs_wifi_raw_tx_broker_status_t native;
    esp32_mquickjs_wifi_raw_tx_broker_status(&native);
    return owner->raw_tx_identity == s_raw_tx_recovery.operation.identity && native.operation_active &&
        native.submit_returned && !native.control_busy && !native.native_terminated &&
        native.token.generation == lease->generation && native.token.radio_lease_identity == lease->identity &&
        native.token.identity == s_raw_tx_recovery.operation.identity;
}

static uint32_t wifi_radio_raw_tx_recovery_capture_owner_locked(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (!wifi_radio_raw_tx_recovery_exact_locked(token)) return 0U;
    const esp32_mquickjs_wifi_radio_lease_t owner = {.generation = s_raw_tx_recovery.operation.generation,
        .identity = s_raw_tx_recovery.operation.radio_lease_identity,
        .client = ESP32_MQUICKJS_WIFI_RADIO_CLIENT_RAW_TX, .acquired = true};
    return wifi_radio_raw_tx_recovery_owner_locked(&owner) ? owner.identity : 0U;
}

esp_err_t esp32_mquickjs_wifi_radio_checkpoint_raw_tx_recovery(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    const char *stage = "raw-tx-recovery-checkpoint-admission";
    if (wifi_radio_raw_tx_recovery_capture_owner_locked(token) == 0U ||
        !s_radio.driver_owned || !s_radio.storage_configured || !s_radio.started || !s_radio.stop_required ||
        s_radio.stop_submitted || s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required ||
        mode != s_radio.effective_mode) goto done;
    stage = "raw-tx-recovery-policy-snapshot";
    err = wifi_radio_policy_restart_prepare_locked(token, mode);
    if (err != ESP_OK) goto done;
    err = wifi_radio_restart_configs_capture_locked(token, mode);
    if (err == ESP_OK) (void)wifi_radio_restart_configs_record("raw-tx-recovery-checkpoint-complete", ESP_OK, false);
    wifi_radio_operation_unlock();
    return err;
done:
    (void)wifi_radio_restart_configs_record(stage, err, false);
    wifi_radio_operation_unlock();
    return err;
}

bool esp32_mquickjs_wifi_radio_raw_tx_recovery_active(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    bool active = wifi_radio_raw_tx_recovery_exact_locked(token);
    wifi_radio_operation_unlock();
    return active;
}

esp_err_t esp32_mquickjs_wifi_radio_begin_raw_tx_recovery(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    const esp32_mquickjs_wifi_raw_tx_token_t *operation,
    esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t *mode)
{
    if (operation == NULL || operation->generation == 0U || operation->identity == 0U ||
        operation->radio_lease_identity == 0U || token == NULL || token->identity != 0U ||
        token->generation != 0U || mode == NULL) return ESP_ERR_INVALID_ARG;
    *mode = WIFI_MODE_NULL;
#if !CONFIG_IDF_TARGET_ESP32C3 && !CONFIG_IDF_TARGET_ESP32S3 && !CONFIG_IDF_TARGET_ESP32C5
    return ESP_ERR_NOT_SUPPORTED;
#endif
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    esp32_mquickjs_wifi_raw_tx_broker_status_t native;
    esp32_mquickjs_wifi_raw_tx_broker_status(&native);
    if (native.token.identity != operation->identity || native.token.generation != operation->generation ||
        native.token.radio_lease_identity != operation->radio_lease_identity || native.generation != s_radio.generation ||
        !native.operation_active || !native.submit_returned || native.control_busy || native.native_terminated ||
        s_radio.lifecycle.identity != 0U || s_radio.operation.identity != 0U || !s_radio.driver_owned ||
        !s_radio.storage_configured || !s_radio.started || !s_radio.stop_required || s_radio.stop_submitted ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED || s_radio.restart_required ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.wake_locks != 0U ||
        s_radio.promiscuous_claimed || s_interval.owner.identity != 0U || s_interval.restore_pending ||
        s_vendor_ie.start_owner.identity != 0U || s_config_restart.snapshot != NULL ||
        s_policy_restart.owner.identity != 0U) goto done;
    wifi_radio_live_lease_t *original = wifi_radio_promiscuous_owner(operation->radio_lease_identity);
    if (original == NULL || original->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_RAW_TX ||
        original->raw_tx_identity != operation->identity || operation->generation != s_radio.generation) goto done;
    if (s_tx_rate_lease.restore_pending) goto done;
    if (s_tx_rate_lease.identity != 0U) {
        unsigned index = s_tx_rate_lease.interface == WIFI_IF_STA ? 0U : 1U;
        const esp32_mquickjs_wifi_tx_rate_record_t *rate = &s_tx_rates.records[index];
        if (s_tx_rate_lease.identity != original->identity || s_tx_rate_lease.generation != operation->generation ||
            !rate->known || rate->uncertain || rate->generation != operation->generation ||
            rate->write_identity != s_tx_rate_lease.write_identity ||
            !esp32_mquickjs_wifi_tx_rate_valid(&s_tx_rate_lease.previous)) goto done;
    }
    if (s_radio.effective_mode != WIFI_MODE_STA && s_radio.effective_mode != WIFI_MODE_AP &&
        s_radio.effective_mode != WIFI_MODE_APSTA) goto done;
    const esp32_mquickjs_wifi_radio_lease_t *owners[] = {application, station, access_point};
    const esp32_mquickjs_wifi_radio_client_t clients[] = {ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION,
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA, ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP};
    uint32_t identities[3] = {0};
    for (size_t i = 0; i < 3; ++i) {
        if (owners[i] == NULL || !owners[i]->acquired) continue;
        if (!wifi_radio_lease_valid(owners[i]) || owners[i]->client != clients[i]) goto done;
        identities[i] = owners[i]->identity;
    }
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        const wifi_radio_live_lease_t *owner = &s_radio.leases[i];
        if (owner->identity == 0U) continue;
        if (owner->promiscuous_identity != 0U ||
            (owner->raw_tx_identity != 0U && owner->identity != original->identity) ||
            (owner->identity != original->identity && owner->identity != identities[0] &&
             owner->identity != identities[1] && owner->identity != identities[2])) goto done;
    }
    if (s_radio.next_lifecycle_identity == 0U) { err = ESP_ERR_NO_MEM; goto done; }
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.lifecycle = (esp32_mquickjs_wifi_radio_lifecycle_t){s_radio.generation, s_radio.next_lifecycle_identity++};
    s_raw_tx_recovery.lifecycle = s_radio.lifecycle;
    s_raw_tx_recovery.operation = *operation;
    s_raw_tx_recovery.stopped = s_raw_tx_recovery.sdk_fenced = false;
    *token = s_radio.lifecycle;
    *mode = s_radio.effective_mode;
    taskEXIT_CRITICAL(&s_radio.lock);
    err = ESP_OK;
done:
    wifi_radio_operation_unlock();
    return err;
}

static esp_err_t wifi_radio_raw_tx_recovery_phase(const esp32_mquickjs_wifi_radio_lifecycle_t *token, bool shutdown)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (wifi_radio_raw_tx_recovery_exact_locked(token)) {
        /* Identity-only validation reference. It grants no release authority;
         * only the original Future/Session owns the mutable lease storage. */
        const esp32_mquickjs_wifi_radio_lease_t owner = {.generation = s_raw_tx_recovery.operation.generation,
            .identity = s_raw_tx_recovery.operation.radio_lease_identity,
            .client = ESP32_MQUICKJS_WIFI_RADIO_CLIENT_RAW_TX, .acquired = true};
        const esp32_mquickjs_wifi_radio_lease_t *allowed = wifi_radio_lease_valid(&owner) ? &owner : NULL;
        err = shutdown ? wifi_radio_shutdown_lease_locked(allowed, false) : wifi_radio_stop_lease_locked(allowed, false);
    }
    wifi_radio_operation_unlock();
    return err;
}
esp_err_t esp32_mquickjs_wifi_radio_stop_raw_tx_recovery(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    return wifi_radio_raw_tx_recovery_phase(token, false);
}
esp_err_t esp32_mquickjs_wifi_radio_shutdown_raw_tx_recovery(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    return wifi_radio_raw_tx_recovery_phase(token, true);
}
esp_err_t esp32_mquickjs_wifi_radio_check_stopped_raw_tx_recovery(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_raw_tx_recovery_exact_locked(token) || !s_raw_tx_recovery.stopped || s_radio.started ||
        s_radio.stop_required || s_radio.stop_submitted || s_radio.event_phase != RADIO_EVENTS_IDLE ||
        s_radio.wake_locks != 0U || s_radio.promiscuous_claimed || s_radio.restart_required ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_CLEANUP_PENDING &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED)) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U && s_radio.leases[i].identity != s_raw_tx_recovery.operation.radio_lease_identity)
            goto done;
    err = ESP_OK;
done:
    wifi_radio_operation_unlock();
    return err;
}
esp_err_t esp32_mquickjs_wifi_radio_finish_raw_tx_recovery(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_raw_tx_recovery_exact_locked(token) || !s_raw_tx_recovery.stopped || !s_raw_tx_recovery.sdk_fenced ||
        s_radio.driver_owned || s_radio.started || s_radio.stop_required || s_radio.stop_submitted ||
        s_radio.event_phase != RADIO_EVENTS_IDLE || s_radio.operation.identity != 0U || s_radio.restart_required ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_tx_rate_lease.identity != 0U) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
    esp32_mquickjs_wifi_raw_tx_broker_status_t native;
    esp32_mquickjs_wifi_raw_tx_broker_status(&native);
    if (native.operation_active || native.native_terminated || native.token.identity != 0U) goto done;
    memset(&s_raw_tx_recovery, 0, sizeof(s_raw_tx_recovery));
    err = ESP_OK;
done:
    wifi_radio_operation_unlock();
    return err;
}

/* All SDK functions below execute under the Radio mutation mutex. */
static void wifi_radio_action_event(int32_t id, const void *data)
{
    if (data == NULL) return;
    taskENTER_CRITICAL(&s_radio.lock);
    bool recorded = false;
    if (id == WIFI_EVENT_ACTION_TX_STATUS) {
        const wifi_event_action_tx_status_t *event = data;
        recorded = esp32_mquickjs_wifi_action_observe(&s_action.lane, ESP32_MQUICKJS_WIFI_ACTION_SEND,
            event->context, (uint8_t)event->ifx, event->channel, event->op_id, (unsigned)event->status);
    } else if (id == WIFI_EVENT_ROC_DONE) {
        const wifi_event_roc_done_t *event = data;
        recorded = esp32_mquickjs_wifi_action_observe(&s_action.lane, ESP32_MQUICKJS_WIFI_ACTION_ROC,
            event->context, 0, event->channel, event->op_id, (unsigned)event->status);
    }
    if (recorded) s_action.fence_posted = false;
    taskEXIT_CRITICAL(&s_radio.lock);
}

static bool wifi_radio_action_exact_locked(const esp32_mquickjs_wifi_action_token_t *token)
{
    return token != NULL && token->identity != 0U && token->identity == s_action.lane.identity &&
        token->generation == s_action.lane.generation && token->generation == s_radio.generation &&
        wifi_radio_lease_valid(&s_action.lease) &&
        s_action.lease.client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_ACTION &&
        s_radio.operation.lease_identity == s_action.lease.identity &&
        s_radio.operation.generation == token->generation && s_radio.operation.identity != 0U &&
        s_radio.operation.kind == (s_action.lane.kind == ESP32_MQUICKJS_WIFI_ACTION_SEND ?
            ESP32_MQUICKJS_WIFI_RADIO_OPERATION_ACTION : ESP32_MQUICKJS_WIFI_RADIO_OPERATION_ROC);
}

esp_err_t esp32_mquickjs_wifi_radio_begin_recovery(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    const esp32_mquickjs_wifi_recovery_request_t *operation,
    esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t *mode)
{
    if (operation == NULL) return ESP_ERR_INVALID_ARG;
    switch (operation->kind) {
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    case ESP32_MQUICKJS_WIFI_RECOVERY_TWT:
        return wifi_radio_twt_recovery_begin(application, station, access_point, operation, token, mode);
#endif
    case ESP32_MQUICKJS_WIFI_RECOVERY_RAW_TX: {
        esp32_mquickjs_wifi_raw_tx_broker_status_t native;
        esp32_mquickjs_wifi_raw_tx_broker_status(&native);
        if (native.token.identity != operation->identity || native.token.generation != operation->generation)
            return ESP_ERR_INVALID_STATE;
        /* The caller names the broker operation, not a release authority. The
         * native begin revalidates this complete token under the Radio mutex. */
        return esp32_mquickjs_wifi_radio_begin_raw_tx_recovery(application, station, access_point, &native.token, token, mode);
    }
    case ESP32_MQUICKJS_WIFI_RECOVERY_ACTION: {
        const esp32_mquickjs_wifi_action_token_t identity = {operation->generation, operation->identity};
        return esp32_mquickjs_wifi_radio_begin_action_recovery(application, station, access_point, &identity, token, mode);
    }
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    case ESP32_MQUICKJS_WIFI_RECOVERY_FTM: {
        const esp32_mquickjs_wifi_ftm_token_t identity = {operation->generation, operation->identity};
        return esp32_mquickjs_wifi_radio_begin_ftm_recovery(application, station, access_point, &identity, token, mode);
    }
#endif
    default:
        return ESP_ERR_INVALID_ARG;
    }
}

esp_err_t esp32_mquickjs_wifi_radio_prepare_recovery(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    if (wifi_radio_twt_recovery_active(token)) return wifi_radio_twt_recovery_prepare(token);
#endif
    return esp32_mquickjs_wifi_radio_recovery_active(token) ? ESP_OK : ESP_ERR_INVALID_STATE;
}

bool esp32_mquickjs_wifi_radio_recovery_active(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    if (wifi_radio_twt_recovery_active(token)) return true;
#endif
    if (esp32_mquickjs_wifi_radio_raw_tx_recovery_active(token)) return true;
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    if (esp32_mquickjs_wifi_radio_ftm_recovery_active(token)) return true;
#endif
    return esp32_mquickjs_wifi_radio_action_recovery_active(token);
}

esp_err_t esp32_mquickjs_wifi_radio_checkpoint_recovery(const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    if (wifi_radio_twt_recovery_active(token)) return wifi_radio_twt_recovery_checkpoint(token, mode);
#endif
    if (esp32_mquickjs_wifi_radio_raw_tx_recovery_active(token))
        return esp32_mquickjs_wifi_radio_checkpoint_raw_tx_recovery(token, mode);
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    if (esp32_mquickjs_wifi_radio_ftm_recovery_active(token))
        return esp32_mquickjs_wifi_radio_checkpoint_ftm_recovery(token, mode);
#endif
    return esp32_mquickjs_wifi_radio_checkpoint_action_recovery(token, mode);
}

esp_err_t esp32_mquickjs_wifi_radio_stop_recovery(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    if (wifi_radio_twt_recovery_active(token)) return wifi_radio_twt_recovery_phase(token, false);
#endif
    if (esp32_mquickjs_wifi_radio_raw_tx_recovery_active(token))
        return esp32_mquickjs_wifi_radio_stop_raw_tx_recovery(token);
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    if (esp32_mquickjs_wifi_radio_ftm_recovery_active(token))
        return esp32_mquickjs_wifi_radio_stop_ftm_recovery(token);
#endif
    return esp32_mquickjs_wifi_radio_stop_action_recovery(token);
}

esp_err_t esp32_mquickjs_wifi_radio_check_stopped_recovery(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    if (wifi_radio_twt_recovery_active(token)) return wifi_radio_twt_recovery_stopped(token);
#endif
    if (esp32_mquickjs_wifi_radio_raw_tx_recovery_active(token))
        return esp32_mquickjs_wifi_radio_check_stopped_raw_tx_recovery(token);
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    if (esp32_mquickjs_wifi_radio_ftm_recovery_active(token))
        return esp32_mquickjs_wifi_radio_check_stopped_ftm_recovery(token);
#endif
    return esp32_mquickjs_wifi_radio_check_stopped_action_recovery(token);
}

esp_err_t esp32_mquickjs_wifi_radio_shutdown_recovery(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    if (wifi_radio_twt_recovery_active(token)) return wifi_radio_twt_recovery_phase(token, true);
#endif
    if (esp32_mquickjs_wifi_radio_raw_tx_recovery_active(token))
        return esp32_mquickjs_wifi_radio_shutdown_raw_tx_recovery(token);
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    if (esp32_mquickjs_wifi_radio_ftm_recovery_active(token))
        return esp32_mquickjs_wifi_radio_shutdown_ftm_recovery(token);
#endif
    return esp32_mquickjs_wifi_radio_shutdown_action_recovery(token);
}

esp_err_t esp32_mquickjs_wifi_radio_finish_recovery(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    if (wifi_radio_twt_recovery_active(token)) return wifi_radio_twt_recovery_finish(token);
#endif
    if (esp32_mquickjs_wifi_radio_raw_tx_recovery_active(token))
        return esp32_mquickjs_wifi_radio_finish_raw_tx_recovery(token);
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    if (esp32_mquickjs_wifi_radio_ftm_recovery_active(token))
        return esp32_mquickjs_wifi_radio_finish_ftm_recovery(token);
#endif
    return esp32_mquickjs_wifi_radio_finish_action_recovery(token);
}

static bool wifi_radio_action_recovery_exact_locked(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    return token != NULL && token->identity != 0U &&
        token->identity == s_action.recovery.identity && token->generation == s_action.recovery.generation &&
        token->identity == s_radio.lifecycle.identity && token->generation == s_radio.lifecycle.generation;
}

bool esp32_mquickjs_wifi_radio_action_recovery_active(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    bool active = wifi_radio_action_recovery_exact_locked(token);
    wifi_radio_operation_unlock();
    return active;
}

