99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_check_stopped_action_recovery(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_action_recovery_exact_locked(token) || s_radio.started || s_radio.stop_required ||
        s_radio.stop_submitted || s_radio.event_phase != RADIO_EVENTS_IDLE || s_radio.wake_locks != 0U ||
        s_radio.promiscuous_claimed || s_radio.restart_required ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_CLEANUP_PENDING &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED)) goto done;
    uint32_t allowed = 0;
    if (s_action.lease.acquired || s_radio.operation.identity != 0U) {
        esp32_mquickjs_wifi_action_token_t operation = {s_action.lane.generation, s_action.lane.identity};
        if (!wifi_radio_action_exact_locked(&operation) || !s_action.lane.submitted ||
            s_action.lane.dispatching || s_action.lane.cancel_busy) goto done;
        allowed = s_action.lease.identity;
    }
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U && s_radio.leases[i].identity != allowed) goto done;
    err = ESP_OK;
done:
    wifi_radio_operation_unlock();
    return err;
}

static uint32_t wifi_radio_action_recovery_capture_owner_locked(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    esp32_mquickjs_wifi_action_token_t operation = {s_action.lane.generation, s_action.lane.identity};
    return wifi_radio_action_recovery_exact_locked(token) && wifi_radio_action_exact_locked(&operation) &&
        s_action.lane.submitted && !s_action.lane.dispatching && !s_action.lane.cancel_busy &&
        !s_action.lane.physical_termination ? s_action.lease.identity : 0U;
}

esp_err_t esp32_mquickjs_wifi_radio_checkpoint_action_recovery(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    const char *stage = "recovery-checkpoint-admission";
    if (!wifi_radio_action_recovery_exact_locked(token) || token->generation != s_radio.generation ||
        !s_radio.driver_owned || !s_radio.storage_configured || !s_radio.started || !s_radio.stop_required ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED || s_radio.fault_stage != NULL ||
        s_radio.cleanup_stage != NULL || mode != s_radio.effective_mode) goto done;
    stage = "recovery-policy-snapshot";
    err = wifi_radio_policy_restart_prepare_locked(token, mode);
    if (err != ESP_OK) goto done;
    /* Capture owns its exact diagnostic and wipes failed secret allocations.
     * No STOP/START or owner publication occurs in this checkpoint phase. */
    err = wifi_radio_restart_configs_capture_locked(token, mode);
    if (err == ESP_OK) (void)wifi_radio_restart_configs_record("recovery-checkpoint-complete", ESP_OK, false);
    wifi_radio_operation_unlock();
    return err;
done:
    (void)wifi_radio_restart_configs_record(stage, err, false);
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_begin_action_recovery(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    const esp32_mquickjs_wifi_action_token_t *operation,
    esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t *mode)
{
    if (token == NULL || token->identity != 0U || token->generation != 0U || mode == NULL ||
        operation == NULL || operation->identity == 0U || operation->generation == 0U) return ESP_ERR_INVALID_ARG;
    *mode = WIFI_MODE_NULL;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_action_exact_locked(operation) || !s_action.lane.submitted ||
        s_action.lane.dispatching || s_action.lane.cancel_busy || s_action.lane.physical_termination ||
        s_radio.lifecycle.identity != 0U ||
        !s_radio.driver_owned || s_radio.restart_required || s_radio.wake_locks != 0U || s_radio.promiscuous_claimed ||
        s_tx_rate_lease.identity != 0U || s_tx_rate_lease.restore_pending ||
        s_interval.owner.identity != 0U || s_interval.restore_pending || s_vendor_ie.start_owner.identity != 0U ||
        s_config_restart.snapshot != NULL || s_policy_restart.owner.identity != 0U) goto done;
    if (s_radio.effective_mode != WIFI_MODE_STA && s_radio.effective_mode != WIFI_MODE_AP &&
        s_radio.effective_mode != WIFI_MODE_APSTA) goto done;
    const esp32_mquickjs_wifi_radio_lease_t *owners[3] = {application, station, access_point};
    const esp32_mquickjs_wifi_radio_client_t clients[3] = {
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION,
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA,
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP,
    };
    uint32_t identities[3] = {0};
    for (size_t i = 0; i < 3; ++i) {
        if (owners[i] == NULL || !owners[i]->acquired) continue;
        if (!wifi_radio_lease_valid(owners[i]) || owners[i]->client != clients[i]) goto done;
        identities[i] = owners[i]->identity;
    }
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        const wifi_radio_live_lease_t *owner = &s_radio.leases[i];
        if (owner->identity == 0U) continue;
        if (owner->promiscuous_identity != 0U || owner->raw_tx_identity != 0U ||
            (owner->identity != s_action.lease.identity && owner->identity != identities[0] &&
             owner->identity != identities[1] && owner->identity != identities[2])) goto done;
    }
    if (s_radio.next_lifecycle_identity == 0U) { err = ESP_ERR_NO_MEM; goto done; }
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.lifecycle = (esp32_mquickjs_wifi_radio_lifecycle_t){s_radio.generation, s_radio.next_lifecycle_identity++};
    s_action.recovery = s_radio.lifecycle;
    *token = s_radio.lifecycle;
    *mode = s_radio.effective_mode;
    taskEXIT_CRITICAL(&s_radio.lock);
    err = ESP_OK;
done:
    wifi_radio_operation_unlock();
    return err;
}

