99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
/* Caller retires managed Wi-Fi leases and helper resources between these two
 * phases. The Action/ROC owner is never handed to the coordinator for release. */
static esp_err_t wifi_radio_action_recovery_phase(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token, bool shutdown)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (wifi_radio_action_recovery_exact_locked(token)) {
        const esp32_mquickjs_wifi_radio_lease_t *allowed = s_action.lease.acquired ? &s_action.lease : NULL;
        err = shutdown ? wifi_radio_shutdown_lease_locked(allowed, false) : wifi_radio_stop_lease_locked(allowed, false);
    }
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_stop_action_recovery(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    return wifi_radio_action_recovery_phase(token, false);
}

esp_err_t esp32_mquickjs_wifi_radio_shutdown_action_recovery(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    return wifi_radio_action_recovery_phase(token, true);
}

esp_err_t esp32_mquickjs_wifi_radio_finish_action_recovery(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_action_recovery_exact_locked(token) || s_radio.driver_owned ||
        s_radio.started || s_radio.stop_required || s_radio.stop_submitted ||
        s_radio.event_phase != RADIO_EVENTS_IDLE || s_radio.operation.identity != 0U ||
        s_action.lease.acquired || s_radio.wake_locks != 0U || s_radio.promiscuous_claimed ||
        s_radio.restart_required || s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
    /* Preserve s_radio.lifecycle and both frozen configuration records. */
    memset(&s_action.recovery, 0, sizeof(s_action.recovery));
    err = ESP_OK;
done:
    wifi_radio_operation_unlock();
    return err;
}

static bool wifi_radio_action_parameters(wifi_interface_t interface, uint8_t channel,
    wifi_second_chan_t secondary, uint32_t duration)
{
    return (interface == WIFI_IF_STA || interface == WIFI_IF_AP) && channel != 0U &&
        (secondary == WIFI_SECOND_CHAN_NONE || secondary == WIFI_SECOND_CHAN_ABOVE || secondary == WIFI_SECOND_CHAN_BELOW) &&
        duration >= 1U && duration <= 60000U;
}

static esp_err_t wifi_radio_action_admit_locked(esp32_mquickjs_wifi_action_kind_t kind,
    wifi_interface_t interface, uint8_t channel, wifi_second_chan_t secondary,
    bool allow_broadcast, esp32_mquickjs_wifi_action_token_t *token)
{
    if (!s_radio.driver_owned || !s_radio.storage_configured || !s_radio.started ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED || s_radio.lifecycle.identity != 0U ||
        s_radio.operation.identity != 0U || s_radio.restart_required || s_radio.cleanup_stage != NULL ||
        s_action.lane.identity != 0U) return ESP_ERR_INVALID_STATE;
    if (s_radio.fault_stage != NULL) return s_radio.fault_error;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (interface == WIFI_IF_AP) return ESP_ERR_NOT_SUPPORTED;
#endif
    if (s_radio.next_operation_identity == 0U) return ESP_ERR_NO_MEM;
    wifi_mode_t mode;
    esp_err_t err = esp_wifi_get_mode(&mode);
    if (err != ESP_OK) return err;
    wifi_mode_t required = interface == WIFI_IF_STA ? WIFI_MODE_STA : WIFI_MODE_AP;
    if (mode != s_radio.effective_mode || (mode & required) != required ||
        (allow_broadcast && mode == WIFI_MODE_APSTA)) return ESP_ERR_INVALID_STATE;
    err = wifi_radio_validate_regulatory_channel(channel);
    if (err != ESP_OK) return err;
    if (secondary != WIFI_SECOND_CHAN_NONE) {
        int adjacent = channel + (secondary == WIFI_SECOND_CHAN_ABOVE ? 4 : -4);
        if (adjacent < 1 || adjacent > 177 || channel == 14 || adjacent == 14 ||
            ((channel <= 14) != (adjacent <= 14))) return ESP_ERR_INVALID_ARG;
        err = wifi_radio_validate_regulatory_channel((uint8_t)adjacent);
        if (err != ESP_OK) return err;
    }
    uint8_t current;
    wifi_second_chan_t current_secondary;
    uint32_t generation;
    err = wifi_radio_get_channel_locked(&current, &current_secondary, &generation);
    if (err != ESP_OK) return err;
    bool off_channel = current != channel || current_secondary != secondary;
    if (off_channel) {
        /* Default v1 never moves an active AP or associated Station away from
         * home. Disconnected STA may use native off-channel scheduling only
         * when no other RF session depends on the current channel. */
        if (mode & WIFI_MODE_AP) return ESP_ERR_INVALID_STATE;
        wifi_ap_record_t ap;
        err = esp_wifi_sta_get_ap_info(&ap);
        if (err == ESP_OK) return ESP_ERR_INVALID_STATE;
        if (err != ESP_ERR_WIFI_NOT_CONNECT) return err;
    }
    bool conflict = false;
    taskENTER_CRITICAL(&s_radio.lock);
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        const wifi_radio_live_lease_t *owner = &s_radio.leases[i];
        if (owner->identity == 0U) continue;
        if (owner->raw_tx_identity != 0U || owner->channel_conflict ||
            (owner->fixed_channel && (owner->primary_channel != channel || owner->secondary_channel != (uint8_t)secondary)))
            conflict = true;
        if (off_channel && owner->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION &&
            owner->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA &&
            owner->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_VENDOR_IE) conflict = true;
    }
    taskEXIT_CRITICAL(&s_radio.lock);
    if (conflict) return ESP_ERR_INVALID_STATE;
    err = wifi_radio_acquire_locked(ESP32_MQUICKJS_WIFI_RADIO_CLIENT_ACTION, required, &s_action.lease);
    if (err != ESP_OK) return err;
    taskENTER_CRITICAL(&s_radio.lock);
    err = esp32_mquickjs_wifi_action_reserve(&s_action.lane, s_radio.generation, kind,
        (uint32_t)(uintptr_t)esp32_mquickjs_wifi_action_receive, (uint8_t)interface, channel, token);
    if (err == ESP_OK) {
        s_action.secondary = secondary;
        s_action.fence_posted = false;
        s_action.posted_revision = 0;
        s_radio.operation = (esp32_mquickjs_wifi_radio_operation_t){
            .generation = s_radio.generation, .lease_identity = s_action.lease.identity,
            .identity = s_radio.next_operation_identity++,
            .kind = kind == ESP32_MQUICKJS_WIFI_ACTION_SEND ? ESP32_MQUICKJS_WIFI_RADIO_OPERATION_ACTION : ESP32_MQUICKJS_WIFI_RADIO_OPERATION_ROC,
        };
    }
    taskEXIT_CRITICAL(&s_radio.lock);
    if (err != ESP_OK) wifi_radio_release_locked(&s_action.lease);
    return err;
}

