99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_action_send(wifi_action_tx_req_t *request,
    size_t request_bytes, esp32_mquickjs_wifi_action_token_t *token)
{
    if (request == NULL || request_bytes < sizeof(*request) || token == NULL || token->identity != 0U || token->generation != 0U ||
        !wifi_radio_action_parameters(request->ifx, request->channel, request->sec_channel, request->wait_time_ms) ||
        request->type != WIFI_OFFCHAN_TX_REQ || request->rx_cb != esp32_mquickjs_wifi_action_receive || request->op_id != 0U ||
        request->data_len == 0U || request->data_len > 1476U || request_bytes - sizeof(*request) != request->data_len)
        return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_action_admit_locked(ESP32_MQUICKJS_WIFI_ACTION_SEND,
        request->ifx, request->channel, request->sec_channel, false, token);
    if (err == ESP_OK) {
        taskENTER_CRITICAL(&s_radio.lock);
        bool begun = esp32_mquickjs_wifi_action_begin_submit(&s_action.lane, token);
        taskEXIT_CRITICAL(&s_radio.lock);
        if (!begun) err = ESP_ERR_INVALID_STATE;
        else {
            err = esp_wifi_action_tx_req(request);
            taskENTER_CRITICAL(&s_radio.lock);
            (void)esp32_mquickjs_wifi_action_submitted(&s_action.lane, token, err, request->op_id);
            taskEXIT_CRITICAL(&s_radio.lock);
        }
    }
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_action_roc(wifi_roc_req_t *request,
    esp32_mquickjs_wifi_action_token_t *token)
{
    if (request == NULL || token == NULL || token->identity != 0U || token->generation != 0U ||
        !wifi_radio_action_parameters(request->ifx, request->channel, request->sec_channel, request->wait_time_ms) ||
        request->type != WIFI_ROC_REQ || request->rx_cb != esp32_mquickjs_wifi_action_receive || request->done_cb != NULL || request->op_id != 0U)
        return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_action_admit_locked(ESP32_MQUICKJS_WIFI_ACTION_ROC,
        request->ifx, request->channel, request->sec_channel, request->allow_broadcast, token);
    if (err == ESP_OK) {
        taskENTER_CRITICAL(&s_radio.lock);
        bool begun = esp32_mquickjs_wifi_action_begin_submit(&s_action.lane, token);
        taskEXIT_CRITICAL(&s_radio.lock);
        if (!begun) err = ESP_ERR_INVALID_STATE;
        else {
            err = esp_wifi_remain_on_channel(request);
            taskENTER_CRITICAL(&s_radio.lock);
            (void)esp32_mquickjs_wifi_action_submitted(&s_action.lane, token, err, request->op_id);
            taskEXIT_CRITICAL(&s_radio.lock);
        }
    }
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_action_cancel(const esp32_mquickjs_wifi_action_token_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_action_exact_locked(token)) goto done;
    esp32_mquickjs_wifi_action_lane_t state;
    taskENTER_CRITICAL(&s_radio.lock);
    (void)esp32_mquickjs_wifi_action_request_cancel(&s_action.lane, token);
    bool submit = esp32_mquickjs_wifi_action_begin_cancel(&s_action.lane, token);
    state = s_action.lane;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (!submit) { err = state.terminal || state.sdk_quiescent || state.physical_termination || state.cancel_written || !state.submitted ? ESP_OK : ESP_ERR_INVALID_STATE; goto done; }
    if (state.kind == ESP32_MQUICKJS_WIFI_ACTION_SEND) {
        wifi_action_tx_req_t request = {.ifx = (wifi_interface_t)state.interface, .type = WIFI_OFFCHAN_TX_CANCEL,
            .channel = state.channel, .sec_channel = s_action.secondary, .op_id = state.operation_id,
            .rx_cb = esp32_mquickjs_wifi_action_receive};
        err = esp_wifi_action_tx_req(&request);
    } else {
        wifi_roc_req_t request = {.ifx = (wifi_interface_t)state.interface, .type = WIFI_ROC_CANCEL,
            .channel = state.channel, .sec_channel = s_action.secondary, .op_id = state.operation_id,
            .rx_cb = esp32_mquickjs_wifi_action_receive};
        err = esp_wifi_remain_on_channel(&request);
    }
    taskENTER_CRITICAL(&s_radio.lock);
    (void)esp32_mquickjs_wifi_action_cancelled(&s_action.lane, token, err);
    taskEXIT_CRITICAL(&s_radio.lock);
done:
    wifi_radio_operation_unlock();
    return err;
}

void esp32_mquickjs_wifi_radio_action_snapshot(esp32_mquickjs_wifi_action_lane_t *out)
{
    if (out == NULL) return;
    taskENTER_CRITICAL(&s_radio.lock);
    *out = s_action.lane;
    taskEXIT_CRITICAL(&s_radio.lock);
}

bool esp32_mquickjs_wifi_radio_action_status(const esp32_mquickjs_wifi_action_token_t *token,
    esp32_mquickjs_wifi_action_lane_t *out)
{
    if (out == NULL) return false;
    taskENTER_CRITICAL(&s_radio.lock);
    bool ok = token != NULL && token->identity != 0U && s_action.lane.identity == token->identity &&
        s_action.lane.generation == token->generation;
    if (ok) *out = s_action.lane;
    taskEXIT_CRITICAL(&s_radio.lock);
    return ok;
}

esp_err_t esp32_mquickjs_wifi_radio_action_retire(esp32_mquickjs_wifi_action_token_t *token,
    esp32_mquickjs_wifi_action_lane_t *out)
{
    if (out == NULL) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_action_exact_locked(token)) goto done;
    uint32_t revision = 0;
    taskENTER_CRITICAL(&s_radio.lock);
    bool ready = esp32_mquickjs_wifi_action_fence_revision(&s_action.lane, token, &revision);
    *out = s_action.lane;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (!ready && out->submitted && !out->physical_termination) {
        /* Missing or ambiguous event status is not a guessed terminal. The
         * reviewed SDK task can independently attest complete native retirement;
         * retain owner until the following exact default-loop marker drains. */
        revision = out->revision;
        err = esp32_mquickjs_wifi_action_sdk_quiescent();
        if (err != ESP_OK) goto done;
        taskENTER_CRITICAL(&s_radio.lock);
        ready = esp32_mquickjs_wifi_action_quiescent(&s_action.lane, token, revision);
        *out = s_action.lane;
        taskEXIT_CRITICAL(&s_radio.lock);
        if (!ready) { err = ESP_ERR_TIMEOUT; goto done; }
    }
    if (out->submitted && !out->physical_termination && !out->sdk_fenced) {
        err = esp32_mquickjs_wifi_action_sdk_fence();
        if (err != ESP_OK) goto done;
        taskENTER_CRITICAL(&s_radio.lock);
        ready = esp32_mquickjs_wifi_action_sdk_fenced(&s_action.lane, token, revision);
        taskEXIT_CRITICAL(&s_radio.lock);
        if (!ready) { err = ESP_ERR_TIMEOUT; goto done; }
    }
    taskENTER_CRITICAL(&s_radio.lock);
    *out = s_action.lane;
    bool post = out->submitted && !out->physical_termination && out->sdk_fenced && !out->event_fenced && !s_action.fence_posted;
    wifi_radio_action_fence_t fence = {.token = *token, .revision = out->revision};
    if (post) { s_action.fence_posted = true; s_action.posted_revision = fence.revision; }
    taskEXIT_CRITICAL(&s_radio.lock);
    if (post) {
        err = esp_event_post(ESP32QJS_WIFI_RADIO_CONTROL_EVENT, 2, &fence, sizeof(fence), 0);
        if (err != ESP_OK) {
            taskENTER_CRITICAL(&s_radio.lock);
            if (s_action.posted_revision == fence.revision) s_action.fence_posted = false;
            taskEXIT_CRITICAL(&s_radio.lock);
            goto done;
        }
    }
    taskENTER_CRITICAL(&s_radio.lock);
    *out = s_action.lane;
    bool released = esp32_mquickjs_wifi_action_release(&s_action.lane, token);
    if (released) {
        memset(&s_radio.operation, 0, sizeof(s_radio.operation));
        s_action.fence_posted = false;
    }
    taskEXIT_CRITICAL(&s_radio.lock);
    if (released) { wifi_radio_release_locked(&s_action.lease); err = ESP_OK; }
    else err = ESP_ERR_TIMEOUT;
done:
    wifi_radio_operation_unlock();
    return err;
}

#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
esp_err_t esp32_mquickjs_wifi_radio_twt_control(
    const esp32_mquickjs_wifi_radio_lease_t *application, const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    esp32_mquickjs_wifi_twt_control_kind_t kind, esp32_mquickjs_wifi_twt_control_t *value,
    uint32_t *generation, esp32_mquickjs_wifi_radio_config_result_t *result)
{
    if (!result) return ESP_ERR_INVALID_ARG;
    *result = (esp32_mquickjs_wifi_radio_config_result_t){.stage = "twt-control-admission", .error = ESP_ERR_INVALID_ARG};
    if (!value || !generation || (unsigned)kind > ESP32_MQUICKJS_WIFI_TWT_WRITE_OFFSET ||
        (kind == ESP32_MQUICKJS_WIFI_TWT_WRITE_OFFSET && value->offset_us > 102400)) return ESP_ERR_INVALID_ARG;
    *generation = 0;
    bool write = kind == ESP32_MQUICKJS_WIFI_TWT_WRITE_CONFIG || kind == ESP32_MQUICKJS_WIFI_TWT_WRITE_OFFSET;
    bool associated = kind == ESP32_MQUICKJS_WIFI_TWT_WRITE_OFFSET || kind == ESP32_MQUICKJS_WIFI_TWT_READ_FLOWS;
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned) { error = ESP_ERR_WIFI_NOT_INIT; goto done; }
    if (!s_radio.storage_configured || s_radio.lifecycle.identity || s_radio.operation.identity ||
        s_radio.restart_required || s_radio.fault_stage || s_radio.cleanup_stage || s_twt_policy.pending ||
        !(s_radio.effective_mode & WIFI_MODE_STA) ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED)) goto done;
    if (associated && !s_radio.started) { error = ESP_ERR_WIFI_NOT_STARTED; goto done; }
    if (write) {
        /* Shared TWT policy may affect existing managed Agreements. Validate
         * helper identities, then admit only their leases and exact TWT owners. */
        error = wifi_radio_connection_owner_locked(application, station, access_point, WIFI_IF_STA, true);
        if (error != ESP_OK) goto done;
        if (s_radio.wake_locks || s_radio.promiscuous_claimed || s_tx_rate_lease.identity) {
            error = ESP_ERR_INVALID_STATE; goto done;
        }
        for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
            const wifi_radio_live_lease_t *owner = &s_radio.leases[i];
            if (!owner->identity || (application && application->acquired && owner->identity == application->identity) ||
                (station && station->acquired && owner->identity == station->identity) ||
                (access_point && access_point->acquired && owner->identity == access_point->identity)) continue;
            esp32_mquickjs_wifi_radio_lease_t lease = {s_radio.generation, owner->identity, owner->client, true};
            if (!wifi_radio_lease_valid(&lease) ||
                (!wifi_radio_twt_individual_lease_retained(&lease) && !wifi_radio_twt_broadcast_lease_retained(&lease))) {
                error = ESP_ERR_INVALID_STATE; goto done;
            }
        }
    }
    result->stage = kind == ESP32_MQUICKJS_WIFI_TWT_READ_CONFIG ? "twt-policy-read" :
        kind == ESP32_MQUICKJS_WIFI_TWT_WRITE_CONFIG ? "twt-policy-write" :
        kind == ESP32_MQUICKJS_WIFI_TWT_READ_FLOWS ? "twt-flows-read" : "twt-offset-write";
    result->mutation_attempted = write;
    error = esp32_mquickjs_wifi_twt_sdk_control(kind, value);
    if (error == ESP_OK) {
        *generation = s_radio.generation;
        if (kind == ESP32_MQUICKJS_WIFI_TWT_WRITE_CONFIG) {
            s_twt_policy.value = value->config; s_twt_policy.known = true;
        }
        result->stage = "complete";
    } else if (write && error != ESP_ERR_WIFI_NOT_ASSOC && error != ESP_ERR_INVALID_ARG) {
        /* No blind rollback of shared policy or an association's scalar. */
        (void)wifi_radio_record_fault(result->stage, error);
    }
done:
    result->error = error;
    if (write) {
        taskENTER_CRITICAL(&s_radio.lock); s_radio.configuration = *result; taskEXIT_CRITICAL(&s_radio.lock);
    }
    wifi_radio_operation_unlock();
    return error;
}

