99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_twt_broadcast_snapshot(
    esp32_mquickjs_wifi_twt_broadcast_snapshot_t *output, uint32_t *generation)
{
    if (output == NULL || generation == NULL) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned || !s_radio.storage_configured || !s_radio.started ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED || s_radio.lifecycle.identity != 0U ||
        s_radio.restart_required || s_radio.cleanup_stage != NULL) goto done;
    if (s_radio.fault_stage != NULL) { error = s_radio.fault_error; goto done; }
    wifi_mode_t mode;
    error = esp_wifi_get_mode(&mode);
    if (error != ESP_OK) goto done;
    if (mode != s_radio.effective_mode || !(mode & WIFI_MODE_STA)) { error = ESP_ERR_INVALID_STATE; goto done; }
    error = esp32_mquickjs_wifi_twt_sdk_broadcast_snapshot(output);
    if (error == ESP_OK) *generation = s_radio.generation;
done:
    wifi_radio_operation_unlock();
    return error;
}
static wifi_radio_twt_individual_t *wifi_radio_twt_individual_find(const esp32_mquickjs_wifi_twt_token_t *token)
{
    if (token == NULL || token->identity == 0U || token->generation == 0U || s_twt_individual == NULL) return NULL;
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_TWT_MAX_INDIVIDUAL; ++i) {
        wifi_radio_twt_individual_t *owner = &s_twt_individual[i];
        if (owner->token.identity == token->identity && owner->token.generation == token->generation) return owner;
    }
    return NULL;
}
esp_err_t esp32_mquickjs_wifi_radio_twt_individual_submit(
    const esp32_mquickjs_wifi_itwt_options_t *options, esp32_mquickjs_wifi_twt_token_t *token)
{
    if (token == NULL || token->identity != 0U || token->generation != 0U ||
        !esp32_mquickjs_wifi_itwt_options_valid(options)) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned || !s_radio.storage_configured || !s_radio.started ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED || s_radio.lifecycle.identity != 0U ||
        s_radio.operation.identity != 0U || s_radio.restart_required || s_radio.cleanup_stage != NULL) goto done;
    if (s_radio.fault_stage != NULL) { error = s_radio.fault_error; goto done; }
    if (s_twt_identity.next_identity == 0U) { error = ESP_ERR_NO_MEM; goto done; }
    wifi_mode_t mode;
    error = esp_wifi_get_mode(&mode);
    if (error != ESP_OK) goto done;
    if (mode != s_radio.effective_mode || !(mode & WIFI_MODE_STA)) { error = ESP_ERR_INVALID_STATE; goto done; }
    wifi_ap_record_t ap;
    error = esp_wifi_sta_get_ap_info(&ap);
    if (error != ESP_OK) goto done;
    uint8_t channel;
    wifi_second_chan_t secondary;
    uint32_t generation;
    error = wifi_radio_get_channel_locked(&channel, &secondary, &generation);
    if (error != ESP_OK) goto done;
    bool conflict = false;
    taskENTER_CRITICAL(&s_radio.lock);
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        const wifi_radio_live_lease_t *live = &s_radio.leases[i];
        if (live->identity != 0U && (live->raw_tx_identity != 0U || live->channel_conflict ||
            (live->fixed_channel && (live->primary_channel != channel || live->secondary_channel != (uint8_t)secondary))))
            conflict = true;
    }
    taskEXIT_CRITICAL(&s_radio.lock);
    if (conflict) { error = ESP_ERR_INVALID_STATE; goto done; }
    /* Foreign native calls consume the same request-ID prefix. Resynchronise
     * before reserving; the native result ledger still rechecks on submit. */
    esp32_mquickjs_wifi_twt_setup_results_snapshot_t results;
    esp32_mquickjs_wifi_twt_setup_results_snapshot(&results);
    if (results.fault != ESP_OK) { error = results.fault; goto done; }
    uint32_t next = (uint32_t)(results.last_request_id + 1);
    if (next < s_twt_identity.next_connection_id) next = s_twt_identity.next_connection_id;
    if (next > 32767U) { error = ESP_ERR_NO_MEM; goto done; }
    uint32_t request_id = options->connection_id_set ? options->config.twt_id : next;
    if (request_id < next) { error = ESP_ERR_INVALID_STATE; goto done; }
    if (s_twt_individual == NULL) {
        wifi_radio_twt_individual_t *fresh = esp32_mquickjs_memory_wireless_calloc("wifi.radio", ESP32_MQUICKJS_WIFI_TWT_MAX_INDIVIDUAL, sizeof(*fresh), ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
        if (fresh == NULL) { error = ESP_ERR_NO_MEM; goto done; }
        taskENTER_CRITICAL(&s_radio.lock);
        s_twt_individual = fresh;
        taskEXIT_CRITICAL(&s_radio.lock);
    }
    wifi_radio_twt_individual_t *owner = NULL;
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_TWT_MAX_INDIVIDUAL; ++i)
        if (s_twt_individual[i].token.identity == 0U) { owner = &s_twt_individual[i]; break; }
    if (owner == NULL) { error = ESP_ERR_NO_MEM; goto done; }
    error = wifi_radio_acquire_locked(ESP32_MQUICKJS_WIFI_RADIO_CLIENT_TWT, WIFI_MODE_STA, &owner->lease);
    if (error != ESP_OK) goto done;
    taskENTER_CRITICAL(&s_radio.lock);
    uint64_t identity = s_twt_identity.next_identity;
    s_twt_identity.next_identity = identity == UINT64_MAX ? 0U : identity + 1U;
    s_twt_identity.next_connection_id = request_id + 1U;
    owner->token = (esp32_mquickjs_wifi_twt_token_t){identity, s_radio.generation};
    owner->requested = options->config;
    owner->requested.twt_id = (uint16_t)request_id;
    owner->dispatching = true;
    wifi_radio_live_lease_t *live = wifi_radio_promiscuous_owner(owner->lease.identity);
    live->fixed_channel = true;
    live->primary_channel = channel;
    live->secondary_channel = (uint8_t)secondary;
    *token = owner->token;
    taskEXIT_CRITICAL(&s_radio.lock);
    esp32_mquickjs_wifi_twt_setup_dispatch_t dispatch = {0};
    error = esp32_mquickjs_wifi_twt_sdk_individual_submit(&owner->requested, &dispatch);
    taskENTER_CRITICAL(&s_radio.lock);
    owner->dispatch = dispatch;
    owner->submit_error = error;
    owner->dispatching = false;
    taskEXIT_CRITICAL(&s_radio.lock);
done:
    wifi_radio_operation_unlock();
    return error;
}
bool esp32_mquickjs_wifi_radio_twt_individual_status(const esp32_mquickjs_wifi_twt_token_t *token,
    esp32_mquickjs_wifi_twt_individual_radio_state_t *output)
{
    if (output == NULL) return false;
    taskENTER_CRITICAL(&s_radio.lock);
    wifi_radio_twt_individual_t *owner = wifi_radio_twt_individual_find(token);
    esp32_mquickjs_wifi_twt_individual_radio_state_t state = {0};
    if (owner != NULL) {
        state.token = owner->token;
        state.requested = owner->requested;
        state.dispatch = owner->dispatch;
        state.submit_error = owner->submit_error;
        state.cleanup_error = owner->cleanup_error;
        state.cleanup_stage = owner->cleanup_stage;
        state.dispatching = owner->dispatching;
        state.closing = owner->closing;
        state.result_released = owner->result_released;
        state.native_retired = owner->native_retired;
    }
    taskEXIT_CRITICAL(&s_radio.lock);
    if (owner == NULL) return false;
    if (state.dispatch.identity != 0U && !state.result_released && !state.native_retired &&
        esp32_mquickjs_wifi_twt_setup_result_read(state.dispatch.identity, &state.native) != ESP_OK) return false;
    taskENTER_CRITICAL(&s_radio.lock);
    bool exact = wifi_radio_twt_individual_find(token) == owner &&
        owner->dispatch.identity == state.dispatch.identity && owner->native_retired == state.native_retired &&
        owner->result_released == state.result_released && owner->closing == state.closing && owner->dispatching == state.dispatching;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (exact) *output = state;
    return exact;
}
unsigned esp32_mquickjs_wifi_radio_twt_individual_tokens(esp32_mquickjs_wifi_twt_token_t *tokens,
    unsigned capacity, bool closing_only)
{
    if (tokens == NULL || capacity == 0U) return 0;
    unsigned count = 0;
    taskENTER_CRITICAL(&s_radio.lock);
    if (s_twt_individual != NULL)
        for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_TWT_MAX_INDIVIDUAL && count < capacity; ++i) {
            const wifi_radio_twt_individual_t *owner = &s_twt_individual[i];
            if (owner->token.identity != 0U && (!closing_only || owner->closing)) tokens[count++] = owner->token;
        }
    taskEXIT_CRITICAL(&s_radio.lock);
    return count;
}
bool esp32_mquickjs_wifi_radio_twt_individual_request_close(const esp32_mquickjs_wifi_twt_token_t *token)
{
    taskENTER_CRITICAL(&s_radio.lock);
    wifi_radio_twt_individual_t *owner = wifi_radio_twt_individual_find(token);
    if (owner != NULL) owner->closing = true;
    uint32_t identity = owner != NULL ? owner->dispatch.identity : 0;
    taskEXIT_CRITICAL(&s_radio.lock);
    esp32_mquickjs_wifi_twt_setup_result_request_close(identity);
    return owner != NULL;
}
static esp_err_t wifi_radio_twt_individual_retire(wifi_radio_twt_individual_t *owner)
{
    if (owner->dispatch.identity == 0U) return ESP_OK; /* No native request was accepted. */
    /* Also covers a close requested while submit was still assigning identity. */
    esp32_mquickjs_wifi_twt_setup_result_request_close(owner->dispatch.identity);
    owner->retirement.stage = "individual-information-retire";
    esp_err_t information_error = esp32_mquickjs_wifi_twt_sdk_information_reap(owner->dispatch.identity);
    if (information_error != ESP_OK) return information_error;
    if (owner->retirement.result_released)
        return esp32_mquickjs_wifi_twt_setup_retire_poll(&owner->retirement, &owner->token, owner->dispatch.identity);
    esp32_mquickjs_wifi_twt_setup_result_t result;
    owner->retirement.stage = "individual-result-read";
    esp_err_t error = esp32_mquickjs_wifi_twt_setup_result_read(owner->dispatch.identity, &result);
    if (error != ESP_OK) return error;
    if (result.flags & (ESP32_MQUICKJS_WIFI_TWT_SETUP_SUBMITTING | ESP32_MQUICKJS_WIFI_TWT_TEARDOWN_SUBMITTING))
        return ESP_ERR_NOT_FINISHED;
    if (!(result.flags & (ESP32_MQUICKJS_WIFI_TWT_TEARDOWN_ATTEMPTED | ESP32_MQUICKJS_WIFI_TWT_SETUP_NATIVE_CLOSED))) {
        owner->retirement.stage = "individual-native-state";
        esp32_mquickjs_wifi_twt_sdk_snapshot_t native;
        error = esp32_mquickjs_wifi_twt_sdk_snapshot(&native);
        if (error != ESP_OK) return error;
        unsigned flow = 8U;
        for (unsigned i = 0; i < 8U; ++i) {
            if (native.individual_ids[i] != result.request_id) continue;
            if (flow != 8U) return ESP_ERR_INVALID_STATE;
            flow = i;
        }
        if (flow != 8U) {
            owner->retirement.stage = "individual-teardown-submit";
            error = esp32_mquickjs_wifi_twt_sdk_setup_teardown(owner->dispatch.identity, (uint8_t)flow);
            if (error != ESP_OK) return error;
        }
    }
    /* Reads current flags again: an early completion or error can precede
     * submission return. The existing coordinator owns cancellation, native
     * and event fences, result release, and a failed TX-release suffix. */
    return esp32_mquickjs_wifi_twt_setup_retire_poll(&owner->retirement, &owner->token, owner->dispatch.identity);
}
esp_err_t esp32_mquickjs_wifi_radio_twt_individual_close(esp32_mquickjs_wifi_twt_token_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    wifi_radio_twt_individual_t *owner = wifi_radio_twt_individual_find(token);
    if (owner == NULL || token->generation != s_radio.generation || owner->dispatching ||
        !wifi_radio_lease_valid(&owner->lease)) goto done;
    taskENTER_CRITICAL(&s_radio.lock);
    owner->closing = true;
    taskEXIT_CRITICAL(&s_radio.lock);
    error = owner->native_retired ? ESP_OK : wifi_radio_twt_individual_retire(owner);
    taskENTER_CRITICAL(&s_radio.lock);
    owner->cleanup_error = error;
    owner->cleanup_stage = owner->retirement.stage;
    owner->result_released = owner->retirement.result_released;
    if (error == ESP_OK) owner->native_retired = true;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (error != ESP_OK) goto done;
    wifi_radio_release_locked(&owner->lease);
    taskENTER_CRITICAL(&s_radio.lock);
    if (owner->lease.acquired) {
        error = owner->cleanup_error = ESP_ERR_INVALID_STATE;
        owner->cleanup_stage = "individual-lease-release";
    } else {
        memset(owner, 0, sizeof(*owner));
        *token = (esp32_mquickjs_wifi_twt_token_t){0};
    }
    taskEXIT_CRITICAL(&s_radio.lock);
done:
    wifi_radio_operation_unlock();
    return error;
}

static esp_err_t wifi_radio_twt_individual_information(const esp32_mquickjs_wifi_twt_token_t *token,
    uint32_t duration_ms, bool resume, uint32_t *identity)
{
    if (identity == NULL || duration_ms > ESP32_MQUICKJS_WIFI_TWT_SUSPEND_MAX_MS) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    taskENTER_CRITICAL(&s_radio.lock);
    wifi_radio_twt_individual_t *owner = wifi_radio_twt_individual_find(token);
    bool valid = owner != NULL && token->generation == s_radio.generation && !owner->dispatching &&
        !owner->closing && !owner->native_retired && !owner->result_released &&
        owner->submit_error == ESP_OK && owner->dispatch.identity != 0U && wifi_radio_lease_valid(&owner->lease);
    uint32_t setup_identity = valid ? owner->dispatch.identity : 0;
    taskEXIT_CRITICAL(&s_radio.lock);
    esp_err_t error = valid ? esp32_mquickjs_wifi_twt_sdk_information_submit(setup_identity, duration_ms, resume, identity)
        : ESP_ERR_INVALID_STATE;
    wifi_radio_operation_unlock();
    return error;
}
esp_err_t esp32_mquickjs_wifi_radio_twt_individual_suspend(const esp32_mquickjs_wifi_twt_token_t *token,
    uint32_t duration_ms, uint32_t *identity)
{ return wifi_radio_twt_individual_information(token, duration_ms, false, identity); }
esp_err_t esp32_mquickjs_wifi_radio_twt_individual_resume(const esp32_mquickjs_wifi_twt_token_t *token, uint32_t *identity)
{ return wifi_radio_twt_individual_information(token, 0, true, identity); }


