99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
static wifi_radio_twt_broadcast_t *wifi_radio_twt_broadcast_find(const esp32_mquickjs_wifi_twt_token_t *token)
{
    if (token == NULL || !token->identity || !token->generation || s_twt_broadcast == NULL) return NULL;
    for (unsigned i = 1; i < 32; ++i) {
        wifi_radio_twt_broadcast_t *owner = s_twt_broadcast[i];
        if (owner != NULL && owner->token.identity == token->identity && owner->token.generation == token->generation) return owner;
    }
    return NULL;
}
esp_err_t esp32_mquickjs_wifi_radio_twt_broadcast_submit(const esp32_mquickjs_wifi_btwt_options_t *options,
    esp32_mquickjs_wifi_twt_token_t *token)
{
    if (token == NULL || token->identity || token->generation || !esp32_mquickjs_wifi_btwt_options_valid(options)) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned || !s_radio.storage_configured || !s_radio.started ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED || s_radio.lifecycle.identity != 0U ||
        s_radio.operation.identity != 0U || s_radio.restart_required || s_radio.cleanup_stage != NULL) goto done;
    if (s_radio.fault_stage != NULL) { error = s_radio.fault_error; goto done; }
    if (s_twt_identity.next_identity == 0U) { error = ESP_ERR_NO_MEM; goto done; }
    wifi_mode_t mode;
    error = esp_wifi_get_mode(&mode);
    if (error != ESP_OK) goto done;
    if (mode != s_radio.effective_mode || !(mode & WIFI_MODE_STA)) { error = ESP_ERR_INVALID_STATE; goto done; }
    wifi_ap_record_t ap;
    error = esp_wifi_sta_get_ap_info(&ap);
    if (error != ESP_OK) goto done;
    uint8_t channel;
    wifi_second_chan_t secondary;
    uint32_t generation;
    error = wifi_radio_get_channel_locked(&channel, &secondary, &generation);
    if (error != ESP_OK) goto done;
    bool conflict = false;
    taskENTER_CRITICAL(&s_radio.lock);
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        const wifi_radio_live_lease_t *live = &s_radio.leases[i];
        if (live->identity != 0U && (live->raw_tx_identity != 0U || live->channel_conflict ||
            (live->fixed_channel && (live->primary_channel != channel || live->secondary_channel != (uint8_t)secondary))))
            conflict = true;
    }
    taskEXIT_CRITICAL(&s_radio.lock);
    if (conflict) { error = ESP_ERR_INVALID_STATE; goto done; }
    unsigned slot = options->config.btwt_id;
    if (s_twt_broadcast != NULL && s_twt_broadcast[slot] != NULL) { error = ESP_ERR_INVALID_STATE; goto done; }
    if (!esp32_mquickjs_wifi_twt_tx_broadcast_remaining(slot)) { error = ESP_ERR_NO_MEM; goto done; }
    if (s_twt_broadcast == NULL) {
        wifi_radio_twt_broadcast_t **fresh = esp32_mquickjs_memory_wireless_calloc("wifi.radio", 32, sizeof(*fresh), ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
        if (fresh == NULL) { error = ESP_ERR_NO_MEM; goto done; }
        taskENTER_CRITICAL(&s_radio.lock);s_twt_broadcast = fresh;taskEXIT_CRITICAL(&s_radio.lock);
    }
    wifi_radio_twt_broadcast_t *owner = esp32_mquickjs_memory_wireless_calloc("wifi.radio", 1, sizeof(*owner), ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (owner == NULL) { error = ESP_ERR_NO_MEM; goto done; }
    error = wifi_radio_acquire_locked(ESP32_MQUICKJS_WIFI_RADIO_CLIENT_TWT, WIFI_MODE_STA, &owner->lease);
    if (error != ESP_OK) { esp32_mquickjs_memory_payload_free(owner); goto done; }
    taskENTER_CRITICAL(&s_radio.lock);
    uint64_t identity = s_twt_identity.next_identity;
    s_twt_identity.next_identity = identity == UINT64_MAX ? 0 : identity + 1;
    owner->token = (esp32_mquickjs_wifi_twt_token_t){identity, s_radio.generation};
    owner->requested = options->config;
    owner->dispatching = true;
    s_twt_broadcast[slot] = owner;
    wifi_radio_live_lease_t *live = wifi_radio_promiscuous_owner(owner->lease.identity);
    live->fixed_channel = true;live->primary_channel = channel;live->secondary_channel = (uint8_t)secondary;
    *token = owner->token;
    taskEXIT_CRITICAL(&s_radio.lock);
    esp32_mquickjs_wifi_btwt_dispatch_t dispatch = {0};
    error = esp32_mquickjs_wifi_twt_sdk_broadcast_submit(&owner->requested, &dispatch);
    taskENTER_CRITICAL(&s_radio.lock);
    owner->dispatch = dispatch;owner->submit_error = error;owner->dispatching = false;
    taskEXIT_CRITICAL(&s_radio.lock);
done:
    wifi_radio_operation_unlock();return error;
}
bool esp32_mquickjs_wifi_radio_twt_broadcast_status(const esp32_mquickjs_wifi_twt_token_t *token,
    esp32_mquickjs_wifi_twt_broadcast_radio_state_t *output)
{
    if (output == NULL) return false;
    esp32_mquickjs_wifi_twt_broadcast_radio_state_t state = {0};
    taskENTER_CRITICAL(&s_radio.lock);
    wifi_radio_twt_broadcast_t *owner = wifi_radio_twt_broadcast_find(token);
    bool available = owner != NULL && !owner->working;
    if (available) {
        state.token = owner->token;state.requested = owner->requested;state.dispatch = owner->dispatch;
        state.teardown = owner->retirement.teardown;
        state.submit_error = owner->submit_error;state.teardown_error = owner->teardown_error;
        state.cleanup_error = owner->cleanup_error;state.cleanup_stage = owner->cleanup_stage;
        state.dispatching = owner->dispatching;state.closing = owner->closing;
        state.result_released = owner->retirement.released;state.native_retired = owner->native_retired;
        state.teardown_attempted = owner->teardown_attempted;
    }
    taskEXIT_CRITICAL(&s_radio.lock);
    if (!available) return false;
    if (state.dispatch.identity && !state.result_released &&
        !esp32_mquickjs_wifi_btwt_setup_result(state.requested.btwt_id, state.dispatch.identity, &state.native)) return false;
    state.dialog_attempts_remaining = esp32_mquickjs_wifi_twt_tx_broadcast_remaining(state.requested.btwt_id);
    taskENTER_CRITICAL(&s_radio.lock);
    bool exact = wifi_radio_twt_broadcast_find(token) == owner && !owner->working &&
        owner->dispatching == state.dispatching && owner->dispatch.identity == state.dispatch.identity &&
        owner->retirement.released == state.result_released && owner->native_retired == state.native_retired && owner->closing == state.closing;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (exact) *output = state;
    return exact;
}
unsigned esp32_mquickjs_wifi_radio_twt_broadcast_tokens(esp32_mquickjs_wifi_twt_token_t *tokens,unsigned capacity,bool closing_only)
{
    if (tokens == NULL || !capacity) return 0;
    unsigned count = 0;
    taskENTER_CRITICAL(&s_radio.lock);
    if (s_twt_broadcast != NULL)
        for (unsigned i = 1; i < 32 && count < capacity; ++i) {
            const wifi_radio_twt_broadcast_t *owner = s_twt_broadcast[i];
            if (owner != NULL && (!closing_only || owner->closing)) tokens[count++] = owner->token;
        }
    taskEXIT_CRITICAL(&s_radio.lock);return count;
}
bool esp32_mquickjs_wifi_radio_twt_broadcast_request_close(const esp32_mquickjs_wifi_twt_token_t *token)
{
    taskENTER_CRITICAL(&s_radio.lock);
    wifi_radio_twt_broadcast_t *owner = wifi_radio_twt_broadcast_find(token);
    if (owner != NULL) owner->closing = true;
    taskEXIT_CRITICAL(&s_radio.lock);return owner != NULL;
}
static esp_err_t wifi_radio_twt_broadcast_retire(wifi_radio_twt_broadcast_t *owner)
{
    unsigned slot = owner->requested.btwt_id;
    if (owner->dispatch.handoff_error || (owner->dispatch.native_entered && !owner->dispatch.native_completed)) {
        owner->retirement.stage = "broadcast-dispatch-unconfirmed";
        return owner->dispatch.handoff_error ? owner->dispatch.handoff_error : ESP_ERR_INVALID_STATE;
    }
    if (!owner->dispatch.identity) return ESP_OK;
    if (owner->retirement.released)
        return esp32_mquickjs_wifi_btwt_retire_poll(&owner->retirement,&owner->token,slot,owner->dispatch.identity);
    esp32_mquickjs_wifi_btwt_timer_result_t result;
    owner->retirement.stage = "broadcast-result-read";
    if (!esp32_mquickjs_wifi_btwt_setup_result(slot,owner->dispatch.identity,&result)) return ESP_ERR_INVALID_STATE;
    if (result.tx_busy || result.publishing) return ESP_ERR_NOT_FINISHED;
    if (!owner->teardown_attempted && !result.native_closed) {
        owner->retirement.stage = "broadcast-native-state";
        esp32_mquickjs_wifi_twt_sdk_snapshot_t native;
        esp_err_t error = esp32_mquickjs_wifi_twt_sdk_snapshot(&native);
        if (error != ESP_OK) return error;
        if (native.broadcast_id_bitmap & (UINT32_C(1) << slot)) {
            owner->retirement.stage = "broadcast-teardown-submit";
            error = esp32_mquickjs_wifi_twt_sdk_broadcast_teardown(slot,owner->dispatch.identity);
            esp32_mquickjs_wifi_twt_teardown_tx_snapshot_t teardown;
            esp32_mquickjs_wifi_twt_teardown_tx_snapshot(&teardown);
            if (teardown.broadcast && teardown.identity == owner->dispatch.identity && teardown.flow == slot) {
                owner->teardown_attempted = true;owner->retirement.teardown = teardown;
            }
            owner->teardown_error = error;
            if (error != ESP_OK) return error;
        }
    }
    return esp32_mquickjs_wifi_btwt_retire_poll(&owner->retirement,&owner->token,slot,owner->dispatch.identity);
}
void esp32_mquickjs_wifi_radio_twt_close_agreements(esp32_mquickjs_wifi_twt_close_group_t *group)
{
    if (group == NULL) return;
    *group = (esp32_mquickjs_wifi_twt_close_group_t){0};
    uint32_t identities[ESP32_MQUICKJS_WIFI_TWT_MAX_INDIVIDUAL] = {0};
    taskENTER_CRITICAL(&s_radio.lock);
    if (s_twt_individual != NULL)
        for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_TWT_MAX_INDIVIDUAL; ++i) {
            wifi_radio_twt_individual_t *owner = &s_twt_individual[i];
            if (!owner->token.identity) continue;
            owner->closing = true;
            identities[group->individual_count] = owner->dispatch.identity;
            group->individual[group->individual_count++] = owner->token;
        }
    if (s_twt_broadcast != NULL)
        for (unsigned i = 1; i < 32; ++i) {
            wifi_radio_twt_broadcast_t *owner = s_twt_broadcast[i];
            if (owner == NULL || !owner->token.identity) continue;
            owner->closing = true;
            group->broadcast[group->broadcast_count++] = owner->token;
        }
    taskEXIT_CRITICAL(&s_radio.lock);
    for (unsigned i = 0; i < group->individual_count; ++i)
        esp32_mquickjs_wifi_twt_setup_result_request_close(identities[i]);
}
unsigned esp32_mquickjs_wifi_radio_twt_close_pending(const esp32_mquickjs_wifi_twt_close_group_t *group)
{
    if (group == NULL) return 0;
    unsigned pending = 0;
    taskENTER_CRITICAL(&s_radio.lock);
    for (unsigned i = 0; i < group->individual_count; ++i)
        if (wifi_radio_twt_individual_find(&group->individual[i]) != NULL) ++pending;
    for (unsigned i = 0; i < group->broadcast_count; ++i)
        if (wifi_radio_twt_broadcast_find(&group->broadcast[i]) != NULL) ++pending;
    taskEXIT_CRITICAL(&s_radio.lock);
    return pending;
}
esp_err_t esp32_mquickjs_wifi_radio_twt_broadcast_close(esp32_mquickjs_wifi_twt_token_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    wifi_radio_twt_broadcast_t *owner = wifi_radio_twt_broadcast_find(token);
    if (owner == NULL || token->generation != s_radio.generation || owner->dispatching || owner->working ||
        !wifi_radio_lease_valid(&owner->lease)) goto done;
    taskENTER_CRITICAL(&s_radio.lock);owner->closing = true;owner->working = true;taskEXIT_CRITICAL(&s_radio.lock);
    error = owner->native_retired ? ESP_OK : wifi_radio_twt_broadcast_retire(owner);
    taskENTER_CRITICAL(&s_radio.lock);
    owner->cleanup_error = error;owner->cleanup_stage = owner->retirement.stage;
    if (error == ESP_OK) owner->native_retired = true;
    owner->working = false;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (error != ESP_OK) goto done;
    wifi_radio_release_locked(&owner->lease);
    taskENTER_CRITICAL(&s_radio.lock);
    if (owner->lease.acquired) {
        error = owner->cleanup_error = ESP_ERR_INVALID_STATE;owner->cleanup_stage = "broadcast-lease-release";
    } else {
        s_twt_broadcast[owner->requested.btwt_id] = NULL;
        *token = (esp32_mquickjs_wifi_twt_token_t){0};
    }
    bool freed = !owner->lease.acquired;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (freed) esp32_mquickjs_memory_payload_free(owner);
done:
    wifi_radio_operation_unlock();return error;
}

