99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
static bool wifi_radio_twt_probe_exact_locked(const esp32_mquickjs_wifi_twt_token_t *token)
{
    return token != NULL && token->identity != 0U && token->identity == s_twt_probe.state.token.identity &&
        token->generation == s_twt_probe.state.token.generation && token->generation == s_radio.generation &&
        wifi_radio_lease_valid(&s_twt_probe.lease) && s_twt_probe.lease.client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_TWT &&
        s_radio.operation.identity == s_twt_probe.operation_identity && s_radio.operation.generation == token->generation &&
        s_radio.operation.lease_identity == s_twt_probe.lease.identity &&
        s_radio.operation.kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_TWT_PROBE;
}
esp_err_t esp32_mquickjs_wifi_radio_twt_probe_submit(uint32_t response_ms, esp32_mquickjs_wifi_twt_token_t *token)
{
    if (token == NULL || token->identity != 0U || token->generation != 0U || response_ms == 0U ||
        response_ms > ESP32_MQUICKJS_WIFI_TWT_MAX_TIMEOUT_MS) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (!s_radio.driver_owned || !s_radio.storage_configured || !s_radio.started ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED || s_radio.lifecycle.identity != 0U ||
        s_radio.operation.identity != 0U || s_radio.restart_required || s_radio.cleanup_stage != NULL ||
        s_twt_probe.state.token.identity != 0U) goto done;
    if (s_radio.fault_stage != NULL) { error = s_radio.fault_error; goto done; }
    if (s_radio.next_operation_identity == 0U || s_twt_identity.next_identity == 0U) { error = ESP_ERR_NO_MEM; goto done; }
    wifi_mode_t mode;
    error = esp_wifi_get_mode(&mode);
    if (error != ESP_OK) goto done;
    if (mode != s_radio.effective_mode || !(mode & WIFI_MODE_STA)) { error = ESP_ERR_INVALID_STATE; goto done; }
    wifi_ap_record_t ap;
    error = esp_wifi_sta_get_ap_info(&ap);
    if (error != ESP_OK) goto done;
    uint8_t channel;
    wifi_second_chan_t secondary;
    uint32_t generation;
    error = wifi_radio_get_channel_locked(&channel, &secondary, &generation);
    if (error != ESP_OK) goto done;
    bool conflict = false;
    taskENTER_CRITICAL(&s_radio.lock);
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        const wifi_radio_live_lease_t *owner = &s_radio.leases[i];
        if (owner->identity != 0U && (owner->raw_tx_identity != 0U || owner->channel_conflict ||
            (owner->fixed_channel && (owner->primary_channel != channel || owner->secondary_channel != (uint8_t)secondary))))
            conflict = true;
    }
    taskEXIT_CRITICAL(&s_radio.lock);
    if (conflict) { error = ESP_ERR_INVALID_STATE; goto done; }
    error = wifi_radio_acquire_locked(ESP32_MQUICKJS_WIFI_RADIO_CLIENT_TWT, WIFI_MODE_STA, &s_twt_probe.lease);
    if (error != ESP_OK) goto done;
    taskENTER_CRITICAL(&s_radio.lock);
    uint64_t identity = s_twt_identity.next_identity;
    s_twt_identity.next_identity = identity == UINT64_MAX ? 0U : identity + 1U;
    s_twt_probe.state.token = (esp32_mquickjs_wifi_twt_token_t){identity, s_radio.generation};
    s_twt_probe.state.dispatching = true;
    s_twt_probe.operation_identity = s_radio.next_operation_identity++;
    s_radio.operation = (esp32_mquickjs_wifi_radio_operation_t){.generation = s_radio.generation,
        .lease_identity = s_twt_probe.lease.identity, .identity = s_twt_probe.operation_identity,
        .kind = ESP32_MQUICKJS_WIFI_RADIO_OPERATION_TWT_PROBE};
    wifi_radio_live_lease_t *owner = wifi_radio_promiscuous_owner(s_twt_probe.lease.identity);
    owner->fixed_channel = true;
    owner->primary_channel = channel;
    owner->secondary_channel = (uint8_t)secondary;
    *token = s_twt_probe.state.token;
    taskEXIT_CRITICAL(&s_radio.lock);
    uint32_t native_identity = 0;
    error = esp32_mquickjs_wifi_twt_sdk_probe_submit(response_ms, &native_identity);
    taskENTER_CRITICAL(&s_radio.lock);
    s_twt_probe.state.native_identity = native_identity;
    s_twt_probe.state.submit_error = error;
    s_twt_probe.state.dispatching = false;
    taskEXIT_CRITICAL(&s_radio.lock);
done:
    wifi_radio_operation_unlock();
    return error;
}
bool esp32_mquickjs_wifi_radio_twt_probe_status(const esp32_mquickjs_wifi_twt_token_t *token,
    esp32_mquickjs_wifi_twt_probe_radio_state_t *output)
{
    if (output == NULL) return false;
    taskENTER_CRITICAL(&s_radio.lock);
    esp32_mquickjs_wifi_twt_probe_radio_state_t result = {
        .token = s_twt_probe.state.token, .native_identity = s_twt_probe.state.native_identity,
        .submit_error = s_twt_probe.state.submit_error, .cleanup_error = s_twt_probe.state.cleanup_error,
        .cleanup_stage = s_twt_probe.state.cleanup_stage, .dispatching = s_twt_probe.state.dispatching,
        .cleanup_pending = s_twt_probe.state.cleanup_pending};
    bool exact = token == NULL || (token->identity != 0U && token->identity == result.token.identity &&
        token->generation == result.token.generation && token->generation == s_radio.generation);
    taskEXIT_CRITICAL(&s_radio.lock);
    if (!exact) return false;
    if (result.native_identity != 0U) {
        esp32_mquickjs_wifi_twt_probe_result_snapshot(&result.native);
        if (result.native.identity != result.native_identity) return false;
        esp32_mquickjs_wifi_twt_probe_timer_snapshot_t timer;
        esp32_mquickjs_wifi_twt_probe_wake_snapshot_t wake;
        esp32_mquickjs_wifi_twt_probe_timer_snapshot(&timer);
        esp32_mquickjs_wifi_twt_probe_wake_snapshot(&wake);
        result.native_error = result.native.control_error != ESP_OK ? result.native.control_error :
            timer.fault != ESP_OK ? timer.fault : wake.fault != ESP_OK ? wake.fault : result.native.fault;
    }
    taskENTER_CRITICAL(&s_radio.lock);
    exact = result.token.identity == s_twt_probe.state.token.identity &&
        result.token.generation == s_twt_probe.state.token.generation && result.native_identity == s_twt_probe.state.native_identity;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (exact) *output = result;
    return exact;
}
void esp32_mquickjs_wifi_radio_twt_probe_snapshot(esp32_mquickjs_wifi_twt_probe_radio_state_t *output)
{
    if (output == NULL) return;
    if (!esp32_mquickjs_wifi_radio_twt_probe_status(NULL, output)) *output = (esp32_mquickjs_wifi_twt_probe_radio_state_t){0};
}
static bool wifi_radio_twt_recovery_exact_locked(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    return token != NULL && token->identity != 0U && token->identity == s_twt_recovery.lifecycle.identity &&
        token->generation == s_twt_recovery.lifecycle.generation && token->identity == s_radio.lifecycle.identity &&
        token->generation == s_radio.lifecycle.generation;
}
static bool wifi_radio_twt_managed_lease_locked(uint32_t identity)
{
    const esp32_mquickjs_wifi_radio_lease_t *lease = NULL;
    if (s_twt_probe.state.token.identity && s_twt_probe.lease.identity == identity && !s_twt_probe.state.dispatching)
        lease = &s_twt_probe.lease;
    if (s_twt_individual != NULL)
        for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_TWT_MAX_INDIVIDUAL; ++i) {
            const wifi_radio_twt_individual_t *owner = &s_twt_individual[i];
            if (owner->token.identity && owner->lease.identity == identity && !owner->dispatching)
                lease = &owner->lease;
        }
    if (s_twt_broadcast != NULL)
        for (unsigned i = 1; i < 32; ++i) {
            const wifi_radio_twt_broadcast_t *owner = s_twt_broadcast[i];
            if (owner != NULL && owner->token.identity && owner->lease.identity == identity && !owner->dispatching)
                lease = &owner->lease;
        }
    return lease != NULL && lease->client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_TWT && wifi_radio_lease_valid(lease);
}
static bool wifi_radio_twt_recovery_owners_locked(void)
{
    if (!wifi_radio_twt_recovery_exact_locked(&s_radio.lifecycle)) return false;
    if (s_radio.operation.identity != 0U &&
        (!wifi_radio_twt_probe_exact_locked(&s_twt_probe.state.token) || s_twt_probe.state.dispatching)) return false;
    for (unsigned i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        const wifi_radio_live_lease_t *owner = &s_radio.leases[i];
        if (!owner->identity) continue;
        if (owner->promiscuous_identity || owner->raw_tx_identity || !wifi_radio_twt_managed_lease_locked(owner->identity))
            return false;
    }
    return true;
}
static bool wifi_radio_twt_recovery_active(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    bool active = wifi_radio_twt_recovery_exact_locked(token);
    wifi_radio_operation_unlock();
    return active;
}
static esp_err_t wifi_radio_twt_recovery_begin(const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station, const esp32_mquickjs_wifi_radio_lease_t *access_point,
    const esp32_mquickjs_wifi_recovery_request_t *operation,
    esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t *mode)
{
    if (token == NULL || token->identity || token->generation || mode == NULL || operation == NULL ||
        operation->kind != ESP32_MQUICKJS_WIFI_RECOVERY_TWT || operation->identity || !operation->generation)
        return ESP_ERR_INVALID_ARG;
    *mode = WIFI_MODE_NULL;
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (operation->generation != s_radio.generation || s_radio.lifecycle.identity ||
        !s_radio.driver_owned || !s_radio.storage_configured || !s_radio.started || !s_radio.stop_required ||
        s_radio.stop_submitted || s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL || s_radio.restart_required ||
        s_radio.wake_locks || s_radio.promiscuous_claimed || WIFI_RADIO_EAP_PENDING ||
        s_tx_rate_lease.identity || s_tx_rate_lease.restore_pending || s_interval.owner.identity ||
        s_interval.restore_pending || s_vendor_ie.start_owner.identity || s_config_restart.snapshot != NULL ||
        s_policy_restart.owner.identity || !(s_radio.effective_mode & WIFI_MODE_STA)) goto done;
    if (s_radio.operation.identity &&
        (!wifi_radio_twt_probe_exact_locked(&s_twt_probe.state.token) || s_twt_probe.state.dispatching)) goto done;
    const esp32_mquickjs_wifi_radio_lease_t *helpers[3] = {application, station, access_point};
    const esp32_mquickjs_wifi_radio_client_t clients[3] = {ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION,
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA, ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP};
    uint32_t identities[3] = {0};
    for (unsigned i = 0; i < 3; ++i) {
        if (helpers[i] == NULL || !helpers[i]->acquired) continue;
        if (!wifi_radio_lease_valid(helpers[i]) || helpers[i]->client != clients[i]) goto done;
        identities[i] = helpers[i]->identity;
    }
    unsigned managed = 0;
    for (unsigned i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        const wifi_radio_live_lease_t *owner = &s_radio.leases[i];
        if (!owner->identity) continue;
        if (owner->promiscuous_identity || owner->raw_tx_identity) goto done;
        if (wifi_radio_twt_managed_lease_locked(owner->identity)) { ++managed; continue; }
        if (owner->identity != identities[0] && owner->identity != identities[1] && owner->identity != identities[2]) goto done;
    }
    if (!managed) goto done;
    if (!s_radio.next_lifecycle_identity) { error = ESP_ERR_NO_MEM; goto done; }
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.lifecycle = (esp32_mquickjs_wifi_radio_lifecycle_t){s_radio.generation, s_radio.next_lifecycle_identity++};
    s_twt_recovery.lifecycle = s_radio.lifecycle;
    s_twt_recovery.prepared = s_twt_recovery.stopped = false;
    if (s_twt_probe.state.token.identity) s_twt_probe.state.cleanup_pending = true;
    if (s_twt_individual != NULL)
        for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_TWT_MAX_INDIVIDUAL; ++i)
            if (s_twt_individual[i].token.identity) s_twt_individual[i].closing = true;
    if (s_twt_broadcast != NULL)
        for (unsigned i = 1; i < 32; ++i)
            if (s_twt_broadcast[i] != NULL) s_twt_broadcast[i]->closing = true;
    *token = s_radio.lifecycle;
    *mode = s_radio.effective_mode;
    taskEXIT_CRITICAL(&s_radio.lock);
    /* No SDK call and no nested locks. Operation mutex excludes submission;
     * later admission is blocked by lifecycle, so this entire set is fixed. */
    if (s_twt_individual != NULL)
        for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_TWT_MAX_INDIVIDUAL; ++i)
            if (s_twt_individual[i].token.identity)
                esp32_mquickjs_wifi_twt_setup_result_request_close(s_twt_individual[i].dispatch.identity);
    error = ESP_OK;
done:
    wifi_radio_operation_unlock();
    return error;
}
static esp_err_t wifi_radio_twt_recovery_prepare(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_twt_recovery_exact_locked(token)) goto done;
    if (s_twt_recovery.prepared) { error = ESP_OK; goto done; }
    /* Probe PM ownership must be revoked while its current association still
     * exists. This acknowledges cancellation only, not TX/timer/event drain. */
    error = s_twt_probe.state.native_identity
        ? esp32_mquickjs_wifi_twt_sdk_probe_cancel(s_twt_probe.state.native_identity) : ESP_OK;
    if (error == ESP_OK) s_twt_recovery.prepared = true;
    else {
        taskENTER_CRITICAL(&s_radio.lock);
        s_twt_probe.state.cleanup_error = error;
        s_twt_probe.state.cleanup_stage = "probe-recovery-cancel";
        taskEXIT_CRITICAL(&s_radio.lock);
    }
done:
    wifi_radio_operation_unlock();
    return error;
}
static esp_err_t wifi_radio_twt_recovery_checkpoint(const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    const char *stage = "twt-recovery-checkpoint-admission";
    if (!wifi_radio_twt_recovery_exact_locked(token) || !s_twt_recovery.prepared ||
        token->generation != s_radio.generation || !s_radio.driver_owned || !s_radio.storage_configured ||
        !s_radio.started || !s_radio.stop_required || s_radio.stop_submitted ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED || s_radio.fault_stage != NULL ||
        s_radio.cleanup_stage != NULL || s_radio.restart_required || mode != s_radio.effective_mode) goto done;
    stage = "twt-recovery-policy-snapshot";
    error = wifi_radio_policy_restart_prepare_locked(token, mode);
    if (error != ESP_OK) goto done;
    error = wifi_radio_restart_configs_capture_locked(token, mode);
    if (error == ESP_OK) (void)wifi_radio_restart_configs_record("twt-recovery-checkpoint-complete", ESP_OK, false);
    wifi_radio_operation_unlock();
    return error;
done:
    (void)wifi_radio_restart_configs_record(stage, error, false);
    wifi_radio_operation_unlock();
    return error;
}
static esp_err_t wifi_radio_twt_recovery_phase(const esp32_mquickjs_wifi_radio_lifecycle_t *token, bool shutdown)
{
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (wifi_radio_twt_recovery_exact_locked(token))
        error = shutdown ? wifi_radio_shutdown_lease_locked(NULL, true) : wifi_radio_stop_lease_locked(NULL, true);
    wifi_radio_operation_unlock();
    return error;
}
static esp_err_t wifi_radio_twt_recovery_stopped(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    bool valid = wifi_radio_twt_recovery_exact_locked(token) && s_twt_recovery.stopped &&
        !s_radio.started && !s_radio.stop_required && !s_radio.stop_submitted &&
        s_radio.event_phase == RADIO_EVENTS_IDLE && !s_radio.wake_locks && !s_radio.promiscuous_claimed &&
        !s_radio.restart_required && wifi_radio_twt_recovery_owners_locked() &&
        (s_radio.driver_state == ESP32_MQUICKJS_WIFI_RADIO_STOPPED ||
         s_radio.driver_state == ESP32_MQUICKJS_WIFI_RADIO_CLEANUP_PENDING ||
         s_radio.driver_state == ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED);
    wifi_radio_operation_unlock();
    return valid ? ESP_OK : ESP_ERR_INVALID_STATE;
}
static esp_err_t wifi_radio_twt_recovery_finish(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_twt_recovery_exact_locked(token) || !s_twt_recovery.stopped || s_radio.driver_owned ||
        s_radio.started || s_radio.stop_required || s_radio.stop_submitted || s_radio.event_phase != RADIO_EVENTS_IDLE ||
        s_radio.operation.identity || s_radio.wake_locks || s_radio.promiscuous_claimed || s_radio.restart_required ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED) goto done;
    for (unsigned i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) if (s_radio.leases[i].identity) goto done;
    memset(&s_twt_recovery, 0, sizeof(s_twt_recovery));
    error = ESP_OK; /* Frozen configuration and lifecycle transfer to replay. */
done:
    wifi_radio_operation_unlock();
    return error;
}
bool esp32_mquickjs_wifi_radio_twt_probe_request_close(const esp32_mquickjs_wifi_twt_token_t *token)
{
    taskENTER_CRITICAL(&s_radio.lock);
    bool exact = token != NULL && token->identity != 0U && token->identity == s_twt_probe.state.token.identity &&
        token->generation == s_twt_probe.state.token.generation;
    if (exact) s_twt_probe.state.cleanup_pending = true;
    taskEXIT_CRITICAL(&s_radio.lock);
    return exact;
}
bool esp32_mquickjs_wifi_radio_twt_probe_cleanup_token(esp32_mquickjs_wifi_twt_token_t *token)
{
    if (token == NULL) return false;
    taskENTER_CRITICAL(&s_radio.lock);
    bool pending = s_twt_probe.state.token.identity != 0U && s_twt_probe.state.cleanup_pending;
    if (pending) *token = s_twt_probe.state.token;
    taskEXIT_CRITICAL(&s_radio.lock);
    return pending;
}

esp_err_t esp32_mquickjs_wifi_radio_twt_probe_retire(esp32_mquickjs_wifi_twt_token_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_twt_probe_exact_locked(token) || s_twt_probe.state.dispatching) goto done;
    taskENTER_CRITICAL(&s_radio.lock);
    s_twt_probe.state.cleanup_pending = true;
    taskEXIT_CRITICAL(&s_radio.lock);
    /* No accepted native identity means the reviewed wrapper never entered
     * a probe; only the Radio reservation needs release. */
    error = s_twt_probe.state.native_identity == 0U ? ESP_OK :
        esp32_mquickjs_wifi_twt_probe_retire_poll(&s_twt_probe.retirement, token, s_twt_probe.state.native_identity);
    taskENTER_CRITICAL(&s_radio.lock);
    s_twt_probe.state.cleanup_error = error;
    s_twt_probe.state.cleanup_stage = s_twt_probe.retirement.stage;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (error != ESP_OK) goto done;
    taskENTER_CRITICAL(&s_radio.lock);
    esp32_mquickjs_wifi_radio_operation_t operation = s_radio.operation;
    memset(&s_radio.operation, 0, sizeof(s_radio.operation));
    taskEXIT_CRITICAL(&s_radio.lock);
    wifi_radio_release_locked(&s_twt_probe.lease);
    taskENTER_CRITICAL(&s_radio.lock);
    if (s_twt_probe.lease.acquired) {
        s_radio.operation = operation;
        error = s_twt_probe.state.cleanup_error = ESP_ERR_INVALID_STATE;
        s_twt_probe.state.cleanup_stage = "probe-lease-release";
    } else {
        memset(&s_twt_probe, 0, sizeof(s_twt_probe));
        *token = (esp32_mquickjs_wifi_twt_token_t){0};
    }
    taskEXIT_CRITICAL(&s_radio.lock);
done:
    wifi_radio_operation_unlock();
    return error;
}
#endif

