99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
/* No SDK or observation-queue call from this event handler. The SDK has no
 * cookie: any second/foreign report invalidates attribution and drain evidence.
 * Never reuse this lane until the preceding report and native work are retired. */
static void wifi_radio_ftm_event(int32_t id, const void *data)
{
    if (id != WIFI_EVENT_FTM_REPORT || data == NULL) return;
    const wifi_event_ftm_report_t *report = data;
    taskENTER_CRITICAL(&s_radio.lock);
    esp32_mquickjs_wifi_ftm_state_t *state = &s_ftm.state;
    if (state->token.identity != 0U && !state->physical_termination && (state->dispatching || state->submitted)) {
        state->sdk_fenced = state->event_fenced = false;
        s_ftm.fence_posted = false;
        if (state->revision == UINT32_MAX) state->ambiguous = true;
        else ++state->revision;
        if (state->terminal || memcmp(report->peer_mac, s_ftm.config.resp_mac, 6) != 0 ||
            (unsigned)report->status > FTM_STATUS_USER_TERM) state->ambiguous = true;
        else {
            state->terminal = true;
            memset(&state->report, 0, sizeof(state->report));
            memcpy(state->report.peer_mac, report->peer_mac, 6);
            state->report.status = report->status;
            if (report->status == FTM_STATUS_SUCCESS) {
                state->report.rtt_raw = report->rtt_raw;
                state->report.rtt_est = report->rtt_est;
                state->report.dist_est = report->dist_est;
                state->report.ftm_report_num_entries = report->ftm_report_num_entries;
            }
        }
    }
    taskEXIT_CRITICAL(&s_radio.lock);
}

static bool wifi_radio_ftm_exact_locked(const esp32_mquickjs_wifi_ftm_token_t *token)
{
    return token != NULL && token->identity != 0U &&
        token->identity == s_ftm.state.token.identity && token->generation == s_ftm.state.token.generation &&
        token->generation == s_radio.generation && wifi_radio_lease_valid(&s_ftm.lease) &&
        s_ftm.lease.client == ESP32_MQUICKJS_WIFI_RADIO_CLIENT_FTM &&
        s_radio.operation.kind == ESP32_MQUICKJS_WIFI_RADIO_OPERATION_FTM &&
        s_radio.operation.identity == token->identity && s_radio.operation.generation == token->generation &&
        s_radio.operation.lease_identity == s_ftm.lease.identity;
}

static bool wifi_radio_ftm_recovery_exact_locked(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    return token != NULL && token->identity != 0U && token->identity == s_ftm.recovery.identity &&
        token->generation == s_ftm.recovery.generation && token->identity == s_radio.lifecycle.identity &&
        token->generation == s_radio.lifecycle.generation;
}

static uint32_t wifi_radio_ftm_recovery_capture_owner_locked(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    return wifi_radio_ftm_recovery_exact_locked(token) && wifi_radio_ftm_exact_locked(&s_ftm.state.token) &&
        s_ftm.state.submitted && !s_ftm.state.dispatching && !s_ftm.state.physical_termination
        ? s_ftm.lease.identity : 0U;
}

bool esp32_mquickjs_wifi_radio_ftm_recovery_active(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    bool active = wifi_radio_ftm_recovery_exact_locked(token);
    wifi_radio_operation_unlock();
    return active;
}

esp_err_t esp32_mquickjs_wifi_radio_begin_ftm_recovery(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_radio_lease_t *access_point,
    const esp32_mquickjs_wifi_ftm_token_t *operation,
    esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t *mode)
{
    if (token == NULL || token->identity != 0U || token->generation != 0U || mode == NULL ||
        operation == NULL || operation->identity == 0U || operation->generation == 0U) return ESP_ERR_INVALID_ARG;
    *mode = WIFI_MODE_NULL;
#if !(CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C5)
    /* STOP/FTM cleanup control flow has not been qualified for another SDK target. */
    return ESP_ERR_NOT_SUPPORTED;
#endif
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_ftm_exact_locked(operation) || !s_ftm.state.submitted || s_ftm.state.dispatching ||
        s_ftm.state.physical_termination || s_radio.lifecycle.identity != 0U ||
        !s_radio.driver_owned || !s_radio.storage_configured || !s_radio.started || !s_radio.stop_required ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED || s_radio.fault_stage != NULL ||
        s_radio.cleanup_stage != NULL || s_radio.restart_required || s_radio.wake_locks != 0U ||
        s_radio.promiscuous_claimed || s_tx_rate_lease.identity != 0U || s_tx_rate_lease.restore_pending ||
        s_interval.owner.identity != 0U || s_interval.restore_pending || s_vendor_ie.start_owner.identity != 0U ||
        s_config_restart.snapshot != NULL || s_policy_restart.owner.identity != 0U) goto done;
    if (s_radio.effective_mode != WIFI_MODE_STA && s_radio.effective_mode != WIFI_MODE_APSTA) goto done;
    const esp32_mquickjs_wifi_radio_lease_t *owners[3] = {application, station, access_point};
    const esp32_mquickjs_wifi_radio_client_t clients[3] = {
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION,
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA,
        ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_AP,
    };
    uint32_t identities[3] = {0};
    for (size_t i = 0; i < 3; ++i) {
        if (owners[i] == NULL || !owners[i]->acquired) continue;
        if (!wifi_radio_lease_valid(owners[i]) || owners[i]->client != clients[i]) goto done;
        identities[i] = owners[i]->identity;
    }
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        const wifi_radio_live_lease_t *owner = &s_radio.leases[i];
        if (owner->identity == 0U) continue;
        if (owner->promiscuous_identity != 0U || owner->raw_tx_identity != 0U ||
            (owner->identity != s_ftm.lease.identity && owner->identity != identities[0] &&
             owner->identity != identities[1] && owner->identity != identities[2])) goto done;
    }
    if (s_radio.next_lifecycle_identity == 0U) { err = ESP_ERR_NO_MEM; goto done; }
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.lifecycle = (esp32_mquickjs_wifi_radio_lifecycle_t){s_radio.generation, s_radio.next_lifecycle_identity++};
    s_ftm.recovery = s_radio.lifecycle;
    s_ftm.recovery_stopped = s_ftm.recovery_timer_started = s_ftm.recovery_timer_ready = s_ftm.recovery_sdk_ready = false;
    *token = s_radio.lifecycle;
    *mode = s_radio.effective_mode;
    taskEXIT_CRITICAL(&s_radio.lock);
    err = ESP_OK;
done:
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_checkpoint_ftm_recovery(const esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t mode)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    const char *stage = "ftm-recovery-checkpoint-admission";
    if (!wifi_radio_ftm_recovery_exact_locked(token) || token->generation != s_radio.generation ||
        !s_radio.driver_owned || !s_radio.storage_configured || !s_radio.started || !s_radio.stop_required ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED || s_radio.fault_stage != NULL ||
        s_radio.cleanup_stage != NULL || mode != s_radio.effective_mode) goto done;
    stage = "ftm-recovery-policy-snapshot";
    err = wifi_radio_policy_restart_prepare_locked(token, mode);
    if (err != ESP_OK) goto done;
    err = wifi_radio_restart_configs_capture_locked(token, mode);
    if (err == ESP_OK) (void)wifi_radio_restart_configs_record("ftm-recovery-checkpoint-complete", ESP_OK, false);
    wifi_radio_operation_unlock();
    return err;
done:
    (void)wifi_radio_restart_configs_record(stage, err, false);
    wifi_radio_operation_unlock();
    return err;
}

