99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_check_stopped_ftm_recovery(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_ftm_recovery_exact_locked(token) || !s_ftm.recovery_stopped || s_radio.started ||
        s_radio.stop_required || s_radio.stop_submitted || s_radio.event_phase != RADIO_EVENTS_IDLE ||
        s_radio.wake_locks != 0U || s_radio.promiscuous_claimed || s_radio.restart_required ||
        (s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STOPPED &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_CLEANUP_PENDING &&
         s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED)) goto done;
    uint32_t allowed = 0;
    if (s_ftm.lease.acquired || s_radio.operation.identity != 0U) {
        if (!wifi_radio_ftm_exact_locked(&s_ftm.state.token) || !s_ftm.state.submitted || s_ftm.state.dispatching) goto done;
        allowed = s_ftm.lease.identity;
    }
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U && s_radio.leases[i].identity != allowed) goto done;
    err = ESP_OK;
done:
    wifi_radio_operation_unlock();
    return err;
}

static esp_err_t wifi_radio_ftm_recovery_phase(const esp32_mquickjs_wifi_radio_lifecycle_t *token, bool shutdown)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (wifi_radio_ftm_recovery_exact_locked(token)) {
        const esp32_mquickjs_wifi_radio_lease_t *allowed = s_ftm.lease.acquired ? &s_ftm.lease : NULL;
        err = shutdown ? wifi_radio_shutdown_lease_locked(allowed, false) : wifi_radio_stop_lease_locked(allowed, false);
    }
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_stop_ftm_recovery(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    return wifi_radio_ftm_recovery_phase(token, false);
}

esp_err_t esp32_mquickjs_wifi_radio_shutdown_ftm_recovery(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    return wifi_radio_ftm_recovery_phase(token, true);
}

esp_err_t esp32_mquickjs_wifi_radio_finish_ftm_recovery(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_ftm_recovery_exact_locked(token) || !s_ftm.recovery_stopped || !s_ftm.recovery_sdk_ready ||
        s_radio.driver_owned || s_radio.started || s_radio.stop_required || s_radio.stop_submitted ||
        s_radio.event_phase != RADIO_EVENTS_IDLE || s_radio.operation.identity != 0U || s_ftm.lease.acquired ||
        s_radio.wake_locks != 0U || s_radio.promiscuous_claimed || s_radio.restart_required ||
        s_radio.fault_stage != NULL || s_radio.cleanup_stage != NULL ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_UNINITIALIZED) goto done;
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i)
        if (s_radio.leases[i].identity != 0U) goto done;
    /* Retain central lifecycle/checkpoints until ordinary restore or cleanup. */
    memset(&s_ftm.recovery, 0, sizeof(s_ftm.recovery));
    s_ftm.recovery_stopped = s_ftm.recovery_timer_started = s_ftm.recovery_timer_ready = s_ftm.recovery_sdk_ready = false;
    err = ESP_OK;
done:
    wifi_radio_operation_unlock();
    return err;
}

static esp_err_t wifi_radio_ftm_admit_locked(const wifi_ftm_initiator_cfg_t *config,
    esp32_mquickjs_wifi_ftm_token_t *token)
{
    if (!s_radio.driver_owned || !s_radio.storage_configured || !s_radio.started ||
        s_radio.driver_state != ESP32_MQUICKJS_WIFI_RADIO_STARTED || s_radio.lifecycle.identity != 0U ||
        s_radio.operation.identity != 0U || s_radio.restart_required || s_radio.cleanup_stage != NULL ||
        s_ftm.state.token.identity != 0U) return ESP_ERR_INVALID_STATE;
    if (s_radio.fault_stage != NULL) return s_radio.fault_error;
    if (s_radio.next_operation_identity == 0U) return ESP_ERR_NO_MEM;
    wifi_mode_t mode;
    esp_err_t err = esp_wifi_get_mode(&mode);
    if (err != ESP_OK) return err;
    if (mode != s_radio.effective_mode || !(mode & WIFI_MODE_STA)) return ESP_ERR_INVALID_STATE;
    err = wifi_radio_validate_regulatory_channel(config->channel);
    if (err != ESP_OK) return err;
    uint8_t current;
    wifi_second_chan_t secondary;
    uint32_t generation;
    err = wifi_radio_get_channel_locked(&current, &secondary, &generation);
    if (err != ESP_OK) return err;
    bool off_channel = current != config->channel;
    if (off_channel) {
        if (mode & WIFI_MODE_AP) return ESP_ERR_INVALID_STATE;
        wifi_ap_record_t ap;
        err = esp_wifi_sta_get_ap_info(&ap);
        if (err == ESP_OK) return ESP_ERR_INVALID_STATE;
        if (err != ESP_ERR_WIFI_NOT_CONNECT) return err;
        secondary = WIFI_SECOND_CHAN_NONE;
    }
    bool conflict = false;
    taskENTER_CRITICAL(&s_radio.lock);
    for (size_t i = 0; i < WIFI_RADIO_MAX_LEASES; ++i) {
        const wifi_radio_live_lease_t *owner = &s_radio.leases[i];
        if (owner->identity == 0U) continue;
        if (owner->raw_tx_identity != 0U || owner->channel_conflict ||
            (owner->fixed_channel && (owner->primary_channel != config->channel ||
                owner->secondary_channel != (uint8_t)secondary))) conflict = true;
        if (off_channel && owner->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_APPLICATION &&
            owner->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_WIFI_STA &&
            owner->client != ESP32_MQUICKJS_WIFI_RADIO_CLIENT_VENDOR_IE) conflict = true;
    }
    taskEXIT_CRITICAL(&s_radio.lock);
    if (conflict) return ESP_ERR_INVALID_STATE;
    err = wifi_radio_acquire_locked(ESP32_MQUICKJS_WIFI_RADIO_CLIENT_FTM, WIFI_MODE_STA, &s_ftm.lease);
    if (err != ESP_OK) return err;
    taskENTER_CRITICAL(&s_radio.lock);
    s_radio.operation = (esp32_mquickjs_wifi_radio_operation_t){
        .generation = s_radio.generation, .identity = s_radio.next_operation_identity++,
        .lease_identity = s_ftm.lease.identity, .kind = ESP32_MQUICKJS_WIFI_RADIO_OPERATION_FTM,
    };
    *token = (esp32_mquickjs_wifi_ftm_token_t){s_radio.generation, s_radio.operation.identity};
    s_ftm.state = (esp32_mquickjs_wifi_ftm_state_t){.token = *token};
    s_ftm.config = *config;
    s_ftm.fence_posted = false;
    s_ftm.posted_revision = 0;
    wifi_radio_live_lease_t *owner = wifi_radio_promiscuous_owner(s_ftm.lease.identity);
    owner->fixed_channel = true;
    owner->primary_channel = config->channel;
    owner->secondary_channel = (uint8_t)secondary;
    taskEXIT_CRITICAL(&s_radio.lock);
    return ESP_OK;
}

bool esp32_mquickjs_wifi_ftm_config_valid(const wifi_ftm_initiator_cfg_t *config)
{
    return config != NULL && config->channel != 0U && !(config->resp_mac[0] & 1U) &&
        memcmp(config->resp_mac, "\0\0\0\0\0\0", 6) != 0 && config->burst_period <= 100U && config->burst_period != 1U &&
        (config->frm_count == 0U || config->frm_count == 16U || config->frm_count == 24U ||
         config->frm_count == 32U || config->frm_count == 64U);
}

