99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_radio/esp32_mquickjs_wifi_radio.c
esp_err_t esp32_mquickjs_wifi_radio_ftm_start(const wifi_ftm_initiator_cfg_t *config,
    esp32_mquickjs_wifi_ftm_token_t *token)
{
    if (!esp32_mquickjs_wifi_ftm_config_valid(config) || token == NULL ||
        token->identity != 0U || token->generation != 0U) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = wifi_radio_ftm_admit_locked(config, token);
    if (err == ESP_OK) {
        taskENTER_CRITICAL(&s_radio.lock);
        s_ftm.state.dispatching = true;
        taskEXIT_CRITICAL(&s_radio.lock);
        /* Keep the request stable even beyond the synchronous SDK wrapper.
         * An early event may arrive while this call is still returning. */
        err = esp_wifi_ftm_initiate_session(&s_ftm.config);
        taskENTER_CRITICAL(&s_radio.lock);
        s_ftm.state.dispatching = false;
        s_ftm.state.submitted = true;
        s_ftm.state.submit_error = err;
        taskEXIT_CRITICAL(&s_radio.lock);
    }
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_ftm_end(const esp32_mquickjs_wifi_ftm_token_t *token)
{
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_ftm_exact_locked(token)) goto done;
    if (wifi_radio_ftm_recovery_exact_locked(&s_radio.lifecycle)) {
        err = s_ftm.state.physical_termination ? ESP_OK : ESP_ERR_TIMEOUT;
        goto done;
    }
    taskENTER_CRITICAL(&s_radio.lock);
    s_ftm.state.end_requested = true;
    bool terminal = s_ftm.state.terminal;
    bool submit = s_ftm.state.submitted && !terminal && !s_ftm.state.end_written && !s_ftm.state.ambiguous;
    err = s_ftm.state.ambiguous ? ESP_ERR_INVALID_STATE : terminal ? ESP_OK : s_ftm.state.end_error;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (terminal && err == ESP_OK) goto done;
    if (submit) {
        err = esp_wifi_ftm_end_session();
        taskENTER_CRITICAL(&s_radio.lock);
        s_ftm.state.end_error = err;
        if (err == ESP_OK) s_ftm.state.end_written = true;
        taskEXIT_CRITICAL(&s_radio.lock);
    }
done:
    wifi_radio_operation_unlock();
    return err;
}

void esp32_mquickjs_wifi_radio_ftm_snapshot(esp32_mquickjs_wifi_ftm_state_t *out)
{
    if (out == NULL) return;
    taskENTER_CRITICAL(&s_radio.lock);
    *out = s_ftm.state;
    taskEXIT_CRITICAL(&s_radio.lock);
}

bool esp32_mquickjs_wifi_radio_ftm_status(const esp32_mquickjs_wifi_ftm_token_t *token,
    esp32_mquickjs_wifi_ftm_state_t *out)
{
    if (out == NULL) return false;
    wifi_radio_operation_lock();
    bool exact = wifi_radio_ftm_exact_locked(token);
    if (exact) esp32_mquickjs_wifi_radio_ftm_snapshot(out);
    wifi_radio_operation_unlock();
    return exact;
}

static void wifi_radio_ftm_timer_fence_callback(void *arg)
{
    (void)arg;
    /* TASK callbacks are serialized: every previously running legacy SDK timer
     * callback has returned before this final store. No Radio mutex here. */
    atomic_store_explicit(&s_ftm_timer_fence.completed, true, memory_order_release);
}

static esp_err_t wifi_radio_ftm_timer_fence_locked(const esp32_mquickjs_wifi_ftm_state_t *state)
{
    if (s_ftm_timer_fence.pending) {
        if (!atomic_load_explicit(&s_ftm_timer_fence.completed, memory_order_acquire)) return ESP_ERR_TIMEOUT;
        s_ftm_timer_fence.pending = false;
        bool exact = s_ftm_timer_fence.token.identity == state->token.identity &&
            s_ftm_timer_fence.token.generation == state->token.generation &&
            s_ftm_timer_fence.revision == state->revision;
        if (exact) return ESP_OK;
        /* An old completion cannot certify a later report revision. */
    }
    if (s_ftm_timer_fence.handle == NULL) {
        const esp_timer_create_args_t args = {.callback = wifi_radio_ftm_timer_fence_callback,
            .dispatch_method = ESP_TIMER_TASK, .name = "qjs_ftm_fence"};
        esp_err_t err = esp_timer_create(&args, &s_ftm_timer_fence.handle);
        if (err != ESP_OK) return err;
    }
    s_ftm_timer_fence.token = state->token;
    s_ftm_timer_fence.revision = state->revision;
    atomic_store_explicit(&s_ftm_timer_fence.completed, false, memory_order_release);
    esp_err_t err = esp_timer_start_once(s_ftm_timer_fence.handle, 1);
    if (err != ESP_OK) return err;
    s_ftm_timer_fence.pending = true;
    return ESP_ERR_TIMEOUT;
}

static esp_err_t wifi_radio_ftm_recovery_timer_locked(void)
{
    if (!wifi_radio_ftm_recovery_exact_locked(&s_radio.lifecycle) || !s_ftm.recovery_stopped ||
        s_radio.started || s_radio.stop_required) return ESP_ERR_INVALID_STATE;
    if (s_ftm.recovery_sdk_ready) return ESP_OK;
    if (!s_ftm.recovery_timer_started) {
        /* An ordinary retirement marker may have completed before STOP. Drain
         * it, then require a fresh marker armed after SDK timer destruction. */
        if (s_ftm_timer_fence.pending) {
            if (!atomic_load_explicit(&s_ftm_timer_fence.completed, memory_order_acquire)) return ESP_ERR_TIMEOUT;
            s_ftm_timer_fence.pending = false;
        }
        s_ftm.recovery_timer_started = true;
    }
    esp_err_t err = ESP_OK;
    if (!s_ftm.recovery_timer_ready) {
        esp32_mquickjs_wifi_ftm_state_t state;
        esp32_mquickjs_wifi_radio_ftm_snapshot(&state);
        err = wifi_radio_ftm_timer_fence_locked(&state);
        if (err != ESP_OK) return err;
        s_ftm.recovery_timer_ready = true;
    }
    /* Drain native work queued by the last timer callback. A queue barrier does
     * not claim the off-channel record is empty; physical deinit follows. */
    err = esp32_mquickjs_wifi_action_sdk_fence();
    if (err == ESP_OK) s_ftm.recovery_sdk_ready = true;
    return err;
}

/* Fixed SDK terminal paths disarm/destroy timers before posting the report and
 * free initiator context after that post. ets_timer_done only queues deletion;
 * first fence the ESP_TIMER_TASK callbacks, then serialize through the native
 * queue before accepting retirement. Also require the shared off-channel record
 * to be fully empty. The event alone and end_session's return are insufficient. */
static esp_err_t wifi_radio_ftm_fence_locked(esp32_mquickjs_wifi_ftm_state_t *out)
{
    esp32_mquickjs_wifi_radio_ftm_snapshot(out);
    if (!out->submitted || !out->terminal || out->ambiguous || out->revision == UINT32_MAX)
        return ESP_ERR_TIMEOUT;
    if (out->sdk_fenced) return ESP_OK;
    uint32_t revision = out->revision;
    esp_err_t err = wifi_radio_ftm_timer_fence_locked(out);
    if (err != ESP_OK) return err;
    err = esp32_mquickjs_wifi_action_sdk_quiescent();
    if (err != ESP_OK) return err;
    taskENTER_CRITICAL(&s_radio.lock);
    bool ready = s_ftm.state.revision == revision && !s_ftm.state.ambiguous;
    if (ready) s_ftm.state.sdk_fenced = true;
    *out = s_ftm.state;
    taskEXIT_CRITICAL(&s_radio.lock);
    return ready ? ESP_OK : ESP_ERR_TIMEOUT;
}

esp_err_t esp32_mquickjs_wifi_radio_ftm_collect(const esp32_mquickjs_wifi_ftm_token_t *token,
    wifi_ftm_report_entry_t *entries, size_t bytes, unsigned capacity,
    esp32_mquickjs_wifi_ftm_state_t *out)
{
    if (out == NULL || capacity > ESP32_MQUICKJS_WIFI_FTM_MAX_REPORT_ENTRIES ||
        (entries == NULL) != (capacity == 0U) || bytes != capacity * sizeof(*entries)) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_ftm_exact_locked(token)) goto done;
    if (wifi_radio_ftm_recovery_exact_locked(&s_radio.lifecycle)) {
        esp32_mquickjs_wifi_radio_ftm_snapshot(out);
        err = s_ftm.state.physical_termination ? ESP_ERR_INVALID_STATE : ESP_ERR_TIMEOUT;
        goto done;
    }
    err = wifi_radio_ftm_fence_locked(out);
    if (err != ESP_OK) goto done;
    if (out->report_consumed) { err = ESP_ERR_INVALID_STATE; goto done; }
    uint32_t revision = out->revision;
    unsigned count = out->report.ftm_report_num_entries;
    if (count > capacity) count = capacity;
    if (bytes != 0U) memset(entries, 0, bytes);
    /* Even non-success/empty summaries require the free-only SDK suffix. */
    err = esp_wifi_ftm_get_report(count == 0U ? NULL : entries, (uint8_t)count);
    taskENTER_CRITICAL(&s_radio.lock);
    s_ftm.state.report_error = err;
    if (err == ESP_OK) {
        s_ftm.state.report_consumed = true;
        s_ftm.state.report_discarded = entries == NULL;
        if (s_ftm.state.revision != revision || s_ftm.state.ambiguous) {
            s_ftm.state.ambiguous = true;
            s_ftm.state.sdk_fenced = s_ftm.state.event_fenced = false;
            err = ESP_ERR_INVALID_RESPONSE;
        } else s_ftm.state.copied_entries = (uint8_t)count;
    }
    *out = s_ftm.state;
    taskEXIT_CRITICAL(&s_radio.lock);
    if (err != ESP_OK && bytes != 0U) memset(entries, 0, bytes);
done:
    wifi_radio_operation_unlock();
    return err;
}

esp_err_t esp32_mquickjs_wifi_radio_ftm_retire(esp32_mquickjs_wifi_ftm_token_t *token,
    esp32_mquickjs_wifi_ftm_state_t *out)
{
    if (out == NULL) return ESP_ERR_INVALID_ARG;
    wifi_radio_operation_lock();
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (!wifi_radio_ftm_exact_locked(token)) goto done;
    esp32_mquickjs_wifi_radio_ftm_snapshot(out);
    bool physical = out->physical_termination;
    if (wifi_radio_ftm_recovery_exact_locked(&s_radio.lifecycle) && !physical) { err = ESP_ERR_TIMEOUT; goto done; }
    if (physical) {
        if (!wifi_radio_ftm_recovery_exact_locked(&s_radio.lifecycle) || !s_ftm.recovery_stopped ||
            !s_ftm.recovery_sdk_ready || s_radio.driver_owned || s_radio.started || s_radio.stop_required) goto done;
        goto release_owner;
    }
    if (!out->report_consumed) { err = ESP_ERR_TIMEOUT; goto done; }
    err = wifi_radio_ftm_fence_locked(out);
    if (err != ESP_OK) goto done;
    taskENTER_CRITICAL(&s_radio.lock);
    wifi_radio_ftm_fence_t fence = {.token = *token, .revision = s_ftm.state.revision};
    bool post = !s_ftm.state.event_fenced && !s_ftm.fence_posted && s_ftm.state.sdk_fenced && !s_ftm.state.ambiguous;
    if (post) { s_ftm.fence_posted = true; s_ftm.posted_revision = fence.revision; }
    taskEXIT_CRITICAL(&s_radio.lock);
    if (post) {
        err = esp_event_post(ESP32QJS_WIFI_RADIO_CONTROL_EVENT, 3, &fence, sizeof(fence), 0);
        if (err != ESP_OK) {
            taskENTER_CRITICAL(&s_radio.lock);
            if (s_ftm.posted_revision == fence.revision) s_ftm.fence_posted = false;
            taskEXIT_CRITICAL(&s_radio.lock);
            goto done;
        }
    }
release_owner:
    taskENTER_CRITICAL(&s_radio.lock);
    *out = s_ftm.state;
    bool release = physical || (out->sdk_fenced && out->event_fenced && !out->ambiguous);
    if (release) {
        memset(&s_radio.operation, 0, sizeof(s_radio.operation));
        memset(&s_ftm.state, 0, sizeof(s_ftm.state));
        memset(&s_ftm.config, 0, sizeof(s_ftm.config));
        s_ftm.fence_posted = false;
        *token = (esp32_mquickjs_wifi_ftm_token_t){0};
    }
    taskEXIT_CRITICAL(&s_radio.lock);
    if (release) { wifi_radio_release_locked(&s_ftm.lease); err = ESP_OK; }
    else err = ESP_ERR_TIMEOUT;
done:
    wifi_radio_operation_unlock();
    return err;
}
#endif

#endif

#endif
